(function(e) {
    var t = {
        id: "0dd3c075f303fe34bafc6a52f4ed7aa8",
        filename: "hogan-2.0.0-fixed.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(e, t, n) {
        var r = {};
        (function(e, t) {
            function a(e) {
                return String(e === null  || e === undefined ? "" : e)
            }
            function f(e) {
                e = a(e);
                return u.test(e) ? e.replace(n, "&amp;").replace(r, "&lt;").replace(i, "&gt;").replace(s, "&#39;").replace(o, "&quot;") : e
            }
            e.Template = function(e, n, r, i) {
                this.r = e || this.r;
                this.c = r;
                this.options = i;
                this.text = n || "";
                this.buf = t ? [] : ""
            }
            ;
            e.Template.prototype = {
                r: function(e, t, n) {
                    return ""
                },
                v: f,
                t: a,
                render: function(t, n, r) {
                    return this.ri([t], n || {}, r)
                },
                ri: function(e, t, n) {
                    return this.r(e, t, n)
                },
                rp: function(e, t, n, r) {
                    var i = n[e];
                    if (!i) {
                        return ""
                    }
                    if (this.c && typeof i == "string") {
                        i = this.c.compile(i, this.options)
                    }
                    return i.ri(t, n, r)
                },
                rs: function(e, t, n) {
                    var r = e[e.length - 1];
                    if (!l(r)) {
                        n(e, t, this);
                        return
                    }
                    for (var i = 0; i < r.length; i++) {
                        e.push(r[i]);
                        n(e, t, this);
                        e.pop()
                    }
                },
                s: function(e, t, n, r, i, s, o) {
                    var u;
                    if (l(e) && e.length === 0) {
                        return false
                    }
                    if (typeof e == "function") {
                        e = this.ls(e, t, n, r, i, s, o)
                    }
                    u = !!e;
                    if (!r && u && t) {
                        t.push(typeof e == "object" ? e : t[t.length - 1])
                    }
                    return u
                },
                d: function(e, t, n, r) {
                    var i = e.split(".")
                      , s = this.f(i[0], t, n, r)
                      , o = null ;
                    if (e === "." && l(t[t.length - 2])) {
                        return t[t.length - 1]
                    }
                    for (var u = 1; u < i.length; u++) {
                        if (s && typeof s == "object" && i[u] in s) {
                            o = s;
                            s = s[i[u]]
                        } else {
                            s = ""
                        }
                    }
                    if (r && !s) {
                        return false
                    }
                    if (!r && typeof s == "function") {
                        t.push(o);
                        s = this.lv(s, t, n);
                        t.pop()
                    }
                    return s
                },
                f: function(e, t, n, r) {
                    var i = false
                      , s = null 
                      , o = false;
                    for (var u = t.length - 1; u >= 0; u--) {
                        s = t[u];
                        if (s && typeof s == "object" && e in s) {
                            i = s[e];
                            o = true;
                            break
                        }
                    }
                    if (!o) {
                        return r ? false : ""
                    }
                    if (!r && typeof i == "function") {
                        i = this.lv(i, t, n)
                    }
                    return i
                },
                ho: function(e, t, n, r, i) {
                    var s = this.c;
                    var o = this.options;
                    o.delimiters = i;
                    var r = e.call(t, r);
                    r = r == null  ? String(r) : r.toString();
                    this.b(s.compile(r, o).render(t, n));
                    return false
                },
                b: t ? function(e) {
                    this.buf.push(e)
                }
                 : function(e) {
                    this.buf += e
                }
                ,
                fl: t ? function() {
                    var e = this.buf.join("");
                    this.buf = [];
                    return e
                }
                 : function() {
                    var e = this.buf;
                    this.buf = "";
                    return e
                }
                ,
                ls: function(e, t, n, r, i, s, o) {
                    var u = t[t.length - 1]
                      , a = null ;
                    if (!r && this.c && e.length > 0) {
                        return this.ho(e, u, n, this.text.substring(i, s), o)
                    }
                    a = e.call(u);
                    if (typeof a == "function") {
                        if (r) {
                            return true
                        } else if (this.c) {
                            return this.ho(a, u, n, this.text.substring(i, s), o)
                        }
                    }
                    return a
                },
                lv: function(e, t, n) {
                    var r = t[t.length - 1];
                    var i = e.call(r);
                    if (typeof i == "function") {
                        i = a(i.call(r));
                        if (this.c && ~i.indexOf("{{")) {
                            return this.c.compile(i, this.options).render(r, n)
                        }
                    }
                    return a(i)
                }
            };
            var n = /&/g
              , r = /</g
              , i = />/g
              , s = /\'/g
              , o = /\"/g
              , u = /[&<>\"\']/;
            var l = Array.isArray || function(e) {
                return Object.prototype.toString.call(e) === "[object Array]"
            }
        }
        )(typeof e !== "undefined" ? e : r, true);
        (function(e) {
            function u(e) {
                if (e.n.substr(e.n.length - 1) === "}") {
                    e.n = e.n.substring(0, e.n.length - 1)
                }
            }
            function a(e) {
                if (e.trim) {
                    return e.trim()
                }
                return e.replace(/^\s*|\s*$/g, "")
            }
            function f(e, t, n) {
                if (t.charAt(n) != e.charAt(0)) {
                    return false
                }
                for (var r = 1, i = e.length; r < i; r++) {
                    if (t.charAt(n + r) != e.charAt(r)) {
                        return false
                    }
                }
                return true
            }
            function l(e, t, n, r) {
                var i = []
                  , s = null 
                  , o = null ;
                while (e.length > 0) {
                    o = e.shift();
                    if (o.tag == "#" || o.tag == "^" || c(o, r)) {
                        n.push(o);
                        o.nodes = l(e, o.tag, n, r);
                        i.push(o)
                    } else if (o.tag == "/") {
                        if (n.length === 0) {
                            throw new Error("Closing tag without opener: /" + o.n)
                        }
                        s = n.pop();
                        if (o.n != s.n && !h(o.n, s.n, r)) {
                            throw new Error("Nesting error: " + s.n + " vs. " + o.n)
                        }
                        s.end = o.i;
                        return i
                    } else {
                        i.push(o)
                    }
                }
                if (n.length > 0) {
                    throw new Error("missing closing tag: " + n.pop().n)
                }
                return i
            }
            function c(e, t) {
                for (var n = 0, r = t.length; n < r; n++) {
                    if (t[n].o == e.n) {
                        e.tag = "#";
                        return true
                    }
                }
            }
            function h(e, t, n) {
                for (var r = 0, i = n.length; r < i; r++) {
                    if (n[r].c == e && n[r].o == t) {
                        return true
                    }
                }
            }
            function p(e) {
                return e.replace(s, "\\\\").replace(n, '\\"').replace(r, "\\n").replace(i, "\\r")
            }
            function d(e) {
                return ~e.indexOf(".") ? "d" : "f"
            }
            function v(e) {
                var t = [];
                for (var n = 0, r = e.length; n < r; n++) {
                    var i = e[n].tag;
                    if (i == "#") {
                        t.push(m(e[n].nodes, e[n].n, d(e[n].n), e[n].i, e[n].end, e[n].otag + " " + e[n].ctag))
                    } else if (i == "^") {
                        t.push(g(e[n].nodes, e[n].n, d(e[n].n)))
                    } else if (i == "<" || i == ">") {
                        t.push(y(e[n]))
                    } else if (i == "{" || i == "&") {
                        t.push(b(e[n].n, d(e[n].n)))
                    } else if (i == "\n") {
                        t.push(E('"\\n"' + (e.length - 1 == n ? "" : " + i")))
                    } else if (i == "_v") {
                        t.push(w(e[n].n, d(e[n].n)))
                    } else if (i === undefined) {
                        t.push(E('"' + p(e[n]) + '"'))
                    }
                }
                return t.join("")
            }
            function m(e, t, n, r, i, s) {
                return "if(_.s(_." + n + '("' + p(t) + '",c,p,1),' + "c,p,0," + r + "," + i + ',"' + s + '")){' + "_.rs(c,p," + "function(c,p,_){" + v(e) + "});c.pop();}"
            }
            function g(e, t, n) {
                return "if(!_.s(_." + n + '("' + p(t) + '",c,p,1),c,p,1,0,0,"")){' + v(e) + "};"
            }
            function y(e) {
                return '_.b(_.rp("' + p(e.n) + '",c,p,"' + (e.indent || "") + '"));'
            }
            function b(e, t) {
                return "_.b(_.t(_." + t + '("' + p(e) + '",c,p,0)));'
            }
            function w(e, t) {
                return "_.b(_.v(_." + t + '("' + p(e) + '",c,p,0)));'
            }
            function E(e) {
                return "_.b(" + e + ");"
            }
            var t = /\S/
              , n = /\"/g
              , r = /\n/g
              , i = /\r/g
              , s = /\\/g
              , o = {
                "#": 1,
                "^": 2,
                "/": 3,
                "!": 4,
                ">": 5,
                "<": 6,
                "=": 7,
                _v: 8,
                "{": 9,
                "&": 10
            };
            e.scan = function(n, r) {
                function S() {
                    if (v.length > 0) {
                        m.push(new String(v));
                        v = ""
                    }
                }
                function x() {
                    var e = true;
                    for (var n = b; n < m.length; n++) {
                        e = m[n].tag && o[m[n].tag] < o["_v"] || !m[n].tag && m[n].match(t) === null ;
                        if (!e) {
                            return false
                        }
                    }
                    return e
                }
                function T(e, t) {
                    S();
                    if (e && x()) {
                        for (var n = b, r; n < m.length; n++) {
                            if (!m[n].tag) {
                                if ((r = m[n + 1]) && r.tag == ">") {
                                    r.indent = m[n].toString()
                                }
                                m.splice(n, 1)
                            }
                        }
                    } else if (!t) {
                        m.push({
                            tag: "\n"
                        })
                    }
                    g = false;
                    b = m.length
                }
                function N(e, t) {
                    var n = "=" + E
                      , r = e.indexOf(n, t)
                      , i = a(e.substring(e.indexOf("=", t) + 1, r)).split(" ");
                    w = i[0];
                    E = i[1];
                    return r + n.length - 1
                }
                var i = n.length
                  , s = 0
                  , l = 1
                  , c = 2
                  , h = s
                  , p = null 
                  , d = null 
                  , v = ""
                  , m = []
                  , g = false
                  , y = 0
                  , b = 0
                  , w = "{{"
                  , E = "}}";
                if (r) {
                    r = r.split(" ");
                    w = r[0];
                    E = r[1]
                }
                for (y = 0; y < i; y++) {
                    if (h == s) {
                        if (f(w, n, y)) {
                            --y;
                            S();
                            h = l
                        } else {
                            if (n.charAt(y) == "\n") {
                                T(g)
                            } else {
                                v += n.charAt(y)
                            }
                        }
                    } else if (h == l) {
                        y += w.length - 1;
                        d = o[n.charAt(y + 1)];
                        p = d ? n.charAt(y + 1) : "_v";
                        if (p == "=") {
                            y = N(n, y);
                            h = s
                        } else {
                            if (d) {
                                y++
                            }
                            h = c
                        }
                        g = y
                    } else {
                        if (f(E, n, y)) {
                            m.push({
                                tag: p,
                                n: a(v),
                                otag: w,
                                ctag: E,
                                i: p == "/" ? g - E.length : y + w.length
                            });
                            v = "";
                            y += E.length - 1;
                            h = s;
                            if (p == "{") {
                                if (E == "}}") {
                                    y++
                                } else {
                                    u(m[m.length - 1])
                                }
                            }
                        } else {
                            v += n.charAt(y)
                        }
                    }
                }
                T(g, true);
                return m
            }
            ;
            e.generate = function(t, n, r) {
                var i = 'var _=this;_.b(i=i||"");' + v(t) + "return _.fl();";
                if (r.asString) {
                    return "function(c,p,i){" + i + ";}"
                }
                return new e.Template(new Function("c","p","i",i),n,e,r)
            }
            ;
            e.parse = function(e, t, n) {
                n = n || {};
                return l(e, "", [], n.sectionTags || [])
            }
            ,
            e.cache = {};
            e.compile = function(e, t) {
                t = t || {};
                var n = e + "||" + !!t.asString;
                var r = this.cache[n];
                if (r) {
                    return r
                }
                r = this.generate(this.parse(this.scan(e, t.delimiters), e, t), e, t);
                return this.cache[n] = r
            }
            ;
            window.Hogan = e
        }
        )(typeof e !== "undefined" ? e : r)
    }
    (t.exports, t, e);
    e.____MODULES["0dd3c075f303fe34bafc6a52f4ed7aa8"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "312540359c661f626d6031b9f938e9a2",
        filename: "index.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(e, t, n) {
        function r(e) {
            var t = this;
            return function() {
                e.apply(t, arguments)
            }
        }
        e.create = function(e) {
            var t = function() {
                if (this.initialize) {
                    this.initialize.apply(this, arguments)
                }
            }
            ;
            if (e) {
                var n = function() {}
                ;
                n.prototype = e.prototype;
                t.prototype = new n;
                t.prototype._supper = e.prototype
            }
            t.fn = t.prototype;
            t.fn.constructor = t;
            t.fn.proxy = r;
            return t
        }
    }
    (t.exports, t, e);
    e.____MODULES["312540359c661f626d6031b9f938e9a2"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "285adc5af3055e36addfeabe5289c690",
        filename: "channel.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        var i = e.____MODULES["312540359c661f626d6031b9f938e9a2"];
        var s = i.create();
        s.fn.initialize = function() {
            this._evt = $({})
        }
        ;
        $.each(["on", "off", "one", "trigger"], function(e, t) {
            s.fn[t] = function() {
                var e = this._evt;
                e[t].apply(e, arguments)
            }
        }
        );
        n.exports = new s
    }
    (t.exports, t, e);
    e.____MODULES["285adc5af3055e36addfeabe5289c690"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "a22f37bb1b28023d69e4ac11871e89f1",
        filename: "log4j.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        function u(e) {
            if (window.location.search.indexOf("debugger") > -1) {
                e()
            }
        }
        var i = e.____MODULES["285adc5af3055e36addfeabe5289c690"];
        var s = e.____MODULES["312540359c661f626d6031b9f938e9a2"];
        var o = s.create();
        o.fn.initialize = function() {
            var e = this;
            this.logpond = [];
            this.div = $('<div class="LOG4J LOG4JHIDE">');
            u(function() {
                e.bind()
            }
            )
        }
        ;
        o.fn.bind = function() {
            var e = this;
            $(document).keyup(function(t) {
                try {
                    if (t.which == 220) {
                        e._show();
                        $(".LOG4J").toggleClass("LOG4JHIDE")
                    }
                } catch (t) {}
            }
            );
            i.on("LOG4J.info", function() {
                e.info(Array.prototype.slice.call(arguments, 1))
            }
            );
            i.on("LOG4J.warn", function() {
                e.warn(Array.prototype.slice.call(arguments, 1))
            }
            );
            i.on("LOG4J.error", function() {
                e.error(Array.prototype.slice.call(arguments, 1))
            }
            )
        }
        ;
        o.fn.info = function() {
            this._format("info", this._changeArgs2Array(arguments))
        }
        ;
        o.fn.warn = function() {
            this._format("warn", this._changeArgs2Array(arguments))
        }
        ;
        o.fn.error = function() {
            this._format("error", this._changeArgs2Array(arguments))
        }
        ;
        o.fn.send = function() {}
        ;
        o.fn._show = function() {
            var e = this;
            var t = this.logpond;
            var n = this.div;
            var r = ['<h3><span class="close">X</span>页面加载日志 ^=^ (非彩蛋) <span>%E5%BD%A9%E8%9B%8B: Y29zcHZpbw==</span></h3><ul>'];
            $.each(t, function(e, t) {
                var n = t[0];
                var i = t.slice(1);
                r.push('<li class="', n, '">', i.join(""), "</li>")
            }
            );
            r.push("</ul>");
            n.html(r.join(""));
            if (!$("div.LOG4J").length) {
                n.appendTo($("body"))
            }
            $(".LOG4J").find("h3").click(function(e) {
                $(".LOG4J").removeClass("LOG4JHIDE");
                e.preventDefault();
                e.stopPropagation()
            }
            );
            $(".LOG4J").find("span.close").click(function(e) {
                $(".LOG4J").addClass("LOG4JHIDE");
                e.stopPropagation()
            }
            )
        }
        ;
        o.fn._changeArgs2Array = function(e) {
            var t = [];
            $.each(e[0], function(e, n) {
                t.push(n)
            }
            );
            return t
        }
        ;
        o.fn._format = function(e, t) {
            var t = [this._time(), " ", t.join("")];
            t.splice(0, 0, e);
            this.logpond.push(t)
        }
        ;
        o.fn._time = function() {
            return (new Date).getTime()
        }
        ;
        n.exports = new o
    }
    (t.exports, t, e);
    e.____MODULES["a22f37bb1b28023d69e4ac11871e89f1"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "4073076a426d4130d4ef3bbe9d5e7173",
        filename: "AreaData.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(e, t, n) {
        var r = {
            11e4: ["北京", "1"],
            110100: ["北京市", "110000"],
            110101: ["东城区", "110100"],
            110102: ["西城区", "110100"],
            110103: ["崇文区", "110100"],
            110104: ["宣武区", "110100"],
            110105: ["朝阳区", "110100"],
            110106: ["丰台区", "110100"],
            110107: ["石景山区", "110100"],
            110108: ["海淀区", "110100"],
            110109: ["门头沟区", "110100"],
            110111: ["房山区", "110100"],
            110112: ["通州区", "110100"],
            110113: ["顺义区", "110100"],
            110114: ["昌平区", "110100"],
            110115: ["大兴区", "110100"],
            110116: ["怀柔区", "110100"],
            110117: ["平谷区", "110100"],
            110228: ["密云县", "110100"],
            110229: ["延庆县", "110100"],
            110230: ["其它区", "110100"],
            12e4: ["天津", "1"],
            120100: ["天津市", "120000"],
            120101: ["和平区", "120100"],
            120102: ["河东区", "120100"],
            120103: ["河西区", "120100"],
            120104: ["南开区", "120100"],
            120105: ["河北区", "120100"],
            120106: ["红桥区", "120100"],
            120107: ["塘沽区", "120100"],
            120108: ["汉沽区", "120100"],
            120109: ["大港区", "120100"],
            120110: ["东丽区", "120100"],
            120111: ["西青区", "120100"],
            120112: ["津南区", "120100"],
            120113: ["北辰区", "120100"],
            120114: ["武清区", "120100"],
            120115: ["宝坻区", "120100"],
            120116: ["滨海新区", "120100"],
            120221: ["宁河县", "120100"],
            120223: ["静海县", "120100"],
            120225: ["蓟县", "120100"],
            120226: ["其它区", "120100"],
            13e4: ["河北省", "1"],
            130100: ["石家庄市", "130000"],
            130102: ["长安区", "130100"],
            130103: ["桥东区", "130100"],
            130104: ["桥西区", "130100"],
            130105: ["新华区", "130100"],
            130107: ["井陉矿区", "130100"],
            130108: ["裕华区", "130100"],
            130121: ["井陉县", "130100"],
            130123: ["正定县", "130100"],
            130124: ["栾城县", "130100"],
            130125: ["行唐县", "130100"],
            130126: ["灵寿县", "130100"],
            130127: ["高邑县", "130100"],
            130128: ["深泽县", "130100"],
            130129: ["赞皇县", "130100"],
            130130: ["无极县", "130100"],
            130131: ["平山县", "130100"],
            130132: ["元氏县", "130100"],
            130133: ["赵县", "130100"],
            130181: ["辛集市", "130100"],
            130182: ["藁城市", "130100"],
            130183: ["晋州市", "130100"],
            130184: ["新乐市", "130100"],
            130185: ["鹿泉市", "130100"],
            130186: ["其它区", "130100"],
            130200: ["唐山市", "130000"],
            130202: ["路南区", "130200"],
            130203: ["路北区", "130200"],
            130204: ["古冶区", "130200"],
            130205: ["开平区", "130200"],
            130207: ["丰南区", "130200"],
            130208: ["丰润区", "130200"],
            130223: ["滦县", "130200"],
            130224: ["滦南县", "130200"],
            130225: ["乐亭县", "130200"],
            130227: ["迁西县", "130200"],
            130229: ["玉田县", "130200"],
            130230: ["唐海县", "130200"],
            130281: ["遵化市", "130200"],
            130283: ["迁安市", "130200"],
            130284: ["其它区", "130200"],
            130300: ["秦皇岛市", "130000"],
            130302: ["海港区", "130300"],
            130303: ["山海关区", "130300"],
            130304: ["北戴河区", "130300"],
            130321: ["青龙满族自治县", "130300"],
            130322: ["昌黎县", "130300"],
            130323: ["抚宁县", "130300"],
            130324: ["卢龙县", "130300"],
            130398: ["其它区", "130300"],
            130399: ["经济技术开发区", "130300"],
            130400: ["邯郸市", "130000"],
            130402: ["邯山区", "130400"],
            130403: ["丛台区", "130400"],
            130404: ["复兴区", "130400"],
            130406: ["峰峰矿区", "130400"],
            130421: ["邯郸县", "130400"],
            130423: ["临漳县", "130400"],
            130424: ["成安县", "130400"],
            130425: ["大名县", "130400"],
            130426: ["涉县", "130400"],
            130427: ["磁县", "130400"],
            130428: ["肥乡县", "130400"],
            130429: ["永年县", "130400"],
            130430: ["邱县", "130400"],
            130431: ["鸡泽县", "130400"],
            130432: ["广平县", "130400"],
            130433: ["馆陶县", "130400"],
            130434: ["魏县", "130400"],
            130435: ["曲周县", "130400"],
            130481: ["武安市", "130400"],
            130482: ["其它区", "130400"],
            130500: ["邢台市", "130000"],
            130502: ["桥东区", "130500"],
            130503: ["桥西区", "130500"],
            130521: ["邢台县", "130500"],
            130522: ["临城县", "130500"],
            130523: ["内丘县", "130500"],
            130524: ["柏乡县", "130500"],
            130525: ["隆尧县", "130500"],
            130526: ["任县", "130500"],
            130527: ["南和县", "130500"],
            130528: ["宁晋县", "130500"],
            130529: ["巨鹿县", "130500"],
            130530: ["新河县", "130500"],
            130531: ["广宗县", "130500"],
            130532: ["平乡县", "130500"],
            130533: ["威县", "130500"],
            130534: ["清河县", "130500"],
            130535: ["临西县", "130500"],
            130581: ["南宫市", "130500"],
            130582: ["沙河市", "130500"],
            130583: ["其它区", "130500"],
            130600: ["保定市", "130000"],
            130602: ["新市区", "130600"],
            130603: ["北市区", "130600"],
            130604: ["南市区", "130600"],
            130621: ["满城县", "130600"],
            130622: ["清苑县", "130600"],
            130623: ["涞水县", "130600"],
            130624: ["阜平县", "130600"],
            130625: ["徐水县", "130600"],
            130626: ["定兴县", "130600"],
            130627: ["唐县", "130600"],
            130628: ["高阳县", "130600"],
            130629: ["容城县", "130600"],
            130630: ["涞源县", "130600"],
            130631: ["望都县", "130600"],
            130632: ["安新县", "130600"],
            130633: ["易县", "130600"],
            130634: ["曲阳县", "130600"],
            130635: ["蠡县", "130600"],
            130636: ["顺平县", "130600"],
            130637: ["博野县", "130600"],
            130638: ["雄县", "130600"],
            130681: ["涿州市", "130600"],
            130682: ["定州市", "130600"],
            130683: ["安国市", "130600"],
            130684: ["高碑店市", "130600"],
            130698: ["高开区", "130600"],
            130699: ["其它区", "130600"],
            130700: ["张家口市", "130000"],
            130702: ["桥东区", "130700"],
            130703: ["桥西区", "130700"],
            130705: ["宣化区", "130700"],
            130706: ["下花园区", "130700"],
            130721: ["宣化县", "130700"],
            130722: ["张北县", "130700"],
            130723: ["康保县", "130700"],
            130724: ["沽源县", "130700"],
            130725: ["尚义县", "130700"],
            130726: ["蔚县", "130700"],
            130727: ["阳原县", "130700"],
            130728: ["怀安县", "130700"],
            130729: ["万全县", "130700"],
            130730: ["怀来县", "130700"],
            130731: ["涿鹿县", "130700"],
            130732: ["赤城县", "130700"],
            130733: ["崇礼县", "130700"],
            130734: ["其它区", "130700"],
            130800: ["承德市", "130000"],
            130802: ["双桥区", "130800"],
            130803: ["双滦区", "130800"],
            130804: ["鹰手营子矿区", "130800"],
            130821: ["承德县", "130800"],
            130822: ["兴隆县", "130800"],
            130823: ["平泉县", "130800"],
            130824: ["滦平县", "130800"],
            130825: ["隆化县", "130800"],
            130826: ["丰宁满族自治县", "130800"],
            130827: ["宽城满族自治县", "130800"],
            130828: ["围场满族蒙古族自治县", "130800"],
            130829: ["其它区", "130800"],
            130900: ["沧州市", "130000"],
            130902: ["新华区", "130900"],
            130903: ["运河区", "130900"],
            130921: ["沧县", "130900"],
            130922: ["青县", "130900"],
            130923: ["东光县", "130900"],
            130924: ["海兴县", "130900"],
            130925: ["盐山县", "130900"],
            130926: ["肃宁县", "130900"],
            130927: ["南皮县", "130900"],
            130928: ["吴桥县", "130900"],
            130929: ["献县", "130900"],
            130930: ["孟村回族自治县", "130900"],
            130981: ["泊头市", "130900"],
            130982: ["任丘市", "130900"],
            130983: ["黄骅市", "130900"],
            130984: ["河间市", "130900"],
            130985: ["其它区", "130900"],
            131e3: ["廊坊市", "130000"],
            131002: ["安次区", "131000"],
            131003: ["广阳区", "131000"],
            131022: ["固安县", "131000"],
            131023: ["永清县", "131000"],
            131024: ["香河县", "131000"],
            131025: ["大城县", "131000"],
            131026: ["文安县", "131000"],
            131028: ["大厂回族自治县", "131000"],
            131051: ["开发区", "131000"],
            131052: ["燕郊经济技术开发区", "131000"],
            131081: ["霸州市", "131000"],
            131082: ["三河市", "131000"],
            131083: ["其它区", "131000"],
            131100: ["衡水市", "130000"],
            131102: ["桃城区", "131100"],
            131121: ["枣强县", "131100"],
            131122: ["武邑县", "131100"],
            131123: ["武强县", "131100"],
            131124: ["饶阳县", "131100"],
            131125: ["安平县", "131100"],
            131126: ["故城县", "131100"],
            131127: ["景县", "131100"],
            131128: ["阜城县", "131100"],
            131181: ["冀州市", "131100"],
            131182: ["深州市", "131100"],
            131183: ["其它区", "131100"],
            14e4: ["山西省", "1"],
            140100: ["太原市", "140000"],
            140105: ["小店区", "140100"],
            140106: ["迎泽区", "140100"],
            140107: ["杏花岭区", "140100"],
            140108: ["尖草坪区", "140100"],
            140109: ["万柏林区", "140100"],
            140110: ["晋源区", "140100"],
            140121: ["清徐县", "140100"],
            140122: ["阳曲县", "140100"],
            140123: ["娄烦县", "140100"],
            140181: ["古交市", "140100"],
            140182: ["其它区", "140100"],
            140200: ["大同市", "140000"],
            140202: ["城区", "140200"],
            140203: ["矿区", "140200"],
            140211: ["南郊区", "140200"],
            140212: ["新荣区", "140200"],
            140221: ["阳高县", "140200"],
            140222: ["天镇县", "140200"],
            140223: ["广灵县", "140200"],
            140224: ["灵丘县", "140200"],
            140225: ["浑源县", "140200"],
            140226: ["左云县", "140200"],
            140227: ["大同县", "140200"],
            140228: ["其它区", "140200"],
            140300: ["阳泉市", "140000"],
            140302: ["城区", "140300"],
            140303: ["矿区", "140300"],
            140311: ["郊区", "140300"],
            140321: ["平定县", "140300"],
            140322: ["盂县", "140300"],
            140323: ["其它区", "140300"],
            140400: ["长治市", "140000"],
            140421: ["长治县", "140400"],
            140423: ["襄垣县", "140400"],
            140424: ["屯留县", "140400"],
            140425: ["平顺县", "140400"],
            140426: ["黎城县", "140400"],
            140427: ["壶关县", "140400"],
            140428: ["长子县", "140400"],
            140429: ["武乡县", "140400"],
            140430: ["沁县", "140400"],
            140431: ["沁源县", "140400"],
            140481: ["潞城市", "140400"],
            140482: ["城区", "140400"],
            140483: ["郊区", "140400"],
            140484: ["高新区", "140400"],
            140485: ["其它区", "140400"],
            140500: ["晋城市", "140000"],
            140502: ["城区", "140500"],
            140521: ["沁水县", "140500"],
            140522: ["阳城县", "140500"],
            140524: ["陵川县", "140500"],
            140525: ["泽州县", "140500"],
            140581: ["高平市", "140500"],
            140582: ["其它区", "140500"],
            140600: ["朔州市", "140000"],
            140602: ["朔城区", "140600"],
            140603: ["平鲁区", "140600"],
            140621: ["山阴县", "140600"],
            140622: ["应县", "140600"],
            140623: ["右玉县", "140600"],
            140624: ["怀仁县", "140600"],
            140625: ["其它区", "140600"],
            140700: ["晋中市", "140000"],
            140702: ["榆次区", "140700"],
            140721: ["榆社县", "140700"],
            140722: ["左权县", "140700"],
            140723: ["和顺县", "140700"],
            140724: ["昔阳县", "140700"],
            140725: ["寿阳县", "140700"],
            140726: ["太谷县", "140700"],
            140727: ["祁县", "140700"],
            140728: ["平遥县", "140700"],
            140729: ["灵石县", "140700"],
            140781: ["介休市", "140700"],
            140782: ["其它区", "140700"],
            140800: ["运城市", "140000"],
            140802: ["盐湖区", "140800"],
            140821: ["临猗县", "140800"],
            140822: ["万荣县", "140800"],
            140823: ["闻喜县", "140800"],
            140824: ["稷山县", "140800"],
            140825: ["新绛县", "140800"],
            140826: ["绛县", "140800"],
            140827: ["垣曲县", "140800"],
            140828: ["夏县", "140800"],
            140829: ["平陆县", "140800"],
            140830: ["芮城县", "140800"],
            140881: ["永济市", "140800"],
            140882: ["河津市", "140800"],
            140883: ["其它区", "140800"],
            140900: ["忻州市", "140000"],
            140902: ["忻府区", "140900"],
            140921: ["定襄县", "140900"],
            140922: ["五台县", "140900"],
            140923: ["代县", "140900"],
            140924: ["繁峙县", "140900"],
            140925: ["宁武县", "140900"],
            140926: ["静乐县", "140900"],
            140927: ["神池县", "140900"],
            140928: ["五寨县", "140900"],
            140929: ["岢岚县", "140900"],
            140930: ["河曲县", "140900"],
            140931: ["保德县", "140900"],
            140932: ["偏关县", "140900"],
            140981: ["原平市", "140900"],
            140982: ["其它区", "140900"],
            141e3: ["临汾市", "140000"],
            141002: ["尧都区", "141000"],
            141021: ["曲沃县", "141000"],
            141022: ["翼城县", "141000"],
            141023: ["襄汾县", "141000"],
            141024: ["洪洞县", "141000"],
            141025: ["古县", "141000"],
            141026: ["安泽县", "141000"],
            141027: ["浮山县", "141000"],
            141028: ["吉县", "141000"],
            141029: ["乡宁县", "141000"],
            141030: ["大宁县", "141000"],
            141031: ["隰县", "141000"],
            141032: ["永和县", "141000"],
            141033: ["蒲县", "141000"],
            141034: ["汾西县", "141000"],
            141081: ["侯马市", "141000"],
            141082: ["霍州市", "141000"],
            141083: ["其它区", "141000"],
            141100: ["吕梁市", "140000"],
            141102: ["离石区", "141100"],
            141121: ["文水县", "141100"],
            141122: ["交城县", "141100"],
            141123: ["兴县", "141100"],
            141124: ["临县", "141100"],
            141125: ["柳林县", "141100"],
            141126: ["石楼县", "141100"],
            141127: ["岚县", "141100"],
            141128: ["方山县", "141100"],
            141129: ["中阳县", "141100"],
            141130: ["交口县", "141100"],
            141181: ["孝义市", "141100"],
            141182: ["汾阳市", "141100"],
            141183: ["其它区", "141100"],
            15e4: ["内蒙古自治区", "1"],
            150100: ["呼和浩特市", "150000"],
            150102: ["新城区", "150100"],
            150103: ["回民区", "150100"],
            150104: ["玉泉区", "150100"],
            150105: ["赛罕区", "150100"],
            150121: ["土默特左旗", "150100"],
            150122: ["托克托县", "150100"],
            150123: ["和林格尔县", "150100"],
            150124: ["清水河县", "150100"],
            150125: ["武川县", "150100"],
            150126: ["其它区", "150100"],
            150200: ["包头市", "150000"],
            150202: ["东河区", "150200"],
            150203: ["昆都仑区", "150200"],
            150204: ["青山区", "150200"],
            150205: ["石拐区", "150200"],
            150206: ["白云矿区", "150200"],
            150207: ["九原区", "150200"],
            150221: ["土默特右旗", "150200"],
            150222: ["固阳县", "150200"],
            150223: ["达尔罕茂明安联合旗", "150200"],
            150224: ["其它区", "150200"],
            150300: ["乌海市", "150000"],
            150302: ["海勃湾区", "150300"],
            150303: ["海南区", "150300"],
            150304: ["乌达区", "150300"],
            150305: ["其它区", "150300"],
            150400: ["赤峰市", "150000"],
            150402: ["红山区", "150400"],
            150403: ["元宝山区", "150400"],
            150404: ["松山区", "150400"],
            150421: ["阿鲁科尔沁旗", "150400"],
            150422: ["巴林左旗", "150400"],
            150423: ["巴林右旗", "150400"],
            150424: ["林西县", "150400"],
            150425: ["克什克腾旗", "150400"],
            150426: ["翁牛特旗", "150400"],
            150428: ["喀喇沁旗", "150400"],
            150429: ["宁城县", "150400"],
            150430: ["敖汉旗", "150400"],
            150431: ["其它区", "150400"],
            150500: ["通辽市", "150000"],
            150502: ["科尔沁区", "150500"],
            150521: ["科尔沁左翼中旗", "150500"],
            150522: ["科尔沁左翼后旗", "150500"],
            150523: ["开鲁县", "150500"],
            150524: ["库伦旗", "150500"],
            150525: ["奈曼旗", "150500"],
            150526: ["扎鲁特旗", "150500"],
            150581: ["霍林郭勒市", "150500"],
            150582: ["其它区", "150500"],
            150600: ["鄂尔多斯市", "150000"],
            150602: ["东胜区", "150600"],
            150621: ["达拉特旗", "150600"],
            150622: ["准格尔旗", "150600"],
            150623: ["鄂托克前旗", "150600"],
            150624: ["鄂托克旗", "150600"],
            150625: ["杭锦旗", "150600"],
            150626: ["乌审旗", "150600"],
            150627: ["伊金霍洛旗", "150600"],
            150628: ["其它区", "150600"],
            150700: ["呼伦贝尔市", "150000"],
            150702: ["海拉尔区", "150700"],
            150721: ["阿荣旗", "150700"],
            150722: ["莫力达瓦达斡尔族自治旗", "150700"],
            150723: ["鄂伦春自治旗", "150700"],
            150724: ["鄂温克族自治旗", "150700"],
            150725: ["陈巴尔虎旗", "150700"],
            150726: ["新巴尔虎左旗", "150700"],
            150727: ["新巴尔虎右旗", "150700"],
            150781: ["满洲里市", "150700"],
            150782: ["牙克石市", "150700"],
            150783: ["扎兰屯市", "150700"],
            150784: ["额尔古纳市", "150700"],
            150785: ["根河市", "150700"],
            150786: ["其它区", "150700"],
            150800: ["巴彦淖尔市", "150000"],
            150802: ["临河区", "150800"],
            150821: ["五原县", "150800"],
            150822: ["磴口县", "150800"],
            150823: ["乌拉特前旗", "150800"],
            150824: ["乌拉特中旗", "150800"],
            150825: ["乌拉特后旗", "150800"],
            150826: ["杭锦后旗", "150800"],
            150827: ["其它区", "150800"],
            150900: ["乌兰察布市", "150000"],
            150902: ["集宁区", "150900"],
            150921: ["卓资县", "150900"],
            150922: ["化德县", "150900"],
            150923: ["商都县", "150900"],
            150924: ["兴和县", "150900"],
            150925: ["凉城县", "150900"],
            150926: ["察哈尔右翼前旗", "150900"],
            150927: ["察哈尔右翼中旗", "150900"],
            150928: ["察哈尔右翼后旗", "150900"],
            150929: ["四子王旗", "150900"],
            150981: ["丰镇市", "150900"],
            150982: ["其它区", "150900"],
            152200: ["兴安盟", "150000"],
            152201: ["乌兰浩特市", "152200"],
            152202: ["阿尔山市", "152200"],
            152221: ["科尔沁右翼前旗", "152200"],
            152222: ["科尔沁右翼中旗", "152200"],
            152223: ["扎赉特旗", "152200"],
            152224: ["突泉县", "152200"],
            152225: ["其它区", "152200"],
            152500: ["锡林郭勒盟", "150000"],
            152501: ["二连浩特市", "152500"],
            152502: ["锡林浩特市", "152500"],
            152522: ["阿巴嘎旗", "152500"],
            152523: ["苏尼特左旗", "152500"],
            152524: ["苏尼特右旗", "152500"],
            152525: ["东乌珠穆沁旗", "152500"],
            152526: ["西乌珠穆沁旗", "152500"],
            152527: ["太仆寺旗", "152500"],
            152528: ["镶黄旗", "152500"],
            152529: ["正镶白旗", "152500"],
            152530: ["正蓝旗", "152500"],
            152531: ["多伦县", "152500"],
            152532: ["其它区", "152500"],
            152900: ["阿拉善盟", "150000"],
            152921: ["阿拉善左旗", "152900"],
            152922: ["阿拉善右旗", "152900"],
            152923: ["额济纳旗", "152900"],
            152924: ["其它区", "152900"],
            21e4: ["辽宁省", "1"],
            210100: ["沈阳市", "210000"],
            210102: ["和平区", "210100"],
            210103: ["沈河区", "210100"],
            210104: ["大东区", "210100"],
            210105: ["皇姑区", "210100"],
            210106: ["铁西区", "210100"],
            210111: ["苏家屯区", "210100"],
            210112: ["东陵区", "210100"],
            210113: ["新城子区", "210100"],
            210114: ["于洪区", "210100"],
            210122: ["辽中县", "210100"],
            210123: ["康平县", "210100"],
            210124: ["法库县", "210100"],
            210181: ["新民市", "210100"],
            210182: ["浑南新区", "210100"],
            210183: ["张士开发区", "210100"],
            210184: ["沈北新区", "210100"],
            210185: ["其它区", "210100"],
            210200: ["大连市", "210000"],
            210202: ["中山区", "210200"],
            210203: ["西岗区", "210200"],
            210204: ["沙河口区", "210200"],
            210211: ["甘井子区", "210200"],
            210212: ["旅顺口区", "210200"],
            210213: ["金州区", "210200"],
            210224: ["长海县", "210200"],
            210251: ["开发区", "210200"],
            210281: ["瓦房店市", "210200"],
            210282: ["普兰店市", "210200"],
            210283: ["庄河市", "210200"],
            210297: ["岭前区", "210200"],
            210298: ["其它区", "210200"],
            210300: ["鞍山市", "210000"],
            210302: ["铁东区", "210300"],
            210303: ["铁西区", "210300"],
            210304: ["立山区", "210300"],
            210311: ["千山区", "210300"],
            210321: ["台安县", "210300"],
            210323: ["岫岩满族自治县", "210300"],
            210351: ["高新区", "210300"],
            210381: ["海城市", "210300"],
            210382: ["其它区", "210300"],
            210400: ["抚顺市", "210000"],
            210402: ["新抚区", "210400"],
            210403: ["东洲区", "210400"],
            210404: ["望花区", "210400"],
            210411: ["顺城区", "210400"],
            210421: ["抚顺县", "210400"],
            210422: ["新宾满族自治县", "210400"],
            210423: ["清原满族自治县", "210400"],
            210424: ["其它区", "210400"],
            210500: ["本溪市", "210000"],
            210502: ["平山区", "210500"],
            210503: ["溪湖区", "210500"],
            210504: ["明山区", "210500"],
            210505: ["南芬区", "210500"],
            210521: ["本溪满族自治县", "210500"],
            210522: ["桓仁满族自治县", "210500"],
            210523: ["其它区", "210500"],
            210600: ["丹东市", "210000"],
            210602: ["元宝区", "210600"],
            210603: ["振兴区", "210600"],
            210604: ["振安区", "210600"],
            210624: ["宽甸满族自治县", "210600"],
            210681: ["东港市", "210600"],
            210682: ["凤城市", "210600"],
            210683: ["其它区", "210600"],
            210700: ["锦州市", "210000"],
            210702: ["古塔区", "210700"],
            210703: ["凌河区", "210700"],
            210711: ["太和区", "210700"],
            210726: ["黑山县", "210700"],
            210727: ["义县", "210700"],
            210781: ["凌海市", "210700"],
            210782: ["北镇市", "210700"],
            210783: ["其它区", "210700"],
            210800: ["营口市", "210000"],
            210802: ["站前区", "210800"],
            210803: ["西市区", "210800"],
            210804: ["鲅鱼圈区", "210800"],
            210811: ["老边区", "210800"],
            210881: ["盖州市", "210800"],
            210882: ["大石桥市", "210800"],
            210883: ["其它区", "210800"],
            210900: ["阜新市", "210000"],
            210902: ["海州区", "210900"],
            210903: ["新邱区", "210900"],
            210904: ["太平区", "210900"],
            210905: ["清河门区", "210900"],
            210911: ["细河区", "210900"],
            210921: ["阜新蒙古族自治县", "210900"],
            210922: ["彰武县", "210900"],
            210923: ["其它区", "210900"],
            211e3: ["辽阳市", "210000"],
            211002: ["白塔区", "211000"],
            211003: ["文圣区", "211000"],
            211004: ["宏伟区", "211000"],
            211005: ["弓长岭区", "211000"],
            211011: ["太子河区", "211000"],
            211021: ["辽阳县", "211000"],
            211081: ["灯塔市", "211000"],
            211082: ["其它区", "211000"],
            211100: ["盘锦市", "210000"],
            211102: ["双台子区", "211100"],
            211103: ["兴隆台区", "211100"],
            211121: ["大洼县", "211100"],
            211122: ["盘山县", "211100"],
            211123: ["其它区", "211100"],
            211200: ["铁岭市", "210000"],
            211202: ["银州区", "211200"],
            211204: ["清河区", "211200"],
            211221: ["铁岭县", "211200"],
            211223: ["西丰县", "211200"],
            211224: ["昌图县", "211200"],
            211281: ["调兵山市", "211200"],
            211282: ["开原市", "211200"],
            211283: ["其它区", "211200"],
            211300: ["朝阳市", "210000"],
            211302: ["双塔区", "211300"],
            211303: ["龙城区", "211300"],
            211321: ["朝阳县", "211300"],
            211322: ["建平县", "211300"],
            211324: ["喀喇沁左翼蒙古族自治县", "211300"],
            211381: ["北票市", "211300"],
            211382: ["凌源市", "211300"],
            211383: ["其它区", "211300"],
            211400: ["葫芦岛市", "210000"],
            211402: ["连山区", "211400"],
            211403: ["龙港区", "211400"],
            211404: ["南票区", "211400"],
            211421: ["绥中县", "211400"],
            211422: ["建昌县", "211400"],
            211481: ["兴城市", "211400"],
            211482: ["其它区", "211400"],
            22e4: ["吉林省", "1"],
            220100: ["长春市", "220000"],
            220102: ["南关区", "220100"],
            220103: ["宽城区", "220100"],
            220104: ["朝阳区", "220100"],
            220105: ["二道区", "220100"],
            220106: ["绿园区", "220100"],
            220112: ["双阳区", "220100"],
            220122: ["农安县", "220100"],
            220181: ["九台市", "220100"],
            220182: ["榆树市", "220100"],
            220183: ["德惠市", "220100"],
            220184: ["高新技术产业开发区", "220100"],
            220185: ["汽车产业开发区", "220100"],
            220186: ["经济技术开发区", "220100"],
            220187: ["净月旅游开发区", "220100"],
            220188: ["其它区", "220100"],
            220200: ["吉林市", "220000"],
            220202: ["昌邑区", "220200"],
            220203: ["龙潭区", "220200"],
            220204: ["船营区", "220200"],
            220211: ["丰满区", "220200"],
            220221: ["永吉县", "220200"],
            220281: ["蛟河市", "220200"],
            220282: ["桦甸市", "220200"],
            220283: ["舒兰市", "220200"],
            220284: ["磐石市", "220200"],
            220285: ["其它区", "220200"],
            220300: ["四平市", "220000"],
            220302: ["铁西区", "220300"],
            220303: ["铁东区", "220300"],
            220322: ["梨树县", "220300"],
            220323: ["伊通满族自治县", "220300"],
            220381: ["公主岭市", "220300"],
            220382: ["双辽市", "220300"],
            220383: ["其它区", "220300"],
            220400: ["辽源市", "220000"],
            220402: ["龙山区", "220400"],
            220403: ["西安区", "220400"],
            220421: ["东丰县", "220400"],
            220422: ["东辽县", "220400"],
            220423: ["其它区", "220400"],
            220500: ["通化市", "220000"],
            220502: ["东昌区", "220500"],
            220503: ["二道江区", "220500"],
            220521: ["通化县", "220500"],
            220523: ["辉南县", "220500"],
            220524: ["柳河县", "220500"],
            220581: ["梅河口市", "220500"],
            220582: ["集安市", "220500"],
            220583: ["其它区", "220500"],
            220600: ["白山市", "220000"],
            220602: ["八道江区", "220600"],
            220621: ["抚松县", "220600"],
            220622: ["靖宇县", "220600"],
            220623: ["长白朝鲜族自治县", "220600"],
            220625: ["江源县", "220600"],
            220681: ["临江市", "220600"],
            220682: ["其它区", "220600"],
            220700: ["松原市", "220000"],
            220702: ["宁江区", "220700"],
            220721: ["前郭尔罗斯蒙古族自治县", "220700"],
            220722: ["长岭县", "220700"],
            220723: ["乾安县", "220700"],
            220724: ["扶余县", "220700"],
            220725: ["其它区", "220700"],
            220800: ["白城市", "220000"],
            220802: ["洮北区", "220800"],
            220821: ["镇赉县", "220800"],
            220822: ["通榆县", "220800"],
            220881: ["洮南市", "220800"],
            220882: ["大安市", "220800"],
            220883: ["其它区", "220800"],
            222400: ["延边朝鲜族自治州", "220000"],
            222401: ["延吉市", "222400"],
            222402: ["图们市", "222400"],
            222403: ["敦化市", "222400"],
            222404: ["珲春市", "222400"],
            222405: ["龙井市", "222400"],
            222406: ["和龙市", "222400"],
            222424: ["汪清县", "222400"],
            222426: ["安图县", "222400"],
            222427: ["其它区", "222400"],
            23e4: ["黑龙江省", "1"],
            230100: ["哈尔滨市", "230000"],
            230102: ["道里区", "230100"],
            230103: ["南岗区", "230100"],
            230104: ["道外区", "230100"],
            230106: ["香坊区", "230100"],
            230107: ["动力区", "230100"],
            230108: ["平房区", "230100"],
            230109: ["松北区", "230100"],
            230111: ["呼兰区", "230100"],
            230123: ["依兰县", "230100"],
            230124: ["方正县", "230100"],
            230125: ["宾县", "230100"],
            230126: ["巴彦县", "230100"],
            230127: ["木兰县", "230100"],
            230128: ["通河县", "230100"],
            230129: ["延寿县", "230100"],
            230181: ["阿城市", "230100"],
            230182: ["双城市", "230100"],
            230183: ["尚志市", "230100"],
            230184: ["五常市", "230100"],
            230185: ["阿城市", "230100"],
            230186: ["其它区", "230100"],
            230200: ["齐齐哈尔市", "230000"],
            230202: ["龙沙区", "230200"],
            230203: ["建华区", "230200"],
            230204: ["铁锋区", "230200"],
            230205: ["昂昂溪区", "230200"],
            230206: ["富拉尔基区", "230200"],
            230207: ["碾子山区", "230200"],
            230208: ["梅里斯达斡尔族区", "230200"],
            230221: ["龙江县", "230200"],
            230223: ["依安县", "230200"],
            230224: ["泰来县", "230200"],
            230225: ["甘南县", "230200"],
            230227: ["富裕县", "230200"],
            230229: ["克山县", "230200"],
            230230: ["克东县", "230200"],
            230231: ["拜泉县", "230200"],
            230281: ["讷河市", "230200"],
            230282: ["其它区", "230200"],
            230300: ["鸡西市", "230000"],
            230302: ["鸡冠区", "230300"],
            230303: ["恒山区", "230300"],
            230304: ["滴道区", "230300"],
            230305: ["梨树区", "230300"],
            230306: ["城子河区", "230300"],
            230307: ["麻山区", "230300"],
            230321: ["鸡东县", "230300"],
            230381: ["虎林市", "230300"],
            230382: ["密山市", "230300"],
            230383: ["其它区", "230300"],
            230400: ["鹤岗市", "230000"],
            230402: ["向阳区", "230400"],
            230403: ["工农区", "230400"],
            230404: ["南山区", "230400"],
            230405: ["兴安区", "230400"],
            230406: ["东山区", "230400"],
            230407: ["兴山区", "230400"],
            230421: ["萝北县", "230400"],
            230422: ["绥滨县", "230400"],
            230423: ["其它区", "230400"],
            230500: ["双鸭山市", "230000"],
            230502: ["尖山区", "230500"],
            230503: ["岭东区", "230500"],
            230505: ["四方台区", "230500"],
            230506: ["宝山区", "230500"],
            230521: ["集贤县", "230500"],
            230522: ["友谊县", "230500"],
            230523: ["宝清县", "230500"],
            230524: ["饶河县", "230500"],
            230525: ["其它区", "230500"],
            230600: ["大庆市", "230000"],
            230602: ["萨尔图区", "230600"],
            230603: ["龙凤区", "230600"],
            230604: ["让胡路区", "230600"],
            230605: ["红岗区", "230600"],
            230606: ["大同区", "230600"],
            230621: ["肇州县", "230600"],
            230622: ["肇源县", "230600"],
            230623: ["林甸县", "230600"],
            230624: ["杜尔伯特蒙古族自治县", "230600"],
            230625: ["其它区", "230600"],
            230700: ["伊春市", "230000"],
            230702: ["伊春区", "230700"],
            230703: ["南岔区", "230700"],
            230704: ["友好区", "230700"],
            230705: ["西林区", "230700"],
            230706: ["翠峦区", "230700"],
            230707: ["新青区", "230700"],
            230708: ["美溪区", "230700"],
            230709: ["金山屯区", "230700"],
            230710: ["五营区", "230700"],
            230711: ["乌马河区", "230700"],
            230712: ["汤旺河区", "230700"],
            230713: ["带岭区", "230700"],
            230714: ["乌伊岭区", "230700"],
            230715: ["红星区", "230700"],
            230716: ["上甘岭区", "230700"],
            230722: ["嘉荫县", "230700"],
            230781: ["铁力市", "230700"],
            230782: ["其它区", "230700"],
            230800: ["佳木斯市", "230000"],
            230802: ["永红区", "230800"],
            230803: ["向阳区", "230800"],
            230804: ["前进区", "230800"],
            230805: ["东风区", "230800"],
            230811: ["郊区", "230800"],
            230822: ["桦南县", "230800"],
            230826: ["桦川县", "230800"],
            230828: ["汤原县", "230800"],
            230833: ["抚远县", "230800"],
            230881: ["同江市", "230800"],
            230882: ["富锦市", "230800"],
            230883: ["其它区", "230800"],
            230900: ["七台河市", "230000"],
            230902: ["新兴区", "230900"],
            230903: ["桃山区", "230900"],
            230904: ["茄子河区", "230900"],
            230921: ["勃利县", "230900"],
            230922: ["其它区", "230900"],
            231e3: ["牡丹江市", "230000"],
            231002: ["东安区", "231000"],
            231003: ["阳明区", "231000"],
            231004: ["爱民区", "231000"],
            231005: ["西安区", "231000"],
            231024: ["东宁县", "231000"],
            231025: ["林口县", "231000"],
            231081: ["绥芬河市", "231000"],
            231083: ["海林市", "231000"],
            231084: ["宁安市", "231000"],
            231085: ["穆棱市", "231000"],
            231086: ["其它区", "231000"],
            231100: ["黑河市", "230000"],
            231102: ["爱辉区", "231100"],
            231121: ["嫩江县", "231100"],
            231123: ["逊克县", "231100"],
            231124: ["孙吴县", "231100"],
            231181: ["北安市", "231100"],
            231182: ["五大连池市", "231100"],
            231183: ["其它区", "231100"],
            231200: ["绥化市", "230000"],
            231202: ["北林区", "231200"],
            231221: ["望奎县", "231200"],
            231222: ["兰西县", "231200"],
            231223: ["青冈县", "231200"],
            231224: ["庆安县", "231200"],
            231225: ["明水县", "231200"],
            231226: ["绥棱县", "231200"],
            231281: ["安达市", "231200"],
            231282: ["肇东市", "231200"],
            231283: ["海伦市", "231200"],
            231284: ["其它区", "231200"],
            232700: ["大兴安岭地区", "230000"],
            232721: ["呼玛县", "232700"],
            232722: ["塔河县", "232700"],
            232723: ["漠河县", "232700"],
            232724: ["加格达奇区", "232700"],
            232725: ["其它区", "232700"],
            31e4: ["上海", "1"],
            310100: ["上海市", "310000"],
            310101: ["黄浦区", "310100"],
            310103: ["卢湾区", "310100"],
            310104: ["徐汇区", "310100"],
            310105: ["长宁区", "310100"],
            310106: ["静安区", "310100"],
            310107: ["普陀区", "310100"],
            310108: ["闸北区", "310100"],
            310109: ["虹口区", "310100"],
            310110: ["杨浦区", "310100"],
            310112: ["闵行区", "310100"],
            310113: ["宝山区", "310100"],
            310114: ["嘉定区", "310100"],
            310115: ["浦东新区", "310100"],
            310116: ["金山区", "310100"],
            310117: ["松江区", "310100"],
            310118: ["青浦区", "310100"],
            310119: ["南汇区", "310100"],
            310120: ["奉贤区", "310100"],
            310152: ["川沙区", "310100"],
            310230: ["崇明县", "310100"],
            310231: ["其它区", "310100"],
            32e4: ["江苏省", "1"],
            320100: ["南京市", "320000"],
            320102: ["玄武区", "320100"],
            320103: ["白下区", "320100"],
            320104: ["秦淮区", "320100"],
            320105: ["建邺区", "320100"],
            320106: ["鼓楼区", "320100"],
            320107: ["下关区", "320100"],
            320111: ["浦口区", "320100"],
            320113: ["栖霞区", "320100"],
            320114: ["雨花台区", "320100"],
            320115: ["江宁区", "320100"],
            320116: ["六合区", "320100"],
            320124: ["溧水县", "320100"],
            320125: ["高淳县", "320100"],
            320126: ["其它区", "320100"],
            320200: ["无锡市", "320000"],
            320202: ["崇安区", "320200"],
            320203: ["南长区", "320200"],
            320204: ["北塘区", "320200"],
            320205: ["锡山区", "320200"],
            320206: ["惠山区", "320200"],
            320211: ["滨湖区", "320200"],
            320281: ["江阴市", "320200"],
            320282: ["宜兴市", "320200"],
            320296: ["新区", "320200"],
            320297: ["其它区", "320200"],
            320300: ["徐州市", "320000"],
            320302: ["鼓楼区", "320300"],
            320303: ["云龙区", "320300"],
            320304: ["九里区", "320300"],
            320305: ["贾汪区", "320300"],
            320311: ["泉山区", "320300"],
            320321: ["丰县", "320300"],
            320322: ["沛县", "320300"],
            320323: ["铜山县", "320300"],
            320324: ["睢宁县", "320300"],
            320381: ["新沂市", "320300"],
            320382: ["邳州市", "320300"],
            320383: ["其它区", "320300"],
            320400: ["常州市", "320000"],
            320402: ["天宁区", "320400"],
            320404: ["钟楼区", "320400"],
            320405: ["戚墅堰区", "320400"],
            320411: ["新北区", "320400"],
            320412: ["武进区", "320400"],
            320481: ["溧阳市", "320400"],
            320482: ["金坛市", "320400"],
            320483: ["其它区", "320400"],
            320500: ["苏州市", "320000"],
            320502: ["沧浪区", "320500"],
            320503: ["平江区", "320500"],
            320504: ["金阊区", "320500"],
            320505: ["虎丘区", "320500"],
            320506: ["吴中区", "320500"],
            320507: ["相城区", "320500"],
            320581: ["常熟市", "320500"],
            320582: ["张家港市", "320500"],
            320583: ["昆山市", "320500"],
            320584: ["吴江市", "320500"],
            320585: ["太仓市", "320500"],
            320594: ["新区", "320500"],
            320595: ["园区", "320500"],
            320596: ["其它区", "320500"],
            320600: ["南通市", "320000"],
            320602: ["崇川区", "320600"],
            320611: ["港闸区", "320600"],
            320612: ["通州区", "320600"],
            320621: ["海安县", "320600"],
            320623: ["如东县", "320600"],
            320681: ["启东市", "320600"],
            320682: ["如皋市", "320600"],
            320683: ["通州市", "320600"],
            320684: ["海门市", "320600"],
            320693: ["开发区", "320600"],
            320694: ["其它区", "320600"],
            320700: ["连云港市", "320000"],
            320703: ["连云区", "320700"],
            320705: ["新浦区", "320700"],
            320706: ["海州区", "320700"],
            320721: ["赣榆县", "320700"],
            320722: ["东海县", "320700"],
            320723: ["灌云县", "320700"],
            320724: ["灌南县", "320700"],
            320725: ["其它区", "320700"],
            320800: ["淮安市", "320000"],
            320802: ["清河区", "320800"],
            320803: ["楚州区", "320800"],
            320804: ["淮阴区", "320800"],
            320811: ["清浦区", "320800"],
            320826: ["涟水县", "320800"],
            320829: ["洪泽县", "320800"],
            320830: ["盱眙县", "320800"],
            320831: ["金湖县", "320800"],
            320832: ["其它区", "320800"],
            320900: ["盐城市", "320000"],
            320902: ["亭湖区", "320900"],
            320903: ["盐都区", "320900"],
            320921: ["响水县", "320900"],
            320922: ["滨海县", "320900"],
            320923: ["阜宁县", "320900"],
            320924: ["射阳县", "320900"],
            320925: ["建湖县", "320900"],
            320981: ["东台市", "320900"],
            320982: ["大丰市", "320900"],
            320983: ["其它区", "320900"],
            321e3: ["扬州市", "320000"],
            321002: ["广陵区", "321000"],
            321003: ["邗江区", "321000"],
            321011: ["维扬区", "321000"],
            321023: ["宝应县", "321000"],
            321081: ["仪征市", "321000"],
            321084: ["高邮市", "321000"],
            321088: ["江都市", "321000"],
            321092: ["经济开发区", "321000"],
            321093: ["其它区", "321000"],
            321100: ["镇江市", "320000"],
            321102: ["京口区", "321100"],
            321111: ["润州区", "321100"],
            321112: ["丹徒区", "321100"],
            321181: ["丹阳市", "321100"],
            321182: ["扬中市", "321100"],
            321183: ["句容市", "321100"],
            321184: ["其它区", "321100"],
            321200: ["泰州市", "320000"],
            321202: ["海陵区", "321200"],
            321203: ["高港区", "321200"],
            321281: ["兴化市", "321200"],
            321282: ["靖江市", "321200"],
            321283: ["泰兴市", "321200"],
            321284: ["姜堰市", "321200"],
            321285: ["其它区", "321200"],
            321300: ["宿迁市", "320000"],
            321302: ["宿城区", "321300"],
            321311: ["宿豫区", "321300"],
            321322: ["沭阳县", "321300"],
            321323: ["泗阳县", "321300"],
            321324: ["泗洪县", "321300"],
            321325: ["其它区", "321300"],
            33e4: ["浙江省", "1"],
            330100: ["杭州市", "330000"],
            330102: ["上城区", "330100"],
            330103: ["下城区", "330100"],
            330104: ["江干区", "330100"],
            330105: ["拱墅区", "330100"],
            330106: ["西湖区", "330100"],
            330108: ["滨江区", "330100"],
            330109: ["萧山区", "330100"],
            330110: ["余杭区", "330100"],
            330122: ["桐庐县", "330100"],
            330127: ["淳安县", "330100"],
            330182: ["建德市", "330100"],
            330183: ["富阳市", "330100"],
            330185: ["临安市", "330100"],
            330186: ["其它区", "330100"],
            330200: ["宁波市", "330000"],
            330203: ["海曙区", "330200"],
            330204: ["江东区", "330200"],
            330205: ["江北区", "330200"],
            330206: ["北仑区", "330200"],
            330211: ["镇海区", "330200"],
            330212: ["鄞州区", "330200"],
            330225: ["象山县", "330200"],
            330226: ["宁海县", "330200"],
            330281: ["余姚市", "330200"],
            330282: ["慈溪市", "330200"],
            330283: ["奉化市", "330200"],
            330284: ["其它区", "330200"],
            330300: ["温州市", "330000"],
            330302: ["鹿城区", "330300"],
            330303: ["龙湾区", "330300"],
            330304: ["瓯海区", "330300"],
            330322: ["洞头县", "330300"],
            330324: ["永嘉县", "330300"],
            330326: ["平阳县", "330300"],
            330327: ["苍南县", "330300"],
            330328: ["文成县", "330300"],
            330329: ["泰顺县", "330300"],
            330381: ["瑞安市", "330300"],
            330382: ["乐清市", "330300"],
            330383: ["其它区", "330300"],
            330400: ["嘉兴市", "330000"],
            330402: ["南湖区", "330400"],
            330411: ["秀洲区", "330400"],
            330421: ["嘉善县", "330400"],
            330424: ["海盐县", "330400"],
            330481: ["海宁市", "330400"],
            330482: ["平湖市", "330400"],
            330483: ["桐乡市", "330400"],
            330484: ["其它区", "330400"],
            330500: ["湖州市", "330000"],
            330502: ["吴兴区", "330500"],
            330503: ["南浔区", "330500"],
            330521: ["德清县", "330500"],
            330522: ["长兴县", "330500"],
            330523: ["安吉县", "330500"],
            330524: ["其它区", "330500"],
            330600: ["绍兴市", "330000"],
            330602: ["越城区", "330600"],
            330621: ["绍兴县", "330600"],
            330624: ["新昌县", "330600"],
            330681: ["诸暨市", "330600"],
            330682: ["上虞市", "330600"],
            330683: ["嵊州市", "330600"],
            330684: ["其它区", "330600"],
            330700: ["金华市", "330000"],
            330702: ["婺城区", "330700"],
            330703: ["金东区", "330700"],
            330723: ["武义县", "330700"],
            330726: ["浦江县", "330700"],
            330727: ["磐安县", "330700"],
            330781: ["兰溪市", "330700"],
            330782: ["义乌市", "330700"],
            330783: ["东阳市", "330700"],
            330784: ["永康市", "330700"],
            330785: ["其它区", "330700"],
            330800: ["衢州市", "330000"],
            330802: ["柯城区", "330800"],
            330803: ["衢江区", "330800"],
            330822: ["常山县", "330800"],
            330824: ["开化县", "330800"],
            330825: ["龙游县", "330800"],
            330881: ["江山市", "330800"],
            330882: ["其它区", "330800"],
            330900: ["舟山市", "330000"],
            330902: ["定海区", "330900"],
            330903: ["普陀区", "330900"],
            330921: ["岱山县", "330900"],
            330922: ["嵊泗县", "330900"],
            330923: ["其它区", "330900"],
            331e3: ["台州市", "330000"],
            331002: ["椒江区", "331000"],
            331003: ["黄岩区", "331000"],
            331004: ["路桥区", "331000"],
            331021: ["玉环县", "331000"],
            331022: ["三门县", "331000"],
            331023: ["天台县", "331000"],
            331024: ["仙居县", "331000"],
            331081: ["温岭市", "331000"],
            331082: ["临海市", "331000"],
            331083: ["其它区", "331000"],
            331100: ["丽水市", "330000"],
            331102: ["莲都区", "331100"],
            331121: ["青田县", "331100"],
            331122: ["缙云县", "331100"],
            331123: ["遂昌县", "331100"],
            331124: ["松阳县", "331100"],
            331125: ["云和县", "331100"],
            331126: ["庆元县", "331100"],
            331127: ["景宁畲族自治县", "331100"],
            331181: ["龙泉市", "331100"],
            331182: ["其它区", "331100"],
            34e4: ["安徽省", "1"],
            340100: ["合肥市", "340000"],
            340102: ["瑶海区", "340100"],
            340103: ["庐阳区", "340100"],
            340104: ["蜀山区", "340100"],
            340111: ["包河区", "340100"],
            340121: ["长丰县", "340100"],
            340122: ["肥东县", "340100"],
            340123: ["肥西县", "340100"],
            340151: ["高新区", "340100"],
            340191: ["中区", "340100"],
            340192: ["其它区", "340100"],
            340200: ["芜湖市", "340000"],
            340202: ["镜湖区", "340200"],
            340203: ["弋江区", "340200"],
            340207: ["鸠江区", "340200"],
            340208: ["三山区", "340200"],
            340221: ["芜湖县", "340200"],
            340222: ["繁昌县", "340200"],
            340223: ["南陵县", "340200"],
            340224: ["其它区", "340200"],
            340300: ["蚌埠市", "340000"],
            340302: ["龙子湖区", "340300"],
            340303: ["蚌山区", "340300"],
            340304: ["禹会区", "340300"],
            340311: ["淮上区", "340300"],
            340321: ["怀远县", "340300"],
            340322: ["五河县", "340300"],
            340323: ["固镇县", "340300"],
            340324: ["其它区", "340300"],
            340400: ["淮南市", "340000"],
            340402: ["大通区", "340400"],
            340403: ["田家庵区", "340400"],
            340404: ["谢家集区", "340400"],
            340405: ["八公山区", "340400"],
            340406: ["潘集区", "340400"],
            340421: ["凤台县", "340400"],
            340422: ["其它区", "340400"],
            340500: ["马鞍山市", "340000"],
            340502: ["金家庄区", "340500"],
            340503: ["花山区", "340500"],
            340504: ["雨山区", "340500"],
            340521: ["当涂县", "340500"],
            340522: ["其它区", "340500"],
            340600: ["淮北市", "340000"],
            340602: ["杜集区", "340600"],
            340603: ["相山区", "340600"],
            340604: ["烈山区", "340600"],
            340621: ["濉溪县", "340600"],
            340622: ["其它区", "340600"],
            340700: ["铜陵市", "340000"],
            340702: ["铜官山区", "340700"],
            340703: ["狮子山区", "340700"],
            340711: ["郊区", "340700"],
            340721: ["铜陵县", "340700"],
            340722: ["其它区", "340700"],
            340800: ["安庆市", "340000"],
            340802: ["迎江区", "340800"],
            340803: ["大观区", "340800"],
            340811: ["宜秀区", "340800"],
            340822: ["怀宁县", "340800"],
            340823: ["枞阳县", "340800"],
            340824: ["潜山县", "340800"],
            340825: ["太湖县", "340800"],
            340826: ["宿松县", "340800"],
            340827: ["望江县", "340800"],
            340828: ["岳西县", "340800"],
            340881: ["桐城市", "340800"],
            340882: ["其它区", "340800"],
            341e3: ["黄山市", "340000"],
            341002: ["屯溪区", "341000"],
            341003: ["黄山区", "341000"],
            341004: ["徽州区", "341000"],
            341021: ["歙县", "341000"],
            341022: ["休宁县", "341000"],
            341023: ["黟县", "341000"],
            341024: ["祁门县", "341000"],
            341025: ["其它区", "341000"],
            341100: ["滁州市", "340000"],
            341102: ["琅琊区", "341100"],
            341103: ["南谯区", "341100"],
            341122: ["来安县", "341100"],
            341124: ["全椒县", "341100"],
            341125: ["定远县", "341100"],
            341126: ["凤阳县", "341100"],
            341181: ["天长市", "341100"],
            341182: ["明光市", "341100"],
            341183: ["其它区", "341100"],
            341200: ["阜阳市", "340000"],
            341202: ["颍州区", "341200"],
            341203: ["颍东区", "341200"],
            341204: ["颍泉区", "341200"],
            341221: ["临泉县", "341200"],
            341222: ["太和县", "341200"],
            341225: ["阜南县", "341200"],
            341226: ["颍上县", "341200"],
            341282: ["界首市", "341200"],
            341283: ["其它区", "341200"],
            341300: ["宿州市", "340000"],
            341302: ["埇桥区", "341300"],
            341321: ["砀山县", "341300"],
            341322: ["萧县", "341300"],
            341323: ["灵璧县", "341300"],
            341324: ["泗县", "341300"],
            341325: ["其它区", "341300"],
            341400: ["巢湖市", "340000"],
            341402: ["居巢区", "341400"],
            341421: ["庐江县", "341400"],
            341422: ["无为县", "341400"],
            341423: ["含山县", "341400"],
            341424: ["和县", "341400"],
            341425: ["其它区", "341400"],
            341500: ["六安市", "340000"],
            341502: ["金安区", "341500"],
            341503: ["裕安区", "341500"],
            341521: ["寿县", "341500"],
            341522: ["霍邱县", "341500"],
            341523: ["舒城县", "341500"],
            341524: ["金寨县", "341500"],
            341525: ["霍山县", "341500"],
            341526: ["其它区", "341500"],
            341600: ["亳州市", "340000"],
            341602: ["谯城区", "341600"],
            341621: ["涡阳县", "341600"],
            341622: ["蒙城县", "341600"],
            341623: ["利辛县", "341600"],
            341624: ["其它区", "341600"],
            341700: ["池州市", "340000"],
            341702: ["贵池区", "341700"],
            341721: ["东至县", "341700"],
            341722: ["石台县", "341700"],
            341723: ["青阳县", "341700"],
            341724: ["其它区", "341700"],
            341800: ["宣城市", "340000"],
            341802: ["宣州区", "341800"],
            341821: ["郎溪县", "341800"],
            341822: ["广德县", "341800"],
            341823: ["泾县", "341800"],
            341824: ["绩溪县", "341800"],
            341825: ["旌德县", "341800"],
            341881: ["宁国市", "341800"],
            341882: ["其它区", "341800"],
            35e4: ["福建省", "1"],
            350100: ["福州市", "350000"],
            350102: ["鼓楼区", "350100"],
            350103: ["台江区", "350100"],
            350104: ["仓山区", "350100"],
            350105: ["马尾区", "350100"],
            350111: ["晋安区", "350100"],
            350121: ["闽侯县", "350100"],
            350122: ["连江县", "350100"],
            350123: ["罗源县", "350100"],
            350124: ["闽清县", "350100"],
            350125: ["永泰县", "350100"],
            350128: ["平潭县", "350100"],
            350181: ["福清市", "350100"],
            350182: ["长乐市", "350100"],
            350183: ["其它区", "350100"],
            350200: ["厦门市", "350000"],
            350203: ["思明区", "350200"],
            350205: ["海沧区", "350200"],
            350206: ["湖里区", "350200"],
            350211: ["集美区", "350200"],
            350212: ["同安区", "350200"],
            350213: ["翔安区", "350200"],
            350214: ["其它区", "350200"],
            350300: ["莆田市", "350000"],
            350302: ["城厢区", "350300"],
            350303: ["涵江区", "350300"],
            350304: ["荔城区", "350300"],
            350305: ["秀屿区", "350300"],
            350322: ["仙游县", "350300"],
            350323: ["其它区", "350300"],
            350400: ["三明市", "350000"],
            350402: ["梅列区", "350400"],
            350403: ["三元区", "350400"],
            350421: ["明溪县", "350400"],
            350423: ["清流县", "350400"],
            350424: ["宁化县", "350400"],
            350425: ["大田县", "350400"],
            350426: ["尤溪县", "350400"],
            350427: ["沙县", "350400"],
            350428: ["将乐县", "350400"],
            350429: ["泰宁县", "350400"],
            350430: ["建宁县", "350400"],
            350481: ["永安市", "350400"],
            350482: ["其它区", "350400"],
            350500: ["泉州市", "350000"],
            350502: ["鲤城区", "350500"],
            350503: ["丰泽区", "350500"],
            350504: ["洛江区", "350500"],
            350505: ["泉港区", "350500"],
            350521: ["惠安县", "350500"],
            350524: ["安溪县", "350500"],
            350525: ["永春县", "350500"],
            350526: ["德化县", "350500"],
            350527: ["金门县", "350500"],
            350581: ["石狮市", "350500"],
            350582: ["晋江市", "350500"],
            350583: ["南安市", "350500"],
            350584: ["其它区", "350500"],
            350600: ["漳州市", "350000"],
            350602: ["芗城区", "350600"],
            350603: ["龙文区", "350600"],
            350622: ["云霄县", "350600"],
            350623: ["漳浦县", "350600"],
            350624: ["诏安县", "350600"],
            350625: ["长泰县", "350600"],
            350626: ["东山县", "350600"],
            350627: ["南靖县", "350600"],
            350628: ["平和县", "350600"],
            350629: ["华安县", "350600"],
            350681: ["龙海市", "350600"],
            350682: ["其它区", "350600"],
            350700: ["南平市", "350000"],
            350702: ["延平区", "350700"],
            350721: ["顺昌县", "350700"],
            350722: ["浦城县", "350700"],
            350723: ["光泽县", "350700"],
            350724: ["松溪县", "350700"],
            350725: ["政和县", "350700"],
            350781: ["邵武市", "350700"],
            350782: ["武夷山市", "350700"],
            350783: ["建瓯市", "350700"],
            350784: ["建阳市", "350700"],
            350785: ["其它区", "350700"],
            350800: ["龙岩市", "350000"],
            350802: ["新罗区", "350800"],
            350821: ["长汀县", "350800"],
            350822: ["永定县", "350800"],
            350823: ["上杭县", "350800"],
            350824: ["武平县", "350800"],
            350825: ["连城县", "350800"],
            350881: ["漳平市", "350800"],
            350882: ["其它区", "350800"],
            350900: ["宁德市", "350000"],
            350902: ["蕉城区", "350900"],
            350921: ["霞浦县", "350900"],
            350922: ["古田县", "350900"],
            350923: ["屏南县", "350900"],
            350924: ["寿宁县", "350900"],
            350925: ["周宁县", "350900"],
            350926: ["柘荣县", "350900"],
            350981: ["福安市", "350900"],
            350982: ["福鼎市", "350900"],
            350983: ["其它区", "350900"],
            36e4: ["江西省", "1"],
            360100: ["南昌市", "360000"],
            360102: ["东湖区", "360100"],
            360103: ["西湖区", "360100"],
            360104: ["青云谱区", "360100"],
            360105: ["湾里区", "360100"],
            360111: ["青山湖区", "360100"],
            360121: ["南昌县", "360100"],
            360122: ["新建县", "360100"],
            360123: ["安义县", "360100"],
            360124: ["进贤县", "360100"],
            360125: ["红谷滩新区", "360100"],
            360126: ["经济技术开发区", "360100"],
            360127: ["昌北区", "360100"],
            360128: ["其它区", "360100"],
            360200: ["景德镇市", "360000"],
            360202: ["昌江区", "360200"],
            360203: ["珠山区", "360200"],
            360222: ["浮梁县", "360200"],
            360281: ["乐平市", "360200"],
            360282: ["其它区", "360200"],
            360300: ["萍乡市", "360000"],
            360302: ["安源区", "360300"],
            360313: ["湘东区", "360300"],
            360321: ["莲花县", "360300"],
            360322: ["上栗县", "360300"],
            360323: ["芦溪县", "360300"],
            360324: ["其它区", "360300"],
            360400: ["九江市", "360000"],
            360402: ["庐山区", "360400"],
            360403: ["浔阳区", "360400"],
            360421: ["九江县", "360400"],
            360423: ["武宁县", "360400"],
            360424: ["修水县", "360400"],
            360425: ["永修县", "360400"],
            360426: ["德安县", "360400"],
            360427: ["星子县", "360400"],
            360428: ["都昌县", "360400"],
            360429: ["湖口县", "360400"],
            360430: ["彭泽县", "360400"],
            360481: ["瑞昌市", "360400"],
            360482: ["其它区", "360400"],
            360500: ["新余市", "360000"],
            360502: ["渝水区", "360500"],
            360521: ["分宜县", "360500"],
            360522: ["其它区", "360500"],
            360600: ["鹰潭市", "360000"],
            360602: ["月湖区", "360600"],
            360622: ["余江县", "360600"],
            360681: ["贵溪市", "360600"],
            360682: ["其它区", "360600"],
            360700: ["赣州市", "360000"],
            360702: ["章贡区", "360700"],
            360721: ["赣县", "360700"],
            360722: ["信丰县", "360700"],
            360723: ["大余县", "360700"],
            360724: ["上犹县", "360700"],
            360725: ["崇义县", "360700"],
            360726: ["安远县", "360700"],
            360727: ["龙南县", "360700"],
            360728: ["定南县", "360700"],
            360729: ["全南县", "360700"],
            360730: ["宁都县", "360700"],
            360731: ["于都县", "360700"],
            360732: ["兴国县", "360700"],
            360733: ["会昌县", "360700"],
            360734: ["寻乌县", "360700"],
            360735: ["石城县", "360700"],
            360751: ["黄金区", "360700"],
            360781: ["瑞金市", "360700"],
            360782: ["南康市", "360700"],
            360783: ["其它区", "360700"],
            360800: ["吉安市", "360000"],
            360802: ["吉州区", "360800"],
            360803: ["青原区", "360800"],
            360821: ["吉安县", "360800"],
            360822: ["吉水县", "360800"],
            360823: ["峡江县", "360800"],
            360824: ["新干县", "360800"],
            360825: ["永丰县", "360800"],
            360826: ["泰和县", "360800"],
            360827: ["遂川县", "360800"],
            360828: ["万安县", "360800"],
            360829: ["安福县", "360800"],
            360830: ["永新县", "360800"],
            360881: ["井冈山市", "360800"],
            360882: ["其它区", "360800"],
            360900: ["宜春市", "360000"],
            360902: ["袁州区", "360900"],
            360921: ["奉新县", "360900"],
            360922: ["万载县", "360900"],
            360923: ["上高县", "360900"],
            360924: ["宜丰县", "360900"],
            360925: ["靖安县", "360900"],
            360926: ["铜鼓县", "360900"],
            360981: ["丰城市", "360900"],
            360982: ["樟树市", "360900"],
            360983: ["高安市", "360900"],
            360984: ["其它区", "360900"],
            361e3: ["抚州市", "360000"],
            361002: ["临川区", "361000"],
            361021: ["南城县", "361000"],
            361022: ["黎川县", "361000"],
            361023: ["南丰县", "361000"],
            361024: ["崇仁县", "361000"],
            361025: ["乐安县", "361000"],
            361026: ["宜黄县", "361000"],
            361027: ["金溪县", "361000"],
            361028: ["资溪县", "361000"],
            361029: ["东乡县", "361000"],
            361030: ["广昌县", "361000"],
            361031: ["其它区", "361000"],
            361100: ["上饶市", "360000"],
            361102: ["信州区", "361100"],
            361121: ["上饶县", "361100"],
            361122: ["广丰县", "361100"],
            361123: ["玉山县", "361100"],
            361124: ["铅山县", "361100"],
            361125: ["横峰县", "361100"],
            361126: ["弋阳县", "361100"],
            361127: ["余干县", "361100"],
            361128: ["鄱阳县", "361100"],
            361129: ["万年县", "361100"],
            361130: ["婺源县", "361100"],
            361181: ["德兴市", "361100"],
            361182: ["其它区", "361100"],
            37e4: ["山东省", "1"],
            370100: ["济南市", "370000"],
            370102: ["历下区", "370100"],
            370103: ["市中区", "370100"],
            370104: ["槐荫区", "370100"],
            370105: ["天桥区", "370100"],
            370112: ["历城区", "370100"],
            370113: ["长清区", "370100"],
            370124: ["平阴县", "370100"],
            370125: ["济阳县", "370100"],
            370126: ["商河县", "370100"],
            370181: ["章丘市", "370100"],
            370182: ["其它区", "370100"],
            370200: ["青岛市", "370000"],
            370202: ["市南区", "370200"],
            370203: ["市北区", "370200"],
            370205: ["四方区", "370200"],
            370211: ["黄岛区", "370200"],
            370212: ["崂山区", "370200"],
            370213: ["李沧区", "370200"],
            370214: ["城阳区", "370200"],
            370251: ["开发区", "370200"],
            370281: ["胶州市", "370200"],
            370282: ["即墨市", "370200"],
            370283: ["平度市", "370200"],
            370284: ["胶南市", "370200"],
            370285: ["莱西市", "370200"],
            370286: ["其它区", "370200"],
            370300: ["淄博市", "370000"],
            370302: ["淄川区", "370300"],
            370303: ["张店区", "370300"],
            370304: ["博山区", "370300"],
            370305: ["临淄区", "370300"],
            370306: ["周村区", "370300"],
            370321: ["桓台县", "370300"],
            370322: ["高青县", "370300"],
            370323: ["沂源县", "370300"],
            370324: ["其它区", "370300"],
            370400: ["枣庄市", "370000"],
            370402: ["市中区", "370400"],
            370403: ["薛城区", "370400"],
            370404: ["峄城区", "370400"],
            370405: ["台儿庄区", "370400"],
            370406: ["山亭区", "370400"],
            370481: ["滕州市", "370400"],
            370482: ["其它区", "370400"],
            370500: ["东营市", "370000"],
            370502: ["东营区", "370500"],
            370503: ["河口区", "370500"],
            370521: ["垦利县", "370500"],
            370522: ["利津县", "370500"],
            370523: ["广饶县", "370500"],
            370589: ["西城区", "370500"],
            370590: ["东城区", "370500"],
            370591: ["其它区", "370500"],
            370600: ["烟台市", "370000"],
            370602: ["芝罘区", "370600"],
            370611: ["福山区", "370600"],
            370612: ["牟平区", "370600"],
            370613: ["莱山区", "370600"],
            370634: ["长岛县", "370600"],
            370681: ["龙口市", "370600"],
            370682: ["莱阳市", "370600"],
            370683: ["莱州市", "370600"],
            370684: ["蓬莱市", "370600"],
            370685: ["招远市", "370600"],
            370686: ["栖霞市", "370600"],
            370687: ["海阳市", "370600"],
            370688: ["其它区", "370600"],
            370700: ["潍坊市", "370000"],
            370702: ["潍城区", "370700"],
            370703: ["寒亭区", "370700"],
            370704: ["坊子区", "370700"],
            370705: ["奎文区", "370700"],
            370724: ["临朐县", "370700"],
            370725: ["昌乐县", "370700"],
            370751: ["开发区", "370700"],
            370781: ["青州市", "370700"],
            370782: ["诸城市", "370700"],
            370783: ["寿光市", "370700"],
            370784: ["安丘市", "370700"],
            370785: ["高密市", "370700"],
            370786: ["昌邑市", "370700"],
            370787: ["其它区", "370700"],
            370800: ["济宁市", "370000"],
            370802: ["市中区", "370800"],
            370811: ["任城区", "370800"],
            370826: ["微山县", "370800"],
            370827: ["鱼台县", "370800"],
            370828: ["金乡县", "370800"],
            370829: ["嘉祥县", "370800"],
            370830: ["汶上县", "370800"],
            370831: ["泗水县", "370800"],
            370832: ["梁山县", "370800"],
            370881: ["曲阜市", "370800"],
            370882: ["兖州市", "370800"],
            370883: ["邹城市", "370800"],
            370884: ["其它区", "370800"],
            370900: ["泰安市", "370000"],
            370902: ["泰山区", "370900"],
            370903: ["岱岳区", "370900"],
            370921: ["宁阳县", "370900"],
            370923: ["东平县", "370900"],
            370982: ["新泰市", "370900"],
            370983: ["肥城市", "370900"],
            370984: ["其它区", "370900"],
            371e3: ["威海市", "370000"],
            371002: ["环翠区", "371000"],
            371081: ["文登市", "371000"],
            371082: ["荣成市", "371000"],
            371083: ["乳山市", "371000"],
            371084: ["其它区", "371000"],
            371100: ["日照市", "370000"],
            371102: ["东港区", "371100"],
            371103: ["岚山区", "371100"],
            371121: ["五莲县", "371100"],
            371122: ["莒县", "371100"],
            371123: ["其它区", "371100"],
            371200: ["莱芜市", "370000"],
            371202: ["莱城区", "371200"],
            371203: ["钢城区", "371200"],
            371204: ["其它区", "371200"],
            371300: ["临沂市", "370000"],
            371302: ["兰山区", "371300"],
            371311: ["罗庄区", "371300"],
            371312: ["河东区", "371300"],
            371321: ["沂南县", "371300"],
            371322: ["郯城县", "371300"],
            371323: ["沂水县", "371300"],
            371324: ["苍山县", "371300"],
            371325: ["费县", "371300"],
            371326: ["平邑县", "371300"],
            371327: ["莒南县", "371300"],
            371328: ["蒙阴县", "371300"],
            371329: ["临沭县", "371300"],
            371330: ["其它区", "371300"],
            371400: ["德州市", "370000"],
            371402: ["德城区", "371400"],
            371421: ["陵县", "371400"],
            371422: ["宁津县", "371400"],
            371423: ["庆云县", "371400"],
            371424: ["临邑县", "371400"],
            371425: ["齐河县", "371400"],
            371426: ["平原县", "371400"],
            371427: ["夏津县", "371400"],
            371428: ["武城县", "371400"],
            371451: ["开发区", "371400"],
            371481: ["乐陵市", "371400"],
            371482: ["禹城市", "371400"],
            371483: ["其它区", "371400"],
            371500: ["聊城市", "370000"],
            371502: ["东昌府区", "371500"],
            371521: ["阳谷县", "371500"],
            371522: ["莘县", "371500"],
            371523: ["茌平县", "371500"],
            371524: ["东阿县", "371500"],
            371525: ["冠县", "371500"],
            371526: ["高唐县", "371500"],
            371581: ["临清市", "371500"],
            371582: ["其它区", "371500"],
            371600: ["滨州市", "370000"],
            371602: ["滨城区", "371600"],
            371621: ["惠民县", "371600"],
            371622: ["阳信县", "371600"],
            371623: ["无棣县", "371600"],
            371624: ["沾化县", "371600"],
            371625: ["博兴县", "371600"],
            371626: ["邹平县", "371600"],
            371627: ["其它区", "371600"],
            371700: ["菏泽市", "370000"],
            371702: ["牡丹区", "371700"],
            371721: ["曹县", "371700"],
            371722: ["单县", "371700"],
            371723: ["成武县", "371700"],
            371724: ["巨野县", "371700"],
            371725: ["郓城县", "371700"],
            371726: ["鄄城县", "371700"],
            371727: ["定陶县", "371700"],
            371728: ["东明县", "371700"],
            371729: ["其它区", "371700"],
            41e4: ["河南省", "1"],
            410100: ["郑州市", "410000"],
            410102: ["中原区", "410100"],
            410103: ["二七区", "410100"],
            410104: ["管城回族区", "410100"],
            410105: ["金水区", "410100"],
            410106: ["上街区", "410100"],
            410108: ["惠济区", "410100"],
            410122: ["中牟县", "410100"],
            410181: ["巩义市", "410100"],
            410182: ["荥阳市", "410100"],
            410183: ["新密市", "410100"],
            410184: ["新郑市", "410100"],
            410185: ["登封市", "410100"],
            410186: ["郑东新区", "410100"],
            410187: ["高新区", "410100"],
            410188: ["其它区", "410100"],
            410200: ["开封市", "410000"],
            410202: ["龙亭区", "410200"],
            410203: ["顺河回族区", "410200"],
            410204: ["鼓楼区", "410200"],
            410205: ["禹王台区", "410200"],
            410211: ["金明区", "410200"],
            410221: ["杞县", "410200"],
            410222: ["通许县", "410200"],
            410223: ["尉氏县", "410200"],
            410224: ["开封县", "410200"],
            410225: ["兰考县", "410200"],
            410226: ["其它区", "410200"],
            410300: ["洛阳市", "410000"],
            410302: ["老城区", "410300"],
            410303: ["西工区", "410300"],
            410304: ["廛河回族区", "410300"],
            410305: ["涧西区", "410300"],
            410306: ["吉利区", "410300"],
            410307: ["洛龙区", "410300"],
            410322: ["孟津县", "410300"],
            410323: ["新安县", "410300"],
            410324: ["栾川县", "410300"],
            410325: ["嵩县", "410300"],
            410326: ["汝阳县", "410300"],
            410327: ["宜阳县", "410300"],
            410328: ["洛宁县", "410300"],
            410329: ["伊川县", "410300"],
            410381: ["偃师市", "410300"],
            471004: ["高新区", "410300"],
            471005: ["其它区", "410300"],
            410400: ["平顶山市", "410000"],
            410402: ["新华区", "410400"],
            410403: ["卫东区", "410400"],
            410404: ["石龙区", "410400"],
            410411: ["湛河区", "410400"],
            410421: ["宝丰县", "410400"],
            410422: ["叶县", "410400"],
            410423: ["鲁山县", "410400"],
            410425: ["郏县", "410400"],
            410481: ["舞钢市", "410400"],
            410482: ["汝州市", "410400"],
            410483: ["其它区", "410400"],
            410500: ["安阳市", "410000"],
            410502: ["文峰区", "410500"],
            410503: ["北关区", "410500"],
            410505: ["殷都区", "410500"],
            410506: ["龙安区", "410500"],
            410522: ["安阳县", "410500"],
            410523: ["汤阴县", "410500"],
            410526: ["滑县", "410500"],
            410527: ["内黄县", "410500"],
            410581: ["林州市", "410500"],
            410582: ["其它区", "410500"],
            410600: ["鹤壁市", "410000"],
            410602: ["鹤山区", "410600"],
            410603: ["山城区", "410600"],
            410611: ["淇滨区", "410600"],
            410621: ["浚县", "410600"],
            410622: ["淇县", "410600"],
            410623: ["其它区", "410600"],
            410700: ["新乡市", "410000"],
            410702: ["红旗区", "410700"],
            410703: ["卫滨区", "410700"],
            410704: ["凤泉区", "410700"],
            410711: ["牧野区", "410700"],
            410721: ["新乡县", "410700"],
            410724: ["获嘉县", "410700"],
            410725: ["原阳县", "410700"],
            410726: ["延津县", "410700"],
            410727: ["封丘县", "410700"],
            410728: ["长垣县", "410700"],
            410781: ["卫辉市", "410700"],
            410782: ["辉县市", "410700"],
            410783: ["其它区", "410700"],
            410800: ["焦作市", "410000"],
            410802: ["解放区", "410800"],
            410803: ["中站区", "410800"],
            410804: ["马村区", "410800"],
            410811: ["山阳区", "410800"],
            410821: ["修武县", "410800"],
            410822: ["博爱县", "410800"],
            410823: ["武陟县", "410800"],
            410825: ["温县", "410800"],
            410882: ["沁阳市", "410800"],
            410883: ["孟州市", "410800"],
            410884: ["其它区", "410800"],
            410881: ["济源市", "410000"],
            410900: ["濮阳市", "410000"],
            410902: ["华龙区", "410900"],
            410922: ["清丰县", "410900"],
            410923: ["南乐县", "410900"],
            410926: ["范县", "410900"],
            410927: ["台前县", "410900"],
            410928: ["濮阳县", "410900"],
            410929: ["其它区", "410900"],
            411e3: ["许昌市", "410000"],
            411002: ["魏都区", "411000"],
            411023: ["许昌县", "411000"],
            411024: ["鄢陵县", "411000"],
            411025: ["襄城县", "411000"],
            411081: ["禹州市", "411000"],
            411082: ["长葛市", "411000"],
            411083: ["其它区", "411000"],
            411100: ["漯河市", "410000"],
            411102: ["源汇区", "411100"],
            411103: ["郾城区", "411100"],
            411104: ["召陵区", "411100"],
            411121: ["舞阳县", "411100"],
            411122: ["临颍县", "411100"],
            411123: ["其它区", "411100"],
            411200: ["三门峡市", "410000"],
            411202: ["湖滨区", "411200"],
            411221: ["渑池县", "411200"],
            411222: ["陕县", "411200"],
            411224: ["卢氏县", "411200"],
            411281: ["义马市", "411200"],
            411282: ["灵宝市", "411200"],
            411283: ["其它区", "411200"],
            411300: ["南阳市", "410000"],
            411302: ["宛城区", "411300"],
            411303: ["卧龙区", "411300"],
            411321: ["南召县", "411300"],
            411322: ["方城县", "411300"],
            411323: ["西峡县", "411300"],
            411324: ["镇平县", "411300"],
            411325: ["内乡县", "411300"],
            411326: ["淅川县", "411300"],
            411327: ["社旗县", "411300"],
            411328: ["唐河县", "411300"],
            411329: ["新野县", "411300"],
            411330: ["桐柏县", "411300"],
            411381: ["邓州市", "411300"],
            411382: ["其它区", "411300"],
            411400: ["商丘市", "410000"],
            411402: ["梁园区", "411400"],
            411403: ["睢阳区", "411400"],
            411421: ["民权县", "411400"],
            411422: ["睢县", "411400"],
            411423: ["宁陵县", "411400"],
            411424: ["柘城县", "411400"],
            411425: ["虞城县", "411400"],
            411426: ["夏邑县", "411400"],
            411481: ["永城市", "411400"],
            411482: ["其它区", "411400"],
            411500: ["信阳市", "410000"],
            411502: ["浉河区", "411500"],
            411503: ["平桥区", "411500"],
            411521: ["罗山县", "411500"],
            411522: ["光山县", "411500"],
            411523: ["新县", "411500"],
            411524: ["商城县", "411500"],
            411525: ["固始县", "411500"],
            411526: ["潢川县", "411500"],
            411527: ["淮滨县", "411500"],
            411528: ["息县", "411500"],
            411529: ["其它区", "411500"],
            411600: ["周口市", "410000"],
            411602: ["川汇区", "411600"],
            411621: ["扶沟县", "411600"],
            411622: ["西华县", "411600"],
            411623: ["商水县", "411600"],
            411624: ["沈丘县", "411600"],
            411625: ["郸城县", "411600"],
            411626: ["淮阳县", "411600"],
            411627: ["太康县", "411600"],
            411628: ["鹿邑县", "411600"],
            411681: ["项城市", "411600"],
            411682: ["其它区", "411600"],
            411700: ["驻马店市", "410000"],
            411702: ["驿城区", "411700"],
            411721: ["西平县", "411700"],
            411722: ["上蔡县", "411700"],
            411723: ["平舆县", "411700"],
            411724: ["正阳县", "411700"],
            411725: ["确山县", "411700"],
            411726: ["泌阳县", "411700"],
            411727: ["汝南县", "411700"],
            411728: ["遂平县", "411700"],
            411729: ["新蔡县", "411700"],
            411730: ["其它区", "411700"],
            42e4: ["湖北省", "1"],
            420100: ["武汉市", "420000"],
            420102: ["江岸区", "420100"],
            420103: ["江汉区", "420100"],
            420104: ["硚口区", "420100"],
            420105: ["汉阳区", "420100"],
            420106: ["武昌区", "420100"],
            420107: ["青山区", "420100"],
            420111: ["洪山区", "420100"],
            420112: ["东西湖区", "420100"],
            420113: ["汉南区", "420100"],
            420114: ["蔡甸区", "420100"],
            420115: ["江夏区", "420100"],
            420116: ["黄陂区", "420100"],
            420117: ["新洲区", "420100"],
            420118: ["其它区", "420100"],
            420200: ["黄石市", "420000"],
            420202: ["黄石港区", "420200"],
            420203: ["西塞山区", "420200"],
            420204: ["下陆区", "420200"],
            420205: ["铁山区", "420200"],
            420222: ["阳新县", "420200"],
            420281: ["大冶市", "420200"],
            420282: ["其它区", "420200"],
            420300: ["十堰市", "420000"],
            420302: ["茅箭区", "420300"],
            420303: ["张湾区", "420300"],
            420321: ["郧县", "420300"],
            420322: ["郧西县", "420300"],
            420323: ["竹山县", "420300"],
            420324: ["竹溪县", "420300"],
            420325: ["房县", "420300"],
            420381: ["丹江口市", "420300"],
            420382: ["城区", "420300"],
            420383: ["其它区", "420300"],
            420500: ["宜昌市", "420000"],
            420502: ["西陵区", "420500"],
            420503: ["伍家岗区", "420500"],
            420504: ["点军区", "420500"],
            420505: ["猇亭区", "420500"],
            420506: ["夷陵区", "420500"],
            420525: ["远安县", "420500"],
            420526: ["兴山县", "420500"],
            420527: ["秭归县", "420500"],
            420528: ["长阳土家族自治县", "420500"],
            420529: ["五峰土家族自治县", "420500"],
            420551: ["葛洲坝区", "420500"],
            420552: ["开发区", "420500"],
            420581: ["宜都市", "420500"],
            420582: ["当阳市", "420500"],
            420583: ["枝江市", "420500"],
            420584: ["其它区", "420500"],
            420600: ["襄阳市", "420000"],
            420602: ["襄城区", "420600"],
            420606: ["樊城区", "420600"],
            420607: ["襄州区", "420600"],
            420624: ["南漳县", "420600"],
            420625: ["谷城县", "420600"],
            420626: ["保康县", "420600"],
            420682: ["老河口市", "420600"],
            420683: ["枣阳市", "420600"],
            420684: ["宜城市", "420600"],
            420685: ["其它区", "420600"],
            420700: ["鄂州市", "420000"],
            420702: ["梁子湖区", "420700"],
            420703: ["华容区", "420700"],
            420704: ["鄂城区", "420700"],
            420705: ["其它区", "420700"],
            420800: ["荆门市", "420000"],
            420802: ["东宝区", "420800"],
            420804: ["掇刀区", "420800"],
            420821: ["京山县", "420800"],
            420822: ["沙洋县", "420800"],
            420881: ["钟祥市", "420800"],
            420882: ["其它区", "420800"],
            420900: ["孝感市", "420000"],
            420902: ["孝南区", "420900"],
            420921: ["孝昌县", "420900"],
            420922: ["大悟县", "420900"],
            420923: ["云梦县", "420900"],
            420981: ["应城市", "420900"],
            420982: ["安陆市", "420900"],
            420984: ["汉川市", "420900"],
            420985: ["其它区", "420900"],
            421e3: ["荆州市", "420000"],
            421002: ["沙市区", "421000"],
            421003: ["荆州区", "421000"],
            421022: ["公安县", "421000"],
            421023: ["监利县", "421000"],
            421024: ["江陵县", "421000"],
            421081: ["石首市", "421000"],
            421083: ["洪湖市", "421000"],
            421087: ["松滋市", "421000"],
            421088: ["其它区", "421000"],
            421100: ["黄冈市", "420000"],
            421102: ["黄州区", "421100"],
            421121: ["团风县", "421100"],
            421122: ["红安县", "421100"],
            421123: ["罗田县", "421100"],
            421124: ["英山县", "421100"],
            421125: ["浠水县", "421100"],
            421126: ["蕲春县", "421100"],
            421127: ["黄梅县", "421100"],
            421181: ["麻城市", "421100"],
            421182: ["武穴市", "421100"],
            421183: ["其它区", "421100"],
            421200: ["咸宁市", "420000"],
            421202: ["咸安区", "421200"],
            421221: ["嘉鱼县", "421200"],
            421222: ["通城县", "421200"],
            421223: ["崇阳县", "421200"],
            421224: ["通山县", "421200"],
            421281: ["赤壁市", "421200"],
            421282: ["温泉城区", "421200"],
            421283: ["其它区", "421200"],
            421300: ["随州市", "420000"],
            421302: ["曾都区", "421300"],
            421321: ["随县", "421300"],
            421381: ["广水市", "421300"],
            421382: ["其它区", "421300"],
            422800: ["恩施土家族苗族自治州", "420000"],
            422801: ["恩施市", "422800"],
            422802: ["利川市", "422800"],
            422822: ["建始县", "422800"],
            422823: ["巴东县", "422800"],
            422825: ["宣恩县", "422800"],
            422826: ["咸丰县", "422800"],
            422827: ["来凤县", "422800"],
            422828: ["鹤峰县", "422800"],
            422829: ["其它区", "422800"],
            429004: ["仙桃市", "420000"],
            429005: ["潜江市", "420000"],
            429006: ["天门市", "420000"],
            429021: ["神农架林区", "420000"],
            43e4: ["湖南省", "1"],
            430100: ["长沙市", "430000"],
            430102: ["芙蓉区", "430100"],
            430103: ["天心区", "430100"],
            430104: ["岳麓区", "430100"],
            430105: ["开福区", "430100"],
            430111: ["雨花区", "430100"],
            430121: ["长沙县", "430100"],
            430122: ["望城县", "430100"],
            430124: ["宁乡县", "430100"],
            430181: ["浏阳市", "430100"],
            430182: ["其它区", "430100"],
            430200: ["株洲市", "430000"],
            430202: ["荷塘区", "430200"],
            430203: ["芦淞区", "430200"],
            430204: ["石峰区", "430200"],
            430211: ["天元区", "430200"],
            430221: ["株洲县", "430200"],
            430223: ["攸县", "430200"],
            430224: ["茶陵县", "430200"],
            430225: ["炎陵县", "430200"],
            430281: ["醴陵市", "430200"],
            430282: ["其它区", "430200"],
            430300: ["湘潭市", "430000"],
            430302: ["雨湖区", "430300"],
            430304: ["岳塘区", "430300"],
            430321: ["湘潭县", "430300"],
            430381: ["湘乡市", "430300"],
            430382: ["韶山市", "430300"],
            430383: ["其它区", "430300"],
            430400: ["衡阳市", "430000"],
            430405: ["珠晖区", "430400"],
            430406: ["雁峰区", "430400"],
            430407: ["石鼓区", "430400"],
            430408: ["蒸湘区", "430400"],
            430412: ["南岳区", "430400"],
            430421: ["衡阳县", "430400"],
            430422: ["衡南县", "430400"],
            430423: ["衡山县", "430400"],
            430424: ["衡东县", "430400"],
            430426: ["祁东县", "430400"],
            430481: ["耒阳市", "430400"],
            430482: ["常宁市", "430400"],
            430483: ["其它区", "430400"],
            430500: ["邵阳市", "430000"],
            430502: ["双清区", "430500"],
            430503: ["大祥区", "430500"],
            430511: ["北塔区", "430500"],
            430521: ["邵东县", "430500"],
            430522: ["新邵县", "430500"],
            430523: ["邵阳县", "430500"],
            430524: ["隆回县", "430500"],
            430525: ["洞口县", "430500"],
            430527: ["绥宁县", "430500"],
            430528: ["新宁县", "430500"],
            430529: ["城步苗族自治县", "430500"],
            430581: ["武冈市", "430500"],
            430582: ["其它区", "430500"],
            430600: ["岳阳市", "430000"],
            430602: ["岳阳楼区", "430600"],
            430603: ["云溪区", "430600"],
            430611: ["君山区", "430600"],
            430621: ["岳阳县", "430600"],
            430623: ["华容县", "430600"],
            430624: ["湘阴县", "430600"],
            430626: ["平江县", "430600"],
            430681: ["汨罗市", "430600"],
            430682: ["临湘市", "430600"],
            430683: ["其它区", "430600"],
            430700: ["常德市", "430000"],
            430702: ["武陵区", "430700"],
            430703: ["鼎城区", "430700"],
            430721: ["安乡县", "430700"],
            430722: ["汉寿县", "430700"],
            430723: ["澧县", "430700"],
            430724: ["临澧县", "430700"],
            430725: ["桃源县", "430700"],
            430726: ["石门县", "430700"],
            430781: ["津市市", "430700"],
            430782: ["其它区", "430700"],
            430800: ["张家界市", "430000"],
            430802: ["永定区", "430800"],
            430811: ["武陵源区", "430800"],
            430821: ["慈利县", "430800"],
            430822: ["桑植县", "430800"],
            430823: ["其它区", "430800"],
            430900: ["益阳市", "430000"],
            430902: ["资阳区", "430900"],
            430903: ["赫山区", "430900"],
            430921: ["南县", "430900"],
            430922: ["桃江县", "430900"],
            430923: ["安化县", "430900"],
            430981: ["沅江市", "430900"],
            430982: ["其它区", "430900"],
            431e3: ["郴州市", "430000"],
            431002: ["北湖区", "431000"],
            431003: ["苏仙区", "431000"],
            431021: ["桂阳县", "431000"],
            431022: ["宜章县", "431000"],
            431023: ["永兴县", "431000"],
            431024: ["嘉禾县", "431000"],
            431025: ["临武县", "431000"],
            431026: ["汝城县", "431000"],
            431027: ["桂东县", "431000"],
            431028: ["安仁县", "431000"],
            431081: ["资兴市", "431000"],
            431082: ["其它区", "431000"],
            431100: ["永州市", "430000"],
            431102: ["零陵区", "431100"],
            431103: ["冷水滩区", "431100"],
            431121: ["祁阳县", "431100"],
            431122: ["东安县", "431100"],
            431123: ["双牌县", "431100"],
            431124: ["道县", "431100"],
            431125: ["江永县", "431100"],
            431126: ["宁远县", "431100"],
            431127: ["蓝山县", "431100"],
            431128: ["新田县", "431100"],
            431129: ["江华瑶族自治县", "431100"],
            431130: ["其它区", "431100"],
            431200: ["怀化市", "430000"],
            431202: ["鹤城区", "431200"],
            431221: ["中方县", "431200"],
            431222: ["沅陵县", "431200"],
            431223: ["辰溪县", "431200"],
            431224: ["溆浦县", "431200"],
            431225: ["会同县", "431200"],
            431226: ["麻阳苗族自治县", "431200"],
            431227: ["新晃侗族自治县", "431200"],
            431228: ["芷江侗族自治县", "431200"],
            431229: ["靖州苗族侗族自治县", "431200"],
            431230: ["通道侗族自治县", "431200"],
            431281: ["洪江市", "431200"],
            431282: ["其它区", "431200"],
            431300: ["娄底市", "430000"],
            431302: ["娄星区", "431300"],
            431321: ["双峰县", "431300"],
            431322: ["新化县", "431300"],
            431381: ["冷水江市", "431300"],
            431382: ["涟源市", "431300"],
            431383: ["其它区", "431300"],
            433100: ["湘西土家族苗族自治州", "430000"],
            433101: ["吉首市", "433100"],
            433122: ["泸溪县", "433100"],
            433123: ["凤凰县", "433100"],
            433124: ["花垣县", "433100"],
            433125: ["保靖县", "433100"],
            433126: ["古丈县", "433100"],
            433127: ["永顺县", "433100"],
            433130: ["龙山县", "433100"],
            433131: ["其它区", "433100"],
            44e4: ["广东省", "1"],
            440100: ["广州市", "440000"],
            440103: ["荔湾区", "440100"],
            440104: ["越秀区", "440100"],
            440105: ["海珠区", "440100"],
            440106: ["天河区", "440100"],
            440111: ["白云区", "440100"],
            440112: ["黄埔区", "440100"],
            440113: ["番禺区", "440100"],
            440114: ["花都区", "440100"],
            440115: ["南沙区", "440100"],
            440116: ["萝岗区", "440100"],
            440183: ["增城市", "440100"],
            440184: ["从化市", "440100"],
            440188: ["东山区", "440100"],
            440189: ["其它区", "440100"],
            440200: ["韶关市", "440000"],
            440203: ["武江区", "440200"],
            440204: ["浈江区", "440200"],
            440205: ["曲江区", "440200"],
            440222: ["始兴县", "440200"],
            440224: ["仁化县", "440200"],
            440229: ["翁源县", "440200"],
            440232: ["乳源瑶族自治县", "440200"],
            440233: ["新丰县", "440200"],
            440281: ["乐昌市", "440200"],
            440282: ["南雄市", "440200"],
            440283: ["其它区", "440200"],
            440300: ["深圳市", "440000"],
            440303: ["罗湖区", "440300"],
            440304: ["福田区", "440300"],
            440305: ["南山区", "440300"],
            440306: ["宝安区", "440300"],
            440307: ["龙岗区", "440300"],
            440308: ["盐田区", "440300"],
            440309: ["其它区", "440300"],
            440400: ["珠海市", "440000"],
            440402: ["香洲区", "440400"],
            440403: ["斗门区", "440400"],
            440404: ["金湾区", "440400"],
            440486: ["金唐区", "440400"],
            440487: ["南湾区", "440400"],
            440488: ["其它区", "440400"],
            440500: ["汕头市", "440000"],
            440507: ["龙湖区", "440500"],
            440511: ["金平区", "440500"],
            440512: ["濠江区", "440500"],
            440513: ["潮阳区", "440500"],
            440514: ["潮南区", "440500"],
            440515: ["澄海区", "440500"],
            440523: ["南澳县", "440500"],
            440524: ["其它区", "440500"],
            440600: ["佛山市", "440000"],
            440604: ["禅城区", "440600"],
            440605: ["南海区", "440600"],
            440606: ["顺德区", "440600"],
            440607: ["三水区", "440600"],
            440608: ["高明区", "440600"],
            440609: ["其它区", "440600"],
            440700: ["江门市", "440000"],
            440703: ["蓬江区", "440700"],
            440704: ["江海区", "440700"],
            440705: ["新会区", "440700"],
            440781: ["台山市", "440700"],
            440783: ["开平市", "440700"],
            440784: ["鹤山市", "440700"],
            440785: ["恩平市", "440700"],
            440786: ["其它区", "440700"],
            440800: ["湛江市", "440000"],
            440802: ["赤坎区", "440800"],
            440803: ["霞山区", "440800"],
            440804: ["坡头区", "440800"],
            440811: ["麻章区", "440800"],
            440823: ["遂溪县", "440800"],
            440825: ["徐闻县", "440800"],
            440881: ["廉江市", "440800"],
            440882: ["雷州市", "440800"],
            440883: ["吴川市", "440800"],
            440884: ["其它区", "440800"],
            440900: ["茂名市", "440000"],
            440902: ["茂南区", "440900"],
            440903: ["茂港区", "440900"],
            440923: ["电白县", "440900"],
            440981: ["高州市", "440900"],
            440982: ["化州市", "440900"],
            440983: ["信宜市", "440900"],
            440984: ["其它区", "440900"],
            441200: ["肇庆市", "440000"],
            441202: ["端州区", "441200"],
            441203: ["鼎湖区", "441200"],
            441223: ["广宁县", "441200"],
            441224: ["怀集县", "441200"],
            441225: ["封开县", "441200"],
            441226: ["德庆县", "441200"],
            441283: ["高要市", "441200"],
            441284: ["四会市", "441200"],
            441285: ["其它区", "441200"],
            441300: ["惠州市", "440000"],
            441302: ["惠城区", "441300"],
            441303: ["惠阳区", "441300"],
            441322: ["博罗县", "441300"],
            441323: ["惠东县", "441300"],
            441324: ["龙门县", "441300"],
            441325: ["其它区", "441300"],
            441400: ["梅州市", "440000"],
            441402: ["梅江区", "441400"],
            441421: ["梅县", "441400"],
            441422: ["大埔县", "441400"],
            441423: ["丰顺县", "441400"],
            441424: ["五华县", "441400"],
            441426: ["平远县", "441400"],
            441427: ["蕉岭县", "441400"],
            441481: ["兴宁市", "441400"],
            441482: ["其它区", "441400"],
            441500: ["汕尾市", "440000"],
            441502: ["城区", "441500"],
            441521: ["海丰县", "441500"],
            441523: ["陆河县", "441500"],
            441581: ["陆丰市", "441500"],
            441582: ["其它区", "441500"],
            441600: ["河源市", "440000"],
            441602: ["源城区", "441600"],
            441621: ["紫金县", "441600"],
            441622: ["龙川县", "441600"],
            441623: ["连平县", "441600"],
            441624: ["和平县", "441600"],
            441625: ["东源县", "441600"],
            441626: ["其它区", "441600"],
            441700: ["阳江市", "440000"],
            441702: ["江城区", "441700"],
            441721: ["阳西县", "441700"],
            441723: ["阳东县", "441700"],
            441781: ["阳春市", "441700"],
            441782: ["其它区", "441700"],
            441800: ["清远市", "440000"],
            441802: ["清城区", "441800"],
            441821: ["佛冈县", "441800"],
            441823: ["阳山县", "441800"],
            441825: ["连山壮族瑶族自治县", "441800"],
            441826: ["连南瑶族自治县", "441800"],
            441827: ["清新县", "441800"],
            441881: ["英德市", "441800"],
            441882: ["连州市", "441800"],
            441883: ["其它区", "441800"],
            441900: ["东莞市", "440000"],
            441956: ["东城区", "441900"],
            441958: ["南城区", "441900"],
            441959: ["莞城区", "441900"],
            441977: ["万江区", "441900"],
            442e3: ["中山市", "440000"],
            445100: ["潮州市", "440000"],
            445102: ["湘桥区", "445100"],
            445121: ["潮安县", "445100"],
            445122: ["饶平县", "445100"],
            445185: ["枫溪区", "445100"],
            445186: ["其它区", "445100"],
            445200: ["揭阳市", "440000"],
            445202: ["榕城区", "445200"],
            445221: ["揭东县", "445200"],
            445222: ["揭西县", "445200"],
            445224: ["惠来县", "445200"],
            445281: ["普宁市", "445200"],
            445284: ["东山区", "445200"],
            445285: ["其它区", "445200"],
            445300: ["云浮市", "440000"],
            445302: ["云城区", "445300"],
            445321: ["新兴县", "445300"],
            445322: ["郁南县", "445300"],
            445323: ["云安县", "445300"],
            445381: ["罗定市", "445300"],
            445382: ["其它区", "445300"],
            45e4: ["广西壮族自治区", "1"],
            450100: ["南宁市", "450000"],
            450102: ["兴宁区", "450100"],
            450103: ["青秀区", "450100"],
            450105: ["江南区", "450100"],
            450107: ["西乡塘区", "450100"],
            450108: ["良庆区", "450100"],
            450109: ["邕宁区", "450100"],
            450122: ["武鸣县", "450100"],
            450123: ["隆安县", "450100"],
            450124: ["马山县", "450100"],
            450125: ["上林县", "450100"],
            450126: ["宾阳县", "450100"],
            450127: ["横县", "450100"],
            450128: ["其它区", "450100"],
            450200: ["柳州市", "450000"],
            450202: ["城中区", "450200"],
            450203: ["鱼峰区", "450200"],
            450204: ["柳南区", "450200"],
            450205: ["柳北区", "450200"],
            450221: ["柳江县", "450200"],
            450222: ["柳城县", "450200"],
            450223: ["鹿寨县", "450200"],
            450224: ["融安县", "450200"],
            450225: ["融水苗族自治县", "450200"],
            450226: ["三江侗族自治县", "450200"],
            450227: ["其它区", "450200"],
            450300: ["桂林市", "450000"],
            450302: ["秀峰区", "450300"],
            450303: ["叠彩区", "450300"],
            450304: ["象山区", "450300"],
            450305: ["七星区", "450300"],
            450311: ["雁山区", "450300"],
            450321: ["阳朔县", "450300"],
            450322: ["临桂县", "450300"],
            450323: ["灵川县", "450300"],
            450324: ["全州县", "450300"],
            450325: ["兴安县", "450300"],
            450326: ["永福县", "450300"],
            450327: ["灌阳县", "450300"],
            450328: ["龙胜各族自治县", "450300"],
            450329: ["资源县", "450300"],
            450330: ["平乐县", "450300"],
            450331: ["荔浦县", "450300"],
            450332: ["恭城瑶族自治县", "450300"],
            450333: ["其它区", "450300"],
            450400: ["梧州市", "450000"],
            450403: ["万秀区", "450400"],
            450404: ["蝶山区", "450400"],
            450405: ["长洲区", "450400"],
            450421: ["苍梧县", "450400"],
            450422: ["藤县", "450400"],
            450423: ["蒙山县", "450400"],
            450481: ["岑溪市", "450400"],
            450482: ["其它区", "450400"],
            450500: ["北海市", "450000"],
            450502: ["海城区", "450500"],
            450503: ["银海区", "450500"],
            450512: ["铁山港区", "450500"],
            450521: ["合浦县", "450500"],
            450522: ["其它区", "450500"],
            450600: ["防城港市", "450000"],
            450602: ["港口区", "450600"],
            450603: ["防城区", "450600"],
            450621: ["上思县", "450600"],
            450681: ["东兴市", "450600"],
            450682: ["其它区", "450600"],
            450700: ["钦州市", "450000"],
            450702: ["钦南区", "450700"],
            450703: ["钦北区", "450700"],
            450721: ["灵山县", "450700"],
            450722: ["浦北县", "450700"],
            450723: ["其它区", "450700"],
            450800: ["贵港市", "450000"],
            450802: ["港北区", "450800"],
            450803: ["港南区", "450800"],
            450804: ["覃塘区", "450800"],
            450821: ["平南县", "450800"],
            450881: ["桂平市", "450800"],
            450882: ["其它区", "450800"],
            450900: ["玉林市", "450000"],
            450902: ["玉州区", "450900"],
            450921: ["容县", "450900"],
            450922: ["陆川县", "450900"],
            450923: ["博白县", "450900"],
            450924: ["兴业县", "450900"],
            450981: ["北流市", "450900"],
            450982: ["其它区", "450900"],
            451e3: ["百色市", "450000"],
            451002: ["右江区", "451000"],
            451021: ["田阳县", "451000"],
            451022: ["田东县", "451000"],
            451023: ["平果县", "451000"],
            451024: ["德保县", "451000"],
            451025: ["靖西县", "451000"],
            451026: ["那坡县", "451000"],
            451027: ["凌云县", "451000"],
            451028: ["乐业县", "451000"],
            451029: ["田林县", "451000"],
            451030: ["西林县", "451000"],
            451031: ["隆林各族自治县", "451000"],
            451032: ["其它区", "451000"],
            451100: ["贺州市", "450000"],
            451102: ["八步区", "451100"],
            451121: ["昭平县", "451100"],
            451122: ["钟山县", "451100"],
            451123: ["富川瑶族自治县", "451100"],
            451124: ["其它区", "451100"],
            451200: ["河池市", "450000"],
            451202: ["金城江区", "451200"],
            451221: ["南丹县", "451200"],
            451222: ["天峨县", "451200"],
            451223: ["凤山县", "451200"],
            451224: ["东兰县", "451200"],
            451225: ["罗城仫佬族自治县", "451200"],
            451226: ["环江毛南族自治县", "451200"],
            451227: ["巴马瑶族自治县", "451200"],
            451228: ["都安瑶族自治县", "451200"],
            451229: ["大化瑶族自治县", "451200"],
            451281: ["宜州市", "451200"],
            451282: ["其它区", "451200"],
            451300: ["来宾市", "450000"],
            451302: ["兴宾区", "451300"],
            451321: ["忻城县", "451300"],
            451322: ["象州县", "451300"],
            451323: ["武宣县", "451300"],
            451324: ["金秀瑶族自治县", "451300"],
            451381: ["合山市", "451300"],
            451382: ["其它区", "451300"],
            451400: ["崇左市", "450000"],
            451402: ["江州区", "451400"],
            451421: ["扶绥县", "451400"],
            451422: ["宁明县", "451400"],
            451423: ["龙州县", "451400"],
            451424: ["大新县", "451400"],
            451425: ["天等县", "451400"],
            451481: ["凭祥市", "451400"],
            451482: ["其它区", "451400"],
            46e4: ["海南省", "1"],
            460100: ["海口市", "460000"],
            460105: ["秀英区", "460100"],
            460106: ["龙华区", "460100"],
            460107: ["琼山区", "460100"],
            460108: ["美兰区", "460100"],
            460109: ["其它区", "460100"],
            460200: ["三亚市", "460000"],
            469001: ["五指山市", "460000"],
            469002: ["琼海市", "460000"],
            469003: ["儋州市", "460000"],
            469005: ["文昌市", "460000"],
            469006: ["万宁市", "460000"],
            469007: ["东方市", "460000"],
            469025: ["定安县", "460000"],
            469026: ["屯昌县", "460000"],
            469027: ["澄迈县", "460000"],
            469028: ["临高县", "460000"],
            469030: ["白沙黎族自治县", "460000"],
            469031: ["昌江黎族自治县", "460000"],
            469033: ["乐东黎族自治县", "460000"],
            469034: ["陵水黎族自治县", "460000"],
            469035: ["保亭黎族苗族自治县", "460000"],
            469036: ["琼中黎族苗族自治县", "460000"],
            469037: ["西沙群岛", "460000"],
            469038: ["南沙群岛", "460000"],
            469039: ["中沙群岛的岛礁及其海域", "460000"],
            5e5: ["重庆", "1"],
            500100: ["重庆市", "500000"],
            500101: ["万州区", "500100"],
            500102: ["涪陵区", "500100"],
            500103: ["渝中区", "500100"],
            500104: ["大渡口区", "500100"],
            500105: ["江北区", "500100"],
            500106: ["沙坪坝区", "500100"],
            500107: ["九龙坡区", "500100"],
            500108: ["南岸区", "500100"],
            500109: ["北碚区", "500100"],
            500110: ["万盛区", "500100"],
            500111: ["双桥区", "500100"],
            500112: ["渝北区", "500100"],
            500113: ["巴南区", "500100"],
            500114: ["黔江区", "500100"],
            500115: ["长寿区", "500100"],
            500222: ["綦江县", "500100"],
            500223: ["潼南县", "500100"],
            500224: ["铜梁县", "500100"],
            500225: ["大足县", "500100"],
            500226: ["荣昌县", "500100"],
            500227: ["璧山县", "500100"],
            500228: ["梁平县", "500100"],
            500229: ["城口县", "500100"],
            500230: ["丰都县", "500100"],
            500231: ["垫江县", "500100"],
            500232: ["武隆县", "500100"],
            500233: ["忠县", "500100"],
            500234: ["开县", "500100"],
            500235: ["云阳县", "500100"],
            500236: ["奉节县", "500100"],
            500237: ["巫山县", "500100"],
            500238: ["巫溪县", "500100"],
            500240: ["石柱土家族自治县", "500100"],
            500241: ["秀山土家族苗族自治县", "500100"],
            500242: ["酉阳土家族苗族自治县", "500100"],
            500243: ["彭水苗族土家族自治县", "500100"],
            500381: ["江津区", "500100"],
            500382: ["合川区", "500100"],
            500383: ["永川区", "500100"],
            500384: ["南川区", "500100"],
            500385: ["其它区", "500100"],
            51e4: ["四川省", "1"],
            510100: ["成都市", "510000"],
            510104: ["锦江区", "510100"],
            510105: ["青羊区", "510100"],
            510106: ["金牛区", "510100"],
            510107: ["武侯区", "510100"],
            510108: ["成华区", "510100"],
            510112: ["龙泉驿区", "510100"],
            510113: ["青白江区", "510100"],
            510114: ["新都区", "510100"],
            510115: ["温江区", "510100"],
            510121: ["金堂县", "510100"],
            510122: ["双流县", "510100"],
            510124: ["郫县", "510100"],
            510129: ["大邑县", "510100"],
            510131: ["蒲江县", "510100"],
            510132: ["新津县", "510100"],
            510181: ["都江堰市", "510100"],
            510182: ["彭州市", "510100"],
            510183: ["邛崃市", "510100"],
            510184: ["崇州市", "510100"],
            510185: ["其它区", "510100"],
            510300: ["自贡市", "510000"],
            510302: ["自流井区", "510300"],
            510303: ["贡井区", "510300"],
            510304: ["大安区", "510300"],
            510311: ["沿滩区", "510300"],
            510321: ["荣县", "510300"],
            510322: ["富顺县", "510300"],
            510323: ["其它区", "510300"],
            510400: ["攀枝花市", "510000"],
            510402: ["东区", "510400"],
            510403: ["西区", "510400"],
            510411: ["仁和区", "510400"],
            510421: ["米易县", "510400"],
            510422: ["盐边县", "510400"],
            510423: ["其它区", "510400"],
            510500: ["泸州市", "510000"],
            510502: ["江阳区", "510500"],
            510503: ["纳溪区", "510500"],
            510504: ["龙马潭区", "510500"],
            510521: ["泸县", "510500"],
            510522: ["合江县", "510500"],
            510524: ["叙永县", "510500"],
            510525: ["古蔺县", "510500"],
            510526: ["其它区", "510500"],
            510600: ["德阳市", "510000"],
            510603: ["旌阳区", "510600"],
            510623: ["中江县", "510600"],
            510626: ["罗江县", "510600"],
            510681: ["广汉市", "510600"],
            510682: ["什邡市", "510600"],
            510683: ["绵竹市", "510600"],
            510684: ["其它区", "510600"],
            510700: ["绵阳市", "510000"],
            510703: ["涪城区", "510700"],
            510704: ["游仙区", "510700"],
            510722: ["三台县", "510700"],
            510723: ["盐亭县", "510700"],
            510724: ["安县", "510700"],
            510725: ["梓潼县", "510700"],
            510726: ["北川羌族自治县", "510700"],
            510727: ["平武县", "510700"],
            510751: ["高新区", "510700"],
            510781: ["江油市", "510700"],
            510782: ["其它区", "510700"],
            510800: ["广元市", "510000"],
            510802: ["利州区", "510800"],
            510811: ["元坝区", "510800"],
            510812: ["朝天区", "510800"],
            510821: ["旺苍县", "510800"],
            510822: ["青川县", "510800"],
            510823: ["剑阁县", "510800"],
            510824: ["苍溪县", "510800"],
            510825: ["其它区", "510800"],
            510900: ["遂宁市", "510000"],
            510903: ["船山区", "510900"],
            510904: ["安居区", "510900"],
            510921: ["蓬溪县", "510900"],
            510922: ["射洪县", "510900"],
            510923: ["大英县", "510900"],
            510924: ["其它区", "510900"],
            511e3: ["内江市", "510000"],
            511002: ["市中区", "511000"],
            511011: ["东兴区", "511000"],
            511024: ["威远县", "511000"],
            511025: ["资中县", "511000"],
            511028: ["隆昌县", "511000"],
            511029: ["其它区", "511000"],
            511100: ["乐山市", "510000"],
            511102: ["市中区", "511100"],
            511111: ["沙湾区", "511100"],
            511112: ["五通桥区", "511100"],
            511113: ["金口河区", "511100"],
            511123: ["犍为县", "511100"],
            511124: ["井研县", "511100"],
            511126: ["夹江县", "511100"],
            511129: ["沐川县", "511100"],
            511132: ["峨边彝族自治县", "511100"],
            511133: ["马边彝族自治县", "511100"],
            511181: ["峨眉山市", "511100"],
            511182: ["其它区", "511100"],
            511300: ["南充市", "510000"],
            511302: ["顺庆区", "511300"],
            511303: ["高坪区", "511300"],
            511304: ["嘉陵区", "511300"],
            511321: ["南部县", "511300"],
            511322: ["营山县", "511300"],
            511323: ["蓬安县", "511300"],
            511324: ["仪陇县", "511300"],
            511325: ["西充县", "511300"],
            511381: ["阆中市", "511300"],
            511382: ["其它区", "511300"],
            511400: ["眉山市", "510000"],
            511402: ["东坡区", "511400"],
            511421: ["仁寿县", "511400"],
            511422: ["彭山县", "511400"],
            511423: ["洪雅县", "511400"],
            511424: ["丹棱县", "511400"],
            511425: ["青神县", "511400"],
            511426: ["其它区", "511400"],
            511500: ["宜宾市", "510000"],
            511502: ["翠屏区", "511500"],
            511521: ["宜宾县", "511500"],
            511522: ["南溪县", "511500"],
            511523: ["江安县", "511500"],
            511524: ["长宁县", "511500"],
            511525: ["高县", "511500"],
            511526: ["珙县", "511500"],
            511527: ["筠连县", "511500"],
            511528: ["兴文县", "511500"],
            511529: ["屏山县", "511500"],
            511530: ["其它区", "511500"],
            511600: ["广安市", "510000"],
            511602: ["广安区", "511600"],
            511621: ["岳池县", "511600"],
            511622: ["武胜县", "511600"],
            511623: ["邻水县", "511600"],
            511681: ["华蓥市", "511600"],
            511682: ["市辖区", "511600"],
            511683: ["其它区", "511600"],
            511700: ["达州市", "510000"],
            511702: ["通川区", "511700"],
            511721: ["达县", "511700"],
            511722: ["宣汉县", "511700"],
            511723: ["开江县", "511700"],
            511724: ["大竹县", "511700"],
            511725: ["渠县", "511700"],
            511781: ["万源市", "511700"],
            511782: ["其它区", "511700"],
            511800: ["雅安市", "510000"],
            511802: ["雨城区", "511800"],
            511821: ["名山县", "511800"],
            511822: ["荥经县", "511800"],
            511823: ["汉源县", "511800"],
            511824: ["石棉县", "511800"],
            511825: ["天全县", "511800"],
            511826: ["芦山县", "511800"],
            511827: ["宝兴县", "511800"],
            511828: ["其它区", "511800"],
            511900: ["巴中市", "510000"],
            511902: ["巴州区", "511900"],
            511921: ["通江县", "511900"],
            511922: ["南江县", "511900"],
            511923: ["平昌县", "511900"],
            511924: ["其它区", "511900"],
            512e3: ["资阳市", "510000"],
            512002: ["雁江区", "512000"],
            512021: ["安岳县", "512000"],
            512022: ["乐至县", "512000"],
            512081: ["简阳市", "512000"],
            512082: ["其它区", "512000"],
            513200: ["阿坝藏族羌族自治州", "510000"],
            513221: ["汶川县", "513200"],
            513222: ["理县", "513200"],
            513223: ["茂县", "513200"],
            513224: ["松潘县", "513200"],
            513225: ["九寨沟县", "513200"],
            513226: ["金川县", "513200"],
            513227: ["小金县", "513200"],
            513228: ["黑水县", "513200"],
            513229: ["马尔康县", "513200"],
            513230: ["壤塘县", "513200"],
            513231: ["阿坝县", "513200"],
            513232: ["若尔盖县", "513200"],
            513233: ["红原县", "513200"],
            513234: ["其它区", "513200"],
            513300: ["甘孜藏族自治州", "510000"],
            513321: ["康定县", "513300"],
            513322: ["泸定县", "513300"],
            513323: ["丹巴县", "513300"],
            513324: ["九龙县", "513300"],
            513325: ["雅江县", "513300"],
            513326: ["道孚县", "513300"],
            513327: ["炉霍县", "513300"],
            513328: ["甘孜县", "513300"],
            513329: ["新龙县", "513300"],
            513330: ["德格县", "513300"],
            513331: ["白玉县", "513300"],
            513332: ["石渠县", "513300"],
            513333: ["色达县", "513300"],
            513334: ["理塘县", "513300"],
            513335: ["巴塘县", "513300"],
            513336: ["乡城县", "513300"],
            513337: ["稻城县", "513300"],
            513338: ["得荣县", "513300"],
            513339: ["其它区", "513300"],
            513400: ["凉山彝族自治州", "510000"],
            513401: ["西昌市", "513400"],
            513422: ["木里藏族自治县", "513400"],
            513423: ["盐源县", "513400"],
            513424: ["德昌县", "513400"],
            513425: ["会理县", "513400"],
            513426: ["会东县", "513400"],
            513427: ["宁南县", "513400"],
            513428: ["普格县", "513400"],
            513429: ["布拖县", "513400"],
            513430: ["金阳县", "513400"],
            513431: ["昭觉县", "513400"],
            513432: ["喜德县", "513400"],
            513433: ["冕宁县", "513400"],
            513434: ["越西县", "513400"],
            513435: ["甘洛县", "513400"],
            513436: ["美姑县", "513400"],
            513437: ["雷波县", "513400"],
            513438: ["其它区", "513400"],
            52e4: ["贵州省", "1"],
            520100: ["贵阳市", "520000"],
            520102: ["南明区", "520100"],
            520103: ["云岩区", "520100"],
            520111: ["花溪区", "520100"],
            520112: ["乌当区", "520100"],
            520113: ["白云区", "520100"],
            520114: ["小河区", "520100"],
            520121: ["开阳县", "520100"],
            520122: ["息烽县", "520100"],
            520123: ["修文县", "520100"],
            520151: ["金阳开发区", "520100"],
            520181: ["清镇市", "520100"],
            520182: ["其它区", "520100"],
            520200: ["六盘水市", "520000"],
            520201: ["钟山区", "520200"],
            520203: ["六枝特区", "520200"],
            520221: ["水城县", "520200"],
            520222: ["盘县", "520200"],
            520223: ["其它区", "520200"],
            520300: ["遵义市", "520000"],
            520302: ["红花岗区", "520300"],
            520303: ["汇川区", "520300"],
            520321: ["遵义县", "520300"],
            520322: ["桐梓县", "520300"],
            520323: ["绥阳县", "520300"],
            520324: ["正安县", "520300"],
            520325: ["道真仡佬族苗族自治县", "520300"],
            520326: ["务川仡佬族苗族自治县", "520300"],
            520327: ["凤冈县", "520300"],
            520328: ["湄潭县", "520300"],
            520329: ["余庆县", "520300"],
            520330: ["习水县", "520300"],
            520381: ["赤水市", "520300"],
            520382: ["仁怀市", "520300"],
            520383: ["其它区", "520300"],
            520400: ["安顺市", "520000"],
            520402: ["西秀区", "520400"],
            520421: ["平坝县", "520400"],
            520422: ["普定县", "520400"],
            520423: ["镇宁布依族苗族自治县", "520400"],
            520424: ["关岭布依族苗族自治县", "520400"],
            520425: ["紫云苗族布依族自治县", "520400"],
            520426: ["其它区", "520400"],
            522200: ["铜仁地区", "520000"],
            522201: ["铜仁市", "522200"],
            522222: ["江口县", "522200"],
            522223: ["玉屏侗族自治县", "522200"],
            522224: ["石阡县", "522200"],
            522225: ["思南县", "522200"],
            522226: ["印江土家族苗族自治县", "522200"],
            522227: ["德江县", "522200"],
            522228: ["沿河土家族自治县", "522200"],
            522229: ["松桃苗族自治县", "522200"],
            522230: ["万山特区", "522200"],
            522231: ["其它区", "522200"],
            522300: ["黔西南布依族苗族自治州", "520000"],
            522301: ["兴义市", "522300"],
            522322: ["兴仁县", "522300"],
            522323: ["普安县", "522300"],
            522324: ["晴隆县", "522300"],
            522325: ["贞丰县", "522300"],
            522326: ["望谟县", "522300"],
            522327: ["册亨县", "522300"],
            522328: ["安龙县", "522300"],
            522329: ["其它区", "522300"],
            522400: ["毕节地区", "520000"],
            522401: ["毕节市", "522400"],
            522422: ["大方县", "522400"],
            522423: ["黔西县", "522400"],
            522424: ["金沙县", "522400"],
            522425: ["织金县", "522400"],
            522426: ["纳雍县", "522400"],
            522427: ["威宁彝族回族苗族自治县", "522400"],
            522428: ["赫章县", "522400"],
            522429: ["其它区", "522400"],
            522600: ["黔东南苗族侗族自治州", "520000"],
            522601: ["凯里市", "522600"],
            522622: ["黄平县", "522600"],
            522623: ["施秉县", "522600"],
            522624: ["三穗县", "522600"],
            522625: ["镇远县", "522600"],
            522626: ["岑巩县", "522600"],
            522627: ["天柱县", "522600"],
            522628: ["锦屏县", "522600"],
            522629: ["剑河县", "522600"],
            522630: ["台江县", "522600"],
            522631: ["黎平县", "522600"],
            522632: ["榕江县", "522600"],
            522633: ["从江县", "522600"],
            522634: ["雷山县", "522600"],
            522635: ["麻江县", "522600"],
            522636: ["丹寨县", "522600"],
            522637: ["其它区", "522600"],
            522700: ["黔南布依族苗族自治州", "520000"],
            522701: ["都匀市", "522700"],
            522702: ["福泉市", "522700"],
            522722: ["荔波县", "522700"],
            522723: ["贵定县", "522700"],
            522725: ["瓮安县", "522700"],
            522726: ["独山县", "522700"],
            522727: ["平塘县", "522700"],
            522728: ["罗甸县", "522700"],
            522729: ["长顺县", "522700"],
            522730: ["龙里县", "522700"],
            522731: ["惠水县", "522700"],
            522732: ["三都水族自治县", "522700"],
            522733: ["其它区", "522700"],
            53e4: ["云南省", "1"],
            530100: ["昆明市", "530000"],
            530102: ["五华区", "530100"],
            530103: ["盘龙区", "530100"],
            530111: ["官渡区", "530100"],
            530112: ["西山区", "530100"],
            530113: ["东川区", "530100"],
            530121: ["呈贡县", "530100"],
            530122: ["晋宁县", "530100"],
            530124: ["富民县", "530100"],
            530125: ["宜良县", "530100"],
            530126: ["石林彝族自治县", "530100"],
            530127: ["嵩明县", "530100"],
            530128: ["禄劝彝族苗族自治县", "530100"],
            530129: ["寻甸回族彝族自治县", "530100"],
            530181: ["安宁市", "530100"],
            530182: ["其它区", "530100"],
            530300: ["曲靖市", "530000"],
            530302: ["麒麟区", "530300"],
            530321: ["马龙县", "530300"],
            530322: ["陆良县", "530300"],
            530323: ["师宗县", "530300"],
            530324: ["罗平县", "530300"],
            530325: ["富源县", "530300"],
            530326: ["会泽县", "530300"],
            530328: ["沾益县", "530300"],
            530381: ["宣威市", "530300"],
            530382: ["其它区", "530300"],
            530400: ["玉溪市", "530000"],
            530402: ["红塔区", "530400"],
            530421: ["江川县", "530400"],
            530422: ["澄江县", "530400"],
            530423: ["通海县", "530400"],
            530424: ["华宁县", "530400"],
            530425: ["易门县", "530400"],
            530426: ["峨山彝族自治县", "530400"],
            530427: ["新平彝族傣族自治县", "530400"],
            530428: ["元江哈尼族彝族傣族自治县", "530400"],
            530429: ["其它区", "530400"],
            530500: ["保山市", "530000"],
            530502: ["隆阳区", "530500"],
            530521: ["施甸县", "530500"],
            530522: ["腾冲县", "530500"],
            530523: ["龙陵县", "530500"],
            530524: ["昌宁县", "530500"],
            530525: ["其它区", "530500"],
            530600: ["昭通市", "530000"],
            530602: ["昭阳区", "530600"],
            530621: ["鲁甸县", "530600"],
            530622: ["巧家县", "530600"],
            530623: ["盐津县", "530600"],
            530624: ["大关县", "530600"],
            530625: ["永善县", "530600"],
            530626: ["绥江县", "530600"],
            530627: ["镇雄县", "530600"],
            530628: ["彝良县", "530600"],
            530629: ["威信县", "530600"],
            530630: ["水富县", "530600"],
            530631: ["其它区", "530600"],
            530700: ["丽江市", "530000"],
            530702: ["古城区", "530700"],
            530721: ["玉龙纳西族自治县", "530700"],
            530722: ["永胜县", "530700"],
            530723: ["华坪县", "530700"],
            530724: ["宁蒗彝族自治县", "530700"],
            530725: ["其它区", "530700"],
            530800: ["普洱市", "530000"],
            530802: ["思茅区", "530800"],
            530821: ["宁洱哈尼族彝族自治县", "530800"],
            530822: ["墨江哈尼族自治县", "530800"],
            530823: ["景东彝族自治县", "530800"],
            530824: ["景谷傣族彝族自治县", "530800"],
            530825: ["镇沅彝族哈尼族拉祜族自治县", "530800"],
            530826: ["江城哈尼族彝族自治县", "530800"],
            530827: ["孟连傣族拉祜族佤族自治县", "530800"],
            530828: ["澜沧拉祜族自治县", "530800"],
            530829: ["西盟佤族自治县", "530800"],
            530830: ["其它区", "530800"],
            530900: ["临沧市", "530000"],
            530902: ["临翔区", "530900"],
            530921: ["凤庆县", "530900"],
            530922: ["云县", "530900"],
            530923: ["永德县", "530900"],
            530924: ["镇康县", "530900"],
            530925: ["双江拉祜族佤族布朗族傣族自治县", "530900"],
            530926: ["耿马傣族佤族自治县", "530900"],
            530927: ["沧源佤族自治县", "530900"],
            530928: ["其它区", "530900"],
            532300: ["楚雄彝族自治州", "530000"],
            532301: ["楚雄市", "532300"],
            532322: ["双柏县", "532300"],
            532323: ["牟定县", "532300"],
            532324: ["南华县", "532300"],
            532325: ["姚安县", "532300"],
            532326: ["大姚县", "532300"],
            532327: ["永仁县", "532300"],
            532328: ["元谋县", "532300"],
            532329: ["武定县", "532300"],
            532331: ["禄丰县", "532300"],
            532332: ["其它区", "532300"],
            532500: ["红河哈尼族彝族自治州", "530000"],
            532501: ["个旧市", "532500"],
            532502: ["开远市", "532500"],
            532522: ["蒙自县", "532500"],
            532523: ["屏边苗族自治县", "532500"],
            532524: ["建水县", "532500"],
            532525: ["石屏县", "532500"],
            532526: ["弥勒县", "532500"],
            532527: ["泸西县", "532500"],
            532528: ["元阳县", "532500"],
            532529: ["红河县", "532500"],
            532530: ["金平苗族瑶族傣族自治县", "532500"],
            532531: ["绿春县", "532500"],
            532532: ["河口瑶族自治县", "532500"],
            532533: ["其它区", "532500"],
            532600: ["文山壮族苗族自治州", "530000"],
            532621: ["文山县", "532600"],
            532622: ["砚山县", "532600"],
            532623: ["西畴县", "532600"],
            532624: ["麻栗坡县", "532600"],
            532625: ["马关县", "532600"],
            532626: ["丘北县", "532600"],
            532627: ["广南县", "532600"],
            532628: ["富宁县", "532600"],
            532629: ["其它区", "532600"],
            532800: ["西双版纳傣族自治州", "530000"],
            532801: ["景洪市", "532800"],
            532822: ["勐海县", "532800"],
            532823: ["勐腊县", "532800"],
            532824: ["其它区", "532800"],
            532900: ["大理白族自治州", "530000"],
            532901: ["大理市", "532900"],
            532922: ["漾濞彝族自治县", "532900"],
            532923: ["祥云县", "532900"],
            532924: ["宾川县", "532900"],
            532925: ["弥渡县", "532900"],
            532926: ["南涧彝族自治县", "532900"],
            532927: ["巍山彝族回族自治县", "532900"],
            532928: ["永平县", "532900"],
            532929: ["云龙县", "532900"],
            532930: ["洱源县", "532900"],
            532931: ["剑川县", "532900"],
            532932: ["鹤庆县", "532900"],
            532933: ["其它区", "532900"],
            533100: ["德宏傣族景颇族自治州", "530000"],
            533102: ["瑞丽市", "533100"],
            533103: ["潞西市", "533100"],
            533122: ["梁河县", "533100"],
            533123: ["盈江县", "533100"],
            533124: ["陇川县", "533100"],
            533125: ["其它区", "533100"],
            533300: ["怒江傈僳族自治州", "530000"],
            533321: ["泸水县", "533300"],
            533323: ["福贡县", "533300"],
            533324: ["贡山独龙族怒族自治县", "533300"],
            533325: ["兰坪白族普米族自治县", "533300"],
            533326: ["其它区", "533300"],
            533400: ["迪庆藏族自治州", "530000"],
            533421: ["香格里拉县", "533400"],
            533422: ["德钦县", "533400"],
            533423: ["维西傈僳族自治县", "533400"],
            533424: ["其它区", "533400"],
            54e4: ["西藏自治区", "1"],
            540100: ["拉萨市", "540000"],
            540102: ["城关区", "540100"],
            540121: ["林周县", "540100"],
            540122: ["当雄县", "540100"],
            540123: ["尼木县", "540100"],
            540124: ["曲水县", "540100"],
            540125: ["堆龙德庆县", "540100"],
            540126: ["达孜县", "540100"],
            540127: ["墨竹工卡县", "540100"],
            540128: ["其它区", "540100"],
            542100: ["昌都地区", "540000"],
            542121: ["昌都县", "542100"],
            542122: ["江达县", "542100"],
            542123: ["贡觉县", "542100"],
            542124: ["类乌齐县", "542100"],
            542125: ["丁青县", "542100"],
            542126: ["察雅县", "542100"],
            542127: ["八宿县", "542100"],
            542128: ["左贡县", "542100"],
            542129: ["芒康县", "542100"],
            542132: ["洛隆县", "542100"],
            542133: ["边坝县", "542100"],
            542134: ["其它区", "542100"],
            542200: ["山南地区", "540000"],
            542221: ["乃东县", "542200"],
            542222: ["扎囊县", "542200"],
            542223: ["贡嘎县", "542200"],
            542224: ["桑日县", "542200"],
            542225: ["琼结县", "542200"],
            542226: ["曲松县", "542200"],
            542227: ["措美县", "542200"],
            542228: ["洛扎县", "542200"],
            542229: ["加查县", "542200"],
            542231: ["隆子县", "542200"],
            542232: ["错那县", "542200"],
            542233: ["浪卡子县", "542200"],
            542234: ["其它区", "542200"],
            542300: ["日喀则地区", "540000"],
            542301: ["日喀则市", "542300"],
            542322: ["南木林县", "542300"],
            542323: ["江孜县", "542300"],
            542324: ["定日县", "542300"],
            542325: ["萨迦县", "542300"],
            542326: ["拉孜县", "542300"],
            542327: ["昂仁县", "542300"],
            542328: ["谢通门县", "542300"],
            542329: ["白朗县", "542300"],
            542330: ["仁布县", "542300"],
            542331: ["康马县", "542300"],
            542332: ["定结县", "542300"],
            542333: ["仲巴县", "542300"],
            542334: ["亚东县", "542300"],
            542335: ["吉隆县", "542300"],
            542336: ["聂拉木县", "542300"],
            542337: ["萨嘎县", "542300"],
            542338: ["岗巴县", "542300"],
            542339: ["其它区", "542300"],
            542400: ["那曲地区", "540000"],
            542421: ["那曲县", "542400"],
            542422: ["嘉黎县", "542400"],
            542423: ["比如县", "542400"],
            542424: ["聂荣县", "542400"],
            542425: ["安多县", "542400"],
            542426: ["申扎县", "542400"],
            542427: ["索县", "542400"],
            542428: ["班戈县", "542400"],
            542429: ["巴青县", "542400"],
            542430: ["尼玛县", "542400"],
            542431: ["其它区", "542400"],
            542500: ["阿里地区", "540000"],
            542521: ["普兰县", "542500"],
            542522: ["札达县", "542500"],
            542523: ["噶尔县", "542500"],
            542524: ["日土县", "542500"],
            542525: ["革吉县", "542500"],
            542526: ["改则县", "542500"],
            542527: ["措勤县", "542500"],
            542528: ["其它区", "542500"],
            542600: ["林芝地区", "540000"],
            542621: ["林芝县", "542600"],
            542622: ["工布江达县", "542600"],
            542623: ["米林县", "542600"],
            542624: ["墨脱县", "542600"],
            542625: ["波密县", "542600"],
            542626: ["察隅县", "542600"],
            542627: ["朗县", "542600"],
            542628: ["其它区", "542600"],
            61e4: ["陕西省", "1"],
            610100: ["西安市", "610000"],
            610102: ["新城区", "610100"],
            610103: ["碑林区", "610100"],
            610104: ["莲湖区", "610100"],
            610111: ["灞桥区", "610100"],
            610112: ["未央区", "610100"],
            610113: ["雁塔区", "610100"],
            610114: ["阎良区", "610100"],
            610115: ["临潼区", "610100"],
            610116: ["长安区", "610100"],
            610122: ["蓝田县", "610100"],
            610124: ["周至县", "610100"],
            610125: ["户县", "610100"],
            610126: ["高陵县", "610100"],
            610127: ["其它区", "610100"],
            610200: ["铜川市", "610000"],
            610202: ["王益区", "610200"],
            610203: ["印台区", "610200"],
            610204: ["耀州区", "610200"],
            610222: ["宜君县", "610200"],
            610223: ["其它区", "610200"],
            610300: ["宝鸡市", "610000"],
            610302: ["渭滨区", "610300"],
            610303: ["金台区", "610300"],
            610304: ["陈仓区", "610300"],
            610322: ["凤翔县", "610300"],
            610323: ["岐山县", "610300"],
            610324: ["扶风县", "610300"],
            610326: ["眉县", "610300"],
            610327: ["陇县", "610300"],
            610328: ["千阳县", "610300"],
            610329: ["麟游县", "610300"],
            610330: ["凤县", "610300"],
            610331: ["太白县", "610300"],
            610332: ["其它区", "610300"],
            610400: ["咸阳市", "610000"],
            610402: ["秦都区", "610400"],
            610403: ["杨凌区", "610400"],
            610404: ["渭城区", "610400"],
            610422: ["三原县", "610400"],
            610423: ["泾阳县", "610400"],
            610424: ["乾县", "610400"],
            610425: ["礼泉县", "610400"],
            610426: ["永寿县", "610400"],
            610427: ["彬县", "610400"],
            610428: ["长武县", "610400"],
            610429: ["旬邑县", "610400"],
            610430: ["淳化县", "610400"],
            610431: ["武功县", "610400"],
            610481: ["兴平市", "610400"],
            610482: ["其它区", "610400"],
            610500: ["渭南市", "610000"],
            610502: ["临渭区", "610500"],
            610521: ["华县", "610500"],
            610522: ["潼关县", "610500"],
            610523: ["大荔县", "610500"],
            610524: ["合阳县", "610500"],
            610525: ["澄城县", "610500"],
            610526: ["蒲城县", "610500"],
            610527: ["白水县", "610500"],
            610528: ["富平县", "610500"],
            610581: ["韩城市", "610500"],
            610582: ["华阴市", "610500"],
            610583: ["其它区", "610500"],
            610600: ["延安市", "610000"],
            610602: ["宝塔区", "610600"],
            610621: ["延长县", "610600"],
            610622: ["延川县", "610600"],
            610623: ["子长县", "610600"],
            610624: ["安塞县", "610600"],
            610625: ["志丹县", "610600"],
            610626: ["吴起县", "610600"],
            610627: ["甘泉县", "610600"],
            610628: ["富县", "610600"],
            610629: ["洛川县", "610600"],
            610630: ["宜川县", "610600"],
            610631: ["黄龙县", "610600"],
            610632: ["黄陵县", "610600"],
            610633: ["其它区", "610600"],
            610700: ["汉中市", "610000"],
            610702: ["汉台区", "610700"],
            610721: ["南郑县", "610700"],
            610722: ["城固县", "610700"],
            610723: ["洋县", "610700"],
            610724: ["西乡县", "610700"],
            610725: ["勉县", "610700"],
            610726: ["宁强县", "610700"],
            610727: ["略阳县", "610700"],
            610728: ["镇巴县", "610700"],
            610729: ["留坝县", "610700"],
            610730: ["佛坪县", "610700"],
            610731: ["其它区", "610700"],
            610800: ["榆林市", "610000"],
            610802: ["榆阳区", "610800"],
            610821: ["神木县", "610800"],
            610822: ["府谷县", "610800"],
            610823: ["横山县", "610800"],
            610824: ["靖边县", "610800"],
            610825: ["定边县", "610800"],
            610826: ["绥德县", "610800"],
            610827: ["米脂县", "610800"],
            610828: ["佳县", "610800"],
            610829: ["吴堡县", "610800"],
            610830: ["清涧县", "610800"],
            610831: ["子洲县", "610800"],
            610832: ["其它区", "610800"],
            610900: ["安康市", "610000"],
            610902: ["汉滨区", "610900"],
            610921: ["汉阴县", "610900"],
            610922: ["石泉县", "610900"],
            610923: ["宁陕县", "610900"],
            610924: ["紫阳县", "610900"],
            610925: ["岚皋县", "610900"],
            610926: ["平利县", "610900"],
            610927: ["镇坪县", "610900"],
            610928: ["旬阳县", "610900"],
            610929: ["白河县", "610900"],
            610930: ["其它区", "610900"],
            611e3: ["商洛市", "610000"],
            611002: ["商州区", "611000"],
            611021: ["洛南县", "611000"],
            611022: ["丹凤县", "611000"],
            611023: ["商南县", "611000"],
            611024: ["山阳县", "611000"],
            611025: ["镇安县", "611000"],
            611026: ["柞水县", "611000"],
            611027: ["其它区", "611000"],
            62e4: ["甘肃省", "1"],
            620100: ["兰州市", "620000"],
            620102: ["城关区", "620100"],
            620103: ["七里河区", "620100"],
            620104: ["西固区", "620100"],
            620105: ["安宁区", "620100"],
            620111: ["红古区", "620100"],
            620121: ["永登县", "620100"],
            620122: ["皋兰县", "620100"],
            620123: ["榆中县", "620100"],
            620124: ["其它区", "620100"],
            620200: ["嘉峪关市", "620000"],
            620256: ["雄关区", "620200"],
            620257: ["长城区", "620200"],
            620258: ["镜铁区", "620200"],
            620300: ["金昌市", "620000"],
            620302: ["金川区", "620300"],
            620321: ["永昌县", "620300"],
            620322: ["其它区", "620300"],
            620400: ["白银市", "620000"],
            620402: ["白银区", "620400"],
            620403: ["平川区", "620400"],
            620421: ["靖远县", "620400"],
            620422: ["会宁县", "620400"],
            620423: ["景泰县", "620400"],
            620424: ["其它区", "620400"],
            620500: ["天水市", "620000"],
            620502: ["秦州区", "620500"],
            620503: ["麦积区", "620500"],
            620521: ["清水县", "620500"],
            620522: ["秦安县", "620500"],
            620523: ["甘谷县", "620500"],
            620524: ["武山县", "620500"],
            620525: ["张家川回族自治县", "620500"],
            620526: ["其它区", "620500"],
            620600: ["武威市", "620000"],
            620602: ["凉州区", "620600"],
            620621: ["民勤县", "620600"],
            620622: ["古浪县", "620600"],
            620623: ["天祝藏族自治县", "620600"],
            620624: ["其它区", "620600"],
            620700: ["张掖市", "620000"],
            620702: ["甘州区", "620700"],
            620721: ["肃南裕固族自治县", "620700"],
            620722: ["民乐县", "620700"],
            620723: ["临泽县", "620700"],
            620724: ["高台县", "620700"],
            620725: ["山丹县", "620700"],
            620726: ["其它区", "620700"],
            620800: ["平凉市", "620000"],
            620802: ["崆峒区", "620800"],
            620821: ["泾川县", "620800"],
            620822: ["灵台县", "620800"],
            620823: ["崇信县", "620800"],
            620824: ["华亭县", "620800"],
            620825: ["庄浪县", "620800"],
            620826: ["静宁县", "620800"],
            620827: ["其它区", "620800"],
            620900: ["酒泉市", "620000"],
            620902: ["肃州区", "620900"],
            620921: ["金塔县", "620900"],
            620922: ["安西县", "620900"],
            620923: ["肃北蒙古族自治县", "620900"],
            620924: ["阿克塞哈萨克族自治县", "620900"],
            620981: ["玉门市", "620900"],
            620982: ["敦煌市", "620900"],
            620983: ["其它区", "620900"],
            621e3: ["庆阳市", "620000"],
            621002: ["西峰区", "621000"],
            621021: ["庆城县", "621000"],
            621022: ["环县", "621000"],
            621023: ["华池县", "621000"],
            621024: ["合水县", "621000"],
            621025: ["正宁县", "621000"],
            621026: ["宁县", "621000"],
            621027: ["镇原县", "621000"],
            621028: ["其它区", "621000"],
            621100: ["定西市", "620000"],
            621102: ["安定区", "621100"],
            621121: ["通渭县", "621100"],
            621122: ["陇西县", "621100"],
            621123: ["渭源县", "621100"],
            621124: ["临洮县", "621100"],
            621125: ["漳县", "621100"],
            621126: ["岷县", "621100"],
            621127: ["其它区", "621100"],
            621200: ["陇南市", "620000"],
            621202: ["武都区", "621200"],
            621221: ["成县", "621200"],
            621222: ["文县", "621200"],
            621223: ["宕昌县", "621200"],
            621224: ["康县", "621200"],
            621225: ["西和县", "621200"],
            621226: ["礼县", "621200"],
            621227: ["徽县", "621200"],
            621228: ["两当县", "621200"],
            621229: ["其它区", "621200"],
            622900: ["临夏回族自治州", "620000"],
            622901: ["临夏市", "622900"],
            622921: ["临夏县", "622900"],
            622922: ["康乐县", "622900"],
            622923: ["永靖县", "622900"],
            622924: ["广河县", "622900"],
            622925: ["和政县", "622900"],
            622926: ["东乡族自治县", "622900"],
            622927: ["积石山保安族东乡族撒拉族自治县", "622900"],
            622928: ["其它区", "622900"],
            623e3: ["甘南藏族自治州", "620000"],
            623001: ["合作市", "623000"],
            623021: ["临潭县", "623000"],
            623022: ["卓尼县", "623000"],
            623023: ["舟曲县", "623000"],
            623024: ["迭部县", "623000"],
            623025: ["玛曲县", "623000"],
            623026: ["碌曲县", "623000"],
            623027: ["夏河县", "623000"],
            623028: ["其它区", "623000"],
            63e4: ["青海省", "1"],
            630100: ["西宁市", "630000"],
            630102: ["城东区", "630100"],
            630103: ["城中区", "630100"],
            630104: ["城西区", "630100"],
            630105: ["城北区", "630100"],
            630121: ["大通回族土族自治县", "630100"],
            630122: ["湟中县", "630100"],
            630123: ["湟源县", "630100"],
            630124: ["其它区", "630100"],
            632100: ["海东地区", "630000"],
            632121: ["平安县", "632100"],
            632122: ["民和回族土族自治县", "632100"],
            632123: ["乐都县", "632100"],
            632126: ["互助土族自治县", "632100"],
            632127: ["化隆回族自治县", "632100"],
            632128: ["循化撒拉族自治县", "632100"],
            632129: ["其它区", "632100"],
            632200: ["海北藏族自治州", "630000"],
            632221: ["门源回族自治县", "632200"],
            632222: ["祁连县", "632200"],
            632223: ["海晏县", "632200"],
            632224: ["刚察县", "632200"],
            632225: ["其它区", "632200"],
            632300: ["黄南藏族自治州", "630000"],
            632321: ["同仁县", "632300"],
            632322: ["尖扎县", "632300"],
            632323: ["泽库县", "632300"],
            632324: ["河南蒙古族自治县", "632300"],
            632325: ["其它区", "632300"],
            632500: ["海南藏族自治州", "630000"],
            632521: ["共和县", "632500"],
            632522: ["同德县", "632500"],
            632523: ["贵德县", "632500"],
            632524: ["兴海县", "632500"],
            632525: ["贵南县", "632500"],
            632526: ["其它区", "632500"],
            632600: ["果洛藏族自治州", "630000"],
            632621: ["玛沁县", "632600"],
            632622: ["班玛县", "632600"],
            632623: ["甘德县", "632600"],
            632624: ["达日县", "632600"],
            632625: ["久治县", "632600"],
            632626: ["玛多县", "632600"],
            632627: ["其它区", "632600"],
            632700: ["玉树藏族自治州", "630000"],
            632721: ["玉树县", "632700"],
            632722: ["杂多县", "632700"],
            632723: ["称多县", "632700"],
            632724: ["治多县", "632700"],
            632725: ["囊谦县", "632700"],
            632726: ["曲麻莱县", "632700"],
            632727: ["其它区", "632700"],
            632800: ["海西蒙古族藏族自治州", "630000"],
            632801: ["格尔木市", "632800"],
            632802: ["德令哈市", "632800"],
            632821: ["乌兰县", "632800"],
            632822: ["都兰县", "632800"],
            632823: ["天峻县", "632800"],
            632824: ["其它区", "632800"],
            64e4: ["宁夏回族自治区", "1"],
            640100: ["银川市", "640000"],
            640104: ["兴庆区", "640100"],
            640105: ["西夏区", "640100"],
            640106: ["金凤区", "640100"],
            640121: ["永宁县", "640100"],
            640122: ["贺兰县", "640100"],
            640181: ["灵武市", "640100"],
            640182: ["其它区", "640100"],
            640200: ["石嘴山市", "640000"],
            640202: ["大武口区", "640200"],
            640205: ["惠农区", "640200"],
            640221: ["平罗县", "640200"],
            640222: ["其它区", "640200"],
            640300: ["吴忠市", "640000"],
            640302: ["利通区", "640300"],
            640303: ["红寺堡区", "640300"],
            640323: ["盐池县", "640300"],
            640324: ["同心县", "640300"],
            640381: ["青铜峡市", "640300"],
            640382: ["其它区", "640300"],
            640400: ["固原市", "640000"],
            640402: ["原州区", "640400"],
            640422: ["西吉县", "640400"],
            640423: ["隆德县", "640400"],
            640424: ["泾源县", "640400"],
            640425: ["彭阳县", "640400"],
            640426: ["其它区", "640400"],
            640500: ["中卫市", "640000"],
            640502: ["沙坡头区", "640500"],
            640521: ["中宁县", "640500"],
            640522: ["海原县", "640500"],
            640523: ["其它区", "640500"],
            65e4: ["新疆维吾尔自治区", "1"],
            650100: ["乌鲁木齐市", "650000"],
            650102: ["天山区", "650100"],
            650103: ["沙依巴克区", "650100"],
            650104: ["新市区", "650100"],
            650105: ["水磨沟区", "650100"],
            650106: ["头屯河区", "650100"],
            650107: ["达坂城区", "650100"],
            650108: ["东山区", "650100"],
            650109: ["米东区", "650100"],
            650121: ["乌鲁木齐县", "650100"],
            650122: ["其它区", "650100"],
            650200: ["克拉玛依市", "650000"],
            650202: ["独山子区", "650200"],
            650203: ["克拉玛依区", "650200"],
            650204: ["白碱滩区", "650200"],
            650205: ["乌尔禾区", "650200"],
            650206: ["其它区", "650200"],
            652100: ["吐鲁番地区", "650000"],
            652101: ["吐鲁番市", "652100"],
            652122: ["鄯善县", "652100"],
            652123: ["托克逊县", "652100"],
            652124: ["其它区", "652100"],
            652200: ["哈密地区", "650000"],
            652201: ["哈密市", "652200"],
            652222: ["巴里坤哈萨克自治县", "652200"],
            652223: ["伊吾县", "652200"],
            652224: ["其它区", "652200"],
            652300: ["昌吉回族自治州", "650000"],
            652301: ["昌吉市", "652300"],
            652302: ["阜康市", "652300"],
            652303: ["米泉市", "652300"],
            652323: ["呼图壁县", "652300"],
            652324: ["玛纳斯县", "652300"],
            652325: ["奇台县", "652300"],
            652327: ["吉木萨尔县", "652300"],
            652328: ["木垒哈萨克自治县", "652300"],
            652329: ["其它区", "652300"],
            652700: ["博尔塔拉蒙古自治州", "650000"],
            652701: ["博乐市", "652700"],
            652722: ["精河县", "652700"],
            652723: ["温泉县", "652700"],
            652724: ["其它区", "652700"],
            652800: ["巴音郭楞蒙古自治州", "650000"],
            652801: ["库尔勒市", "652800"],
            652822: ["轮台县", "652800"],
            652823: ["尉犁县", "652800"],
            652824: ["若羌县", "652800"],
            652825: ["且末县", "652800"],
            652826: ["焉耆回族自治县", "652800"],
            652827: ["和静县", "652800"],
            652828: ["和硕县", "652800"],
            652829: ["博湖县", "652800"],
            652830: ["其它区", "652800"],
            652900: ["阿克苏地区", "650000"],
            652901: ["阿克苏市", "652900"],
            652922: ["温宿县", "652900"],
            652923: ["库车县", "652900"],
            652924: ["沙雅县", "652900"],
            652925: ["新和县", "652900"],
            652926: ["拜城县", "652900"],
            652927: ["乌什县", "652900"],
            652928: ["阿瓦提县", "652900"],
            652929: ["柯坪县", "652900"],
            652930: ["其它区", "652900"],
            653e3: ["克孜勒苏柯尔克孜自治州", "650000"],
            653001: ["阿图什市", "653000"],
            653022: ["阿克陶县", "653000"],
            653023: ["阿合奇县", "653000"],
            653024: ["乌恰县", "653000"],
            653025: ["其它区", "653000"],
            653100: ["喀什地区", "650000"],
            653101: ["喀什市", "653100"],
            653121: ["疏附县", "653100"],
            653122: ["疏勒县", "653100"],
            653123: ["英吉沙县", "653100"],
            653124: ["泽普县", "653100"],
            653125: ["莎车县", "653100"],
            653126: ["叶城县", "653100"],
            653127: ["麦盖提县", "653100"],
            653128: ["岳普湖县", "653100"],
            653129: ["伽师县", "653100"],
            653130: ["巴楚县", "653100"],
            653131: ["塔什库尔干塔吉克自治县", "653100"],
            653132: ["其它区", "653100"],
            653200: ["和田地区", "650000"],
            653201: ["和田市", "653200"],
            653221: ["和田县", "653200"],
            653222: ["墨玉县", "653200"],
            653223: ["皮山县", "653200"],
            653224: ["洛浦县", "653200"],
            653225: ["策勒县", "653200"],
            653226: ["于田县", "653200"],
            653227: ["民丰县", "653200"],
            653228: ["其它区", "653200"],
            654e3: ["伊犁哈萨克自治州", "650000"],
            654002: ["伊宁市", "654000"],
            654003: ["奎屯市", "654000"],
            654021: ["伊宁县", "654000"],
            654022: ["察布查尔锡伯自治县", "654000"],
            654023: ["霍城县", "654000"],
            654024: ["巩留县", "654000"],
            654025: ["新源县", "654000"],
            654026: ["昭苏县", "654000"],
            654027: ["特克斯县", "654000"],
            654028: ["尼勒克县", "654000"],
            654029: ["其它区", "654000"],
            654200: ["塔城地区", "650000"],
            654201: ["塔城市", "654200"],
            654202: ["乌苏市", "654200"],
            654221: ["额敏县", "654200"],
            654223: ["沙湾县", "654200"],
            654224: ["托里县", "654200"],
            654225: ["裕民县", "654200"],
            654226: ["和布克赛尔蒙古自治县", "654200"],
            654227: ["其它区", "654200"],
            654300: ["阿勒泰地区", "650000"],
            654301: ["阿勒泰市", "654300"],
            654321: ["布尔津县", "654300"],
            654322: ["富蕴县", "654300"],
            654323: ["福海县", "654300"],
            654324: ["哈巴河县", "654300"],
            654325: ["青河县", "654300"],
            654326: ["吉木乃县", "654300"],
            654327: ["其它区", "654300"],
            659001: ["石河子市", "650000"],
            659002: ["阿拉尔市", "650000"],
            659003: ["图木舒克市", "650000"],
            659004: ["五家渠市", "650000"],
            71e4: ["台湾省", "1"],
            710100: ["台北市", "710000"],
            710101: ["中正区", "710100"],
            710102: ["大同区", "710100"],
            710103: ["中山区", "710100"],
            710104: ["松山区", "710100"],
            710105: ["大安区", "710100"],
            710106: ["万华区", "710100"],
            710107: ["信义区", "710100"],
            710108: ["士林区", "710100"],
            710109: ["北投区", "710100"],
            710110: ["内湖区", "710100"],
            710111: ["南港区", "710100"],
            710112: ["文山区", "710100"],
            710113: ["其它区", "710100"],
            710200: ["高雄市", "710000"],
            710201: ["新兴区", "710200"],
            710202: ["前金区", "710200"],
            710203: ["芩雅区", "710200"],
            710204: ["盐埕区", "710200"],
            710205: ["鼓山区", "710200"],
            710206: ["旗津区", "710200"],
            710207: ["前镇区", "710200"],
            710208: ["三民区", "710200"],
            710209: ["左营区", "710200"],
            710210: ["楠梓区", "710200"],
            710211: ["小港区", "710200"],
            710212: ["其它区", "710200"],
            710300: ["台南市", "710000"],
            710301: ["中西区", "710300"],
            710302: ["东区", "710300"],
            710303: ["南区", "710300"],
            710304: ["北区", "710300"],
            710305: ["安平区", "710300"],
            710306: ["安南区", "710300"],
            710307: ["其它区", "710300"],
            710400: ["台中市", "710000"],
            710401: ["中区", "710400"],
            710402: ["东区", "710400"],
            710403: ["南区", "710400"],
            710404: ["西区", "710400"],
            710405: ["北区", "710400"],
            710406: ["北屯区", "710400"],
            710407: ["西屯区", "710400"],
            710408: ["南屯区", "710400"],
            710409: ["其它区", "710400"],
            710500: ["金门县", "710000"],
            710600: ["南投县", "710000"],
            710700: ["基隆市", "710000"],
            710701: ["仁爱区", "710700"],
            710702: ["信义区", "710700"],
            710703: ["中正区", "710700"],
            710704: ["中山区", "710700"],
            710705: ["安乐区", "710700"],
            710706: ["暖暖区", "710700"],
            710707: ["七堵区", "710700"],
            710708: ["其它区", "710700"],
            710800: ["新竹市", "710000"],
            710801: ["东区", "710800"],
            710802: ["北区", "710800"],
            710803: ["香山区", "710800"],
            710804: ["其它区", "710800"],
            710900: ["嘉义市", "710000"],
            710901: ["东区", "710900"],
            710902: ["西区", "710900"],
            710903: ["其它区", "710900"],
            711100: ["新北市", "710000"],
            711200: ["宜兰县", "710000"],
            711300: ["新竹县", "710000"],
            711400: ["桃园县", "710000"],
            711500: ["苗栗县", "710000"],
            711700: ["彰化县", "710000"],
            711900: ["嘉义县", "710000"],
            712100: ["云林县", "710000"],
            712400: ["屏东县", "710000"],
            712500: ["台东县", "710000"],
            712600: ["花莲县", "710000"],
            712700: ["澎湖县", "710000"],
            81e4: ["香港特别行政区", "1"],
            810100: ["香港岛", "810000"],
            810101: ["中西区", "810100"],
            810102: ["湾仔", "810100"],
            810103: ["东区", "810100"],
            810104: ["南区", "810100"],
            810200: ["九龙", "810000"],
            810201: ["九龙城区", "810200"],
            810202: ["油尖旺区", "810200"],
            810203: ["深水埗区", "810200"],
            810204: ["黄大仙区", "810200"],
            810205: ["观塘区", "810200"],
            810300: ["新界", "810000"],
            810301: ["北区", "810300"],
            810302: ["大埔区", "810300"],
            810303: ["沙田区", "810300"],
            810304: ["西贡区", "810300"],
            810305: ["元朗区", "810300"],
            810306: ["屯门区", "810300"],
            810307: ["荃湾区", "810300"],
            810308: ["葵青区", "810300"],
            810309: ["离岛区", "810300"],
            82e4: ["澳门特别行政区", "1"],
            820100: ["澳门半岛", "820000"],
            820200: ["离岛", "820000"],
            99e4: ["海外", "1"],
            990100: ["海外", "990000"]
        };
        t.exports = window.AreaData = r
    }
    (t.exports, t, e);
    e.____MODULES["4073076a426d4130d4ef3bbe9d5e7173"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "f72eb7697f0e75bacf54bcc802b4cf71",
        filename: "page.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        function o() {
            return {
                areaData: e.____MODULES["4073076a426d4130d4ef3bbe9d5e7173"],
                paegInfo: "pageInfo"
            }
        }
        function u() {
            return {
                config: "config"
            }
        }
        function a() {
            UserStatus.fresh();
            i.trigger("success.login")
        }
        function f() {
            var e = UserStatus.isLogin();
            pageVisibility.listen(function() {
                if (!pageVisibility.isHidden() && !e && e != UserStatus.isLogin()) {
                    $("#QunarPopBoxClosePop").click();
                    a()
                }
            }
            )
        }
        function l() {
            $("#js_bookingMdloading").addClass("hide");
            $("#js_bookingContent").removeClass("hide")
        }
        function c() {
            var e = window.model.dataModel.originData;
            var t = e.useFlyFund;
            var n = e.sendFlyFund;
            var r = ['<em style="color:#26B3D2;font-size:12px;font-weight:bold;">', "登录即可使用您账号中的飞基金", "</em>"];
            var i = {
                notice: r.join(""),
                skipLogin: {
                    title: ""
                },
                proxy: "/tts/proxy.htm",
                twoWeek: true
            };
            if ((t || n) && !UserStatus.isLogin()) {
                if (n) {
                    r[1] = "登录购买并实际乘坐可获赠飞基金，下次购买指定产品机票立抵现金";
                    i.notice = r.join("");
                    i.skipLogin.title = "非登录用户预订，无法获得飞基金哦"
                }
                QNR.showLoginDia(i)
            }
        }
        var i = e.____MODULES["285adc5af3055e36addfeabe5289c690"];
        var s = $.Deferred();
        s.resolve(o(), u());
        n.exports = s;
        i.on("dataready.page", function(e, t) {
            var n = t.originData;
            var r = n.flightInfo[0];
            UserStatus.NOW = Utils.toDateTime.apply(null , n.serverTime.split(" "));
            UserStatus.DEPART = Utils.toDateTime(r.dd, r.dt);
            UserStatus.CHECKIDTIME = UserStatus.DEPART;
            if (n.roundTrip) {
                var i = n.flightInfo[1];
                UserStatus.CHECKIDTIME = Utils.toDateTime(i.dd, i.dt)
            }
            if (UserStatus.isLogin()) {
                a();
                l()
            } else {
                if (n.forceLogin) {
                    QNR.showLoginDia({
                        callback: function() {
                            a();
                            l()
                        },
                        proxy: "/tts/proxy.htm",
                        twoWeek: true
                    })
                } else {
                    l()
                }
            }
            if (n.packingSuccess) {} else {
                $(".js_pc_servise_phone").hide();
                $(".js_normal_servise_phone").show();
                $(".js_pc_logo").hide();
                $(".js_normal_logo").show();
                $(".js_pc_m_fl_piao").hide();
                $(".js_normal_m_fl_piao").show();
                $(".js_pc_footer").hide();
                $(".js_normal_footer").show()
            }
            f()
        }
        )
    }
    (t.exports, t, e);
    e.____MODULES["f72eb7697f0e75bacf54bcc802b4cf71"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "be6a8dfad769025d30399cf7f7195fea",
        filename: "dataCenter.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        var i = e.____MODULES["285adc5af3055e36addfeabe5289c690"];
        var s = e.____MODULES["312540359c661f626d6031b9f938e9a2"];
        var o = s.create();
        o.fn.initialize = function(e, t) {
            this._name = "BM_DataCenter";
            this._config = e;
            this._defData = t;
            this._bind()
        }
        ;
        o.fn._bind = function() {
            var e = this;
            i.on("load.datacenter", function() {
                e._invoke()
            }
            )
        }
        ;
        o.fn._invoke = function() {
            var e = this;
            var t = this._config.URL.DATA_URL;
            var n = this._urlParams();
            if (n["starttime"]) {
                n["starttime"] = n["starttime"].replace(/-/g, "")
            }
            if (n["returntime"]) {
                n["returntime"] = n["returntime"].replace(/-/g, "")
            }
            i.trigger("LOG4J.info", ["开始获取数据，接口地址：", t, "；参数：", $.param(n)]);
            var r = $.ajax({
                type: "GET",
                url: t,
                data: n,
                cache: false,
                dataType: "json",
                timeout: 150 * 1e3
            });
            r.done(function(t) {
                i.trigger("LOG4J.info", ["数据返回，ret为:", t.ret]);
                if (t && t.ret === 1) {
                    if (t.extInfo && !$.isEmptyObject(t.extInfo)) {
                        e._urlDecrypt(t.extInfo);
                        t = $.extend(t, {
                            urlInfo: t.extInfo
                        })
                    } else {
                        t = $.extend(t, {
                            urlInfo: n
                        })
                    }
                    var r = t.urlInfo.tag;
                    if (t.urlInfo.flight_type === "2") {
                        if (r && ~r.indexOf("I") || !r) {
                            t.urlInfo.prt = "1";
                            if (t.extInfo) {
                                t.extInfo.prt = "1"
                            }
                        }
                    }
                    e._fixHefeiAirport(t);
                    e._defData.resolve(t)
                } else {
                    i.trigger("loaderror.datacenter", obj = t || null );
                    e._defData.reject(obj)
                }
            }
            );
            r.fail(function(t) {
                i.trigger("loaderror.datacenter", t);
                e._defData.reject(t)
            }
            )
        }
        ;
        o.fn._urlDecrypt = function(e) {
            if (e["starttime"]) {
                e["starttime"] = e["starttime"].replace(/-/g, "")
            }
            if (e["returntime"]) {
                e["returntime"] = e["returntime"].replace(/-/g, "")
            }
        }
        ;
        o.fn._data = function(e) {
            function t() {}
            e.roundTrip = e.flightInfo.length > 1;
            i.trigger("LOG4J.info", ["航程类型:", e.roundTrip ? "往返" : "单程"]);
            $.extend(t.prototype, {
                data: function() {
                    return $.extend(true, {}, e, {
                        originData: e
                    })
                }
            });
            var n = (new t).data();
            this._defData.resolve(n)
        }
        ;
        o.fn._fixHefeiAirport = function(e) {
            function n(e, t) {
                var n = (new Date("2013/5/30")).getTime();
                var e = (new Date(e.replace(/-/g, "/"))).getTime();
                if (e >= n && t === "骆岗机场") {
                    t = "新桥机场"
                }
                return t
            }
            var t = e.flightInfo;
            $.each(t, function(e, t) {
                t.aa = n(t.ad, t.aa);
                t.da = n(t.dd, t.da)
            }
            )
        }
        ;
        o.fn._urlParams = function() {
            var e = {};
            var t = window.location.search.replace("?", "");
            var n = t.split("&");
            $.each(n, function(t, n) {
                var r = n.split("=");
                var i = r[0]
                  , s = r[1];
                e[i] = s || ""
            }
            );
            return e
        }
        ;
        n.exports = o
    }
    (t.exports, t, e);
    e.____MODULES["be6a8dfad769025d30399cf7f7195fea"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "34b2639e1eb69b25d8828d4e5c7e01f3",
        filename: "config.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(e, t, n) {
        t.exports = {
            URL: {
                DATA_URL: "/s/api/web/trade/book_info.php"
            }
        }
    }
    (t.exports, t, e);
    e.____MODULES["34b2639e1eb69b25d8828d4e5c7e01f3"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "cb61dad8a0292fc704d2812c59067e2a",
        filename: "index.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        var i = e.____MODULES["285adc5af3055e36addfeabe5289c690"];
        var s = e.____MODULES["f72eb7697f0e75bacf54bcc802b4cf71"];
        var o = $.Deferred();
        s.done(function(t, n) {
            var r = e.____MODULES["be6a8dfad769025d30399cf7f7195fea"];
            var s = e.____MODULES["34b2639e1eb69b25d8828d4e5c7e01f3"];
            var u = new r(s,o);
            i.trigger("load.datacenter")
        }
        );
        n.exports = o.promise()
    }
    (t.exports, t, e);
    e.____MODULES["cb61dad8a0292fc704d2812c59067e2a"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "57cdcc7110ade8a32a1a21345a56e4ab",
        filename: "pageVisibility.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(e, t, n) {
        window.pageVisibility = function() {
            function i() {
                if (e) {
                    return document[e]
                }
                return t
            }
            function s() {
                if (!e) {
                    a("focus", function() {
                        t = false;
                        o()
                    }
                    );
                    a("blur", function() {
                        t = true;
                        o()
                    }
                    )
                } else {
                    document.addEventListener(n + "visibilitychange", o, false)
                }
            }
            function o() {
                for (var e = 0, t = r.length; e < t; e++) {
                    r[e]()
                }
            }
            function u() {
                var t = ["hidden", "webkitHidden", "mozHidden", "msHidden", "oHidden"];
                for (var r = 0, i = t.length; r < i; r++) {
                    e = t[r];
                    if (e in document) {
                        n = e.slice(0, -6);
                        break
                    } else {
                        e = ""
                    }
                }
            }
            function a(e, t) {
                if (window.attachEvent) {
                    window.attachEvent("on" + e, t)
                } else if (window.addEventListener) {
                    window.addEventListener(e, t, false)
                }
            }
            var e = "";
            var t = false;
            var n = "";
            var r = [];
            u();
            s();
            return {
                isHidden: i,
                listen: function(e) {
                    r.push(e)
                }
            }
        }
        ()
    }
    (t.exports, t, e);
    e.____MODULES["57cdcc7110ade8a32a1a21345a56e4ab"] = t.exports
}
)(this);
(function(__context) {
    var module = {
        id: "ed363c2895983ed5ec86a2f6ef0f3113",
        filename: "json2.js",
        exports: {}
    };
    if (!__context.____MODULES) {
        __context.____MODULES = {}
    }
    var r = function(exports, module, global) {
        if (!window.JSON) {
            JSON = window.JSON = {}
        }
        (function() {
            "use strict";
            function f(e) {
                return e < 10 ? "0" + e : e
            }
            function quote(e) {
                escapable.lastIndex = 0;
                return escapable.test(e) ? '"' + e.replace(escapable, function(e) {
                    var t = meta[e];
                    return typeof t === "string" ? t : "\\u" + ("0000" + e.charCodeAt(0).toString(16)).slice(-4)
                }
                ) + '"' : '"' + e + '"'
            }
            function str(e, t) {
                var n, r, i, s, o = gap, u, a = t[e];
                if (a && typeof a === "object" && typeof a.toJSON === "function") {
                    a = a.toJSON(e)
                }
                if (typeof rep === "function") {
                    a = rep.call(t, e, a)
                }
                switch (typeof a) {
                case "string":
                    return quote(a);
                case "number":
                    return isFinite(a) ? String(a) : "null";
                case "boolean":
                case "null":
                    return String(a);
                case "object":
                    if (!a) {
                        return "null"
                    }
                    gap += indent;
                    u = [];
                    if (Object.prototype.toString.apply(a) === "[object Array]") {
                        s = a.length;
                        for (n = 0; n < s; n += 1) {
                            u[n] = str(n, a) || "null"
                        }
                        i = u.length === 0 ? "[]" : gap ? "[\n" + gap + u.join(",\n" + gap) + "\n" + o + "]" : "[" + u.join(",") + "]";
                        gap = o;
                        return i
                    }
                    if (rep && typeof rep === "object") {
                        s = rep.length;
                        for (n = 0; n < s; n += 1) {
                            if (typeof rep[n] === "string") {
                                r = rep[n];
                                i = str(r, a);
                                if (i) {
                                    u.push(quote(r) + (gap ? ": " : ":") + i)
                                }
                            }
                        }
                    } else {
                        for (r in a) {
                            if (Object.prototype.hasOwnProperty.call(a, r)) {
                                i = str(r, a);
                                if (i) {
                                    u.push(quote(r) + (gap ? ": " : ":") + i)
                                }
                            }
                        }
                    }
                    i = u.length === 0 ? "{}" : gap ? "{\n" + gap + u.join(",\n" + gap) + "\n" + o + "}" : "{" + u.join(",") + "}";
                    gap = o;
                    return i
                }
            }
            if (typeof Date.prototype.toJSON !== "function") {
                Date.prototype.toJSON = function(e) {
                    return isFinite(this.valueOf()) ? this.getUTCFullYear() + "-" + f(this.getUTCMonth() + 1) + "-" + f(this.getUTCDate()) + "T" + f(this.getUTCHours()) + ":" + f(this.getUTCMinutes()) + ":" + f(this.getUTCSeconds()) + "Z" : null 
                }
                ;
                String.prototype.toJSON = Number.prototype.toJSON = Boolean.prototype.toJSON = function(e) {
                    return this.valueOf()
                }
            }
            var cx = /[\u0000\u00ad\u0600-\u0604\u070f\u17b4\u17b5\u200c-\u200f\u2028-\u202f\u2060-\u206f\ufeff\ufff0-\uffff]/g, escapable = /[\\\"\x00-\x1f\x7f-\x9f\u00ad\u0600-\u0604\u070f\u17b4\u17b5\u200c-\u200f\u2028-\u202f\u2060-\u206f\ufeff\ufff0-\uffff]/g, gap, indent, meta = {
                "\b": "\\b",
                " ": "\\t",
                "\n": "\\n",
                "\f": "\\f",
                "\r": "\\r",
                '"': '\\"',
                "\\": "\\\\"
            }, rep;
            if (typeof JSON.stringify !== "function") {
                JSON.stringify = function(e, t, n) {
                    var r;
                    gap = "";
                    indent = "";
                    if (typeof n === "number") {
                        for (r = 0; r < n; r += 1) {
                            indent += " "
                        }
                    } else if (typeof n === "string") {
                        indent = n
                    }
                    rep = t;
                    if (t && typeof t !== "function" && (typeof t !== "object" || typeof t.length !== "number")) {
                        throw new Error("JSON.stringify")
                    }
                    return str("", {
                        "": e
                    })
                }
            }
            if (typeof JSON.parse !== "function") {
                JSON.parse = function(text, reviver) {
                    function walk(e, t) {
                        var n, r, i = e[t];
                        if (i && typeof i === "object") {
                            for (n in i) {
                                if (Object.prototype.hasOwnProperty.call(i, n)) {
                                    r = walk(i, n);
                                    if (r !== undefined) {
                                        i[n] = r
                                    } else {
                                        delete i[n]
                                    }
                                }
                            }
                        }
                        return reviver.call(e, t, i)
                    }
                    var j;
                    text = String(text);
                    cx.lastIndex = 0;
                    if (cx.test(text)) {
                        text = text.replace(cx, function(e) {
                            return "\\u" + ("0000" + e.charCodeAt(0).toString(16)).slice(-4)
                        }
                        )
                    }
                    if (/^[\],:{}\s]*$/.test(text.replace(/\\(?:["\\\/bfnrt]|u[0-9a-fA-F]{4})/g, "@").replace(/"[^"\\\n\r]*"|true|false|null|-?\d+(?:\.\d*)?(?:[eE][+\-]?\d+)?/g, "]").replace(/(?:^|:|,)(?:\s*\[)+/g, ""))) {
                        j = eval("(" + text + ")");
                        return typeof reviver === "function" ? walk({
                            "": j
                        }, "") : j
                    }
                    throw new SyntaxError("JSON.parse")
                }
            }
        }
        )()
    }
    (module.exports, module, __context);
    __context.____MODULES["ed363c2895983ed5ec86a2f6ef0f3113"] = module.exports
}
)(this);
(function(e) {
    var t = {
        id: "ca01f3c708c85165711b9e6acfc1add6",
        filename: "MODEL.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(e, t, n) {
        if (!window.model) {
            window.model = {
                autoRun: [],
                dataModel: {},
                errs: []
            }
        }
    }
    (t.exports, t, e);
    e.____MODULES["ca01f3c708c85165711b9e6acfc1add6"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "fb1f09b371084164351ecbe7c8ebfd62",
        filename: "QNR.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(e, t, n) {
        if (typeof window.QNR === "undefined") {
            window.QNR = {}
        }
    }
    (t.exports, t, e);
    e.____MODULES["fb1f09b371084164351ecbe7c8ebfd62"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "db27d266a7f8f73b8f914fe58f71627c",
        filename: "crossdomainpost.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(e, t, n) {
        if (typeof window.QNR === "undefined") {
            window.QNR = {}
        }
        (function(e) {
            "use strict";
            function c(e) {
                return r.getElementById(e)
            }
            function h(e) {
                var t = [];
                e = e || {};
                if (typeof e === "string") {
                    t = e.split("&")
                } else {
                    for (var n in e) {
                        if (e.hasOwnProperty(n)) {
                            t[t.length] = n + "=" + e[n]
                        }
                    }
                }
                for (var r = 0, i = t.length; r < i; r++) {
                    t[r] = t[r].replace(/"/g, "&quot;")
                }
                return t
            }
            function p(t) {
                if (!d(t.origin)) {
                    return
                }
                var n = t.data
                  , r = n.split("::")
                  , i = {};
                i.d = r[3];
                i.m = r[2];
                i.f = r[1];
                i.p = r[0];
                i.m = (new Function("return " + i.m))();
                var s = e
                  , o = null 
                  , u = i.f.split(".");
                while (u.length) {
                    o = s;
                    s = o[u.shift()]
                }
                if (typeof s === "function") {
                    s.call(o, i.m)
                }
            }
            function d(e) {
                for (var t = 0, n = i.length; t < n; t++) {
                    if (i[t].indexOf(e) >= 0) {
                        return true
                    }
                }
                return false
            }
            function v(e) {
                var n = t.port === "80" ? "" : t.port;
                return t.protocol + "//" + (e || t.hostname) + (n ? ":" + n : "")
            }
            function m(e, t, n, r, i, s) {
                var o = []
                  , a = [];
                var f = g(e, t, r, s)
                  , l = "ifr" + i
                  , c = "form" + i;
                o[o.length] = '<form id="' + c + '" target="' + l + '" action="' + f + '" method="POST">';
                for (var h = 0, p = n.length; h < p; h++) {
                    a = n[h].split("=");
                    o[o.length] = '<input type="text" name="' + a[0] + '" value="' + a[1] + '" />'
                }
                o[o.length] = "</form>";
                o[o.length] = '<iframe name="' + l + '" id="' + l + '" src="' + u + '"></iframe>';
                return o.join("")
            }
            function g(e, t, i, s) {
                var u = n
                  , c = e.replace(a, "")
                  , h = e.match(f)
                  , p = e.match(l)
                  , d = [c];
                h = h ? h[0] : "#";
                p = p ? p[0] : "?";
                if (p.replace(/\?/g, "").length) {
                    p += "&"
                }
                p += "_=" + (new Date).getTime();
                d[d.length] = p;
                if (h.replace(/#/g, "").length) {
                    h += "&"
                }
                d[d.length] = h;
                d[d.length] = "crosspath=" + encodeURIComponent(v(u) + "/" + t);
                d[d.length] = "&";
                d[d.length] = "crosscall=" + encodeURIComponent(i);
                if (r.domain !== u) {
                    d[d.length] = "&crossdomain=" + encodeURIComponent(r.domain)
                }
                if (s && o) {
                    s = 2
                }
                d[d.length] = "&type=" + s;
                return d.join("")
            }
            var t = e.location
              , n = t.hostname
              , r = e.document
              , i = []
              , s = t.search.indexOf("debug=cross=debug") > 0
              , o = !!e.postMessage && !~t.search.indexOf("debug=cross=name")
              , u = "about:blank"
              , a = /[#\?].*/
              , f = /#.+/
              , l = /\?[^#\s]+/;
            if (o) {
                if (e.addEventListener) {
                    e.addEventListener("message", p, false)
                } else {
                    e.attachEvent("onmessage", p)
                }
            }
            QNR.crossDomainPost = function(e, t, n, o) {
                if (!e) {
                    return
                }
                o = o || {};
                t = h(t);
                var a = o.type || 0;
                if (o.blank) {
                    u = o.blank;
                    if (u.indexOf("http") !== 0) {
                        u = v() + "/" + u
                    }
                }
                var f = o.timeout || 0
                  , l = "crossDomainPost" + (new Date).getTime()
                  , p = false;
                var d = function() {
                    if (p) {
                        return
                    }
                    if (o.ontimeout) {
                        o.ontimeout()
                    }
                    y()
                }
                ;
                var g = function(e) {
                    if (p) {
                        return
                    }
                    if (o.onsuccess) {
                        o.onsuccess(e)
                    }
                    y()
                }
                ;
                var y = function() {
                    var e = c(l);
                    e.parentNode.removeChild(e);
                    p = true;
                    delete QNR.crossDomainPost[l]
                }
                ;
                QNR.crossDomainPost[l] = g;
                var b = m(e, n, t, "QNR.crossDomainPost." + l, l, a)
                  , w = r.createElement("div");
                w.style.display = "none";
                w.id = l;
                w.innerHTML = b;
                r.body.appendChild(w);
                i.push(e);
                if (s) {
                    c("ifr" + l).src = c("form" + l).action
                } else {
                    c("form" + l).submit()
                }
                if (f) {
                    setTimeout(d, f)
                }
            }
        }
        )(this)
    }
    (t.exports, t, e);
    e.____MODULES["db27d266a7f8f73b8f914fe58f71627c"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "c6dbf6ff3d90430844986c61a4c40a1d",
        filename: "PhoneCode.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(e, t, n) {
        function s(e) {
            var t = this
              , n = e.sendButton
              , i = e.disableClass
              , s = e.remainTime || r
              , u = e.remainHtml;
            n.addClass(i).html(u.replace("$remainTime", s));
            t.timeGo = setInterval(function() {
                if (s > 0) {
                    n.html(u.replace("$remainTime", s));
                    s--
                } else {
                    o(e);
                    t.clr()
                }
            }
            , 1e3)
        }
        function o(e) {
            var t = e.sendButton
              , n = e.disableClass
              , r = e.regetHtml;
            t.removeClass(n).html(r)
        }
        function u(e) {
            var t = this
              , n = t.isSend
              , r = e.faild || i
              , o = e.succeed || i
              , u = e.url
              , a = e.param
              , f = e.dataType || "jsonp"
              , l = e.method || "GET";
            if (n)
                return false;
            var c = function(e) {
                e = e || {};
                if (!e.ret) {
                    r(e);
                    return
                }
                o(e)
            }
            ;
            $.ajax({
                url: u,
                dataType: f,
                type: l,
                data: a,
                success: c,
                error: function() {
                    c()
                }
            });
            s.call(t, e);
            t.isSend = true
        }
        var r = 59;
        var i = function() {}
        ;
        var a = function() {
            this.conf = {};
            this.isSend = false;
            this.timeGo = null 
        }
        ;
        $.extend(a.prototype, {
            init: function(e) {
                this.conf = e;
                return this
            },
            send: function(e) {
                var t = $.extend(true, {}, this.conf, e);
                if (!t.url)
                    return;
                u.call(this, t)
            },
            clr: function() {
                var e = this.timeGo;
                if (e) {
                    clearInterval(e)
                }
                this.isSend = false
            }
        });
        n.PhoneCode = a
    }
    (t.exports, t, e);
    e.____MODULES["c6dbf6ff3d90430844986c61a4c40a1d"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "f91b4ec53ef3b5fafbc6aad4f6ec0466",
        filename: "CommonUserStatus.mustache",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(e, t, n) {
        if (typeof window.QTMPL === "undefined")
            window.QTMPL = {};
        window.QTMPL["CommonUserStatus"] = new window.Hogan.Template(function(e, t, n) {
            var r = this;
            r.b(n = n || "");
            if (r.s(r.f("isLogin", e, t, 1), e, t, 0, 12, 177, "{{ }}")) {
                r.rs(e, t, function(e, t, r) {
                    r.b("<li>");
                    r.b(r.v(r.f("username", e, t, 0)));
                    r.b("</li>");
                    r.b("\n" + n);
                    r.b('<li><a href="http://user.qunar.com/passport/logout.jsp?ret=');
                    r.b(r.t(r.f("location", e, t, 0)));
                    r.b("&amp;ttsname=");
                    r.b(r.t(r.f("domain", e, t, 0)));
                    r.b('" title="退出" data-type="logout">退出</a></li>');
                    r.b("\n")
                }
                );
                e.pop()
            }
            if (!r.s(r.f("isLogin", e, t, 1), e, t, 1, 0, 0, "")) {
                r.b('<li><a href="http://user.qunar.com/passport/login.jsp?ret=');
                r.b(r.t(r.f("location", e, t, 0)));
                r.b("&amp;ttsname=");
                r.b(r.t(r.f("domain", e, t, 0)));
                r.b('" title="登录" data-type="login">登录</a></li>');
                r.b("\n" + n);
                r.b('<li><a href="http://user.qunar.com/passport/register.jsp?ret=');
                r.b(r.t(r.f("location", e, t, 0)));
                r.b("&amp;ttsname=");
                r.b(r.t(r.f("domain", e, t, 0)));
                r.b('" title="注册" data-type="regist">注册</a></li>');
                r.b("\n")
            }
            r.b('<li><a href="http://user.qunar.com/flight_toolbox.jsp?catalog=ownorders" title="我的订单" data-type="my-order">我的订单</a></li>');
            r.b("\n" + n);
            r.b('<li><a href="http://www.qunar.com/site/zh/AboutBooking_10.shtml" title="服务中心" target="_blank" data-type="service-center">服务中心</a></li>');
            return r.fl();
        }
        );
        if (typeof t !== "undefined")
            t.exports = window.QTMPL["CommonUserStatus"]
    }
    (t.exports, t, e);
    e.____MODULES["f91b4ec53ef3b5fafbc6aad4f6ec0466"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "fe7f6fdb93582579849997cadec97f2a",
        filename: "userStatus.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        function s(e) {
            return $("#" + e)
        }
        e.____MODULES["f91b4ec53ef3b5fafbc6aad4f6ec0466"];
        var i = {};
        i._expires = null ;
        i.getCookie = function(e) {
            var t = document.cookie.split("; "), n;
            for (var r = 0, i = t.length; r < i; r++) {
                n = t[r] && t[r].split("=");
                if (decodeURIComponent(n[0]) === e) {
                    return decodeURIComponent(n[1] || "")
                }
            }
            return null 
        }
        ;
        i.isLogin = function() {
            var e = SERVER_TIME
              , t = i.getCookie("_t")
              , n = t ? t * 60 * 1e3 : t;
            if (n && n + 12096e5 < e) {
                i._expires = true;
                if (i._expires) {
                    setTimeout(function() {
                        var e = new Image;
                        e.src = "http://user.qunar.com/webApi/forcelogout.jsp?format=js&__" + Math.random()
                    }
                    , 0)
                }
            } else {
                i._expires = false
            }
            return !i._expires && !!i.getCookie("_t") && !!i.getCookie("_q") || i.getCookie("QN42")
        }
        ;
        i._getinfo = function() {
            var e = {};
            var t = "";
            var n = "";
            var r = i.getCookie("QN16");
            var s = i.getCookie("QN42");
            var o = i.getCookie("QN15");
            if (typeof r !== "undefined") {
                switch (r) {
                case "1":
                    t = i._getQunarNickName();
                    n = i._getQunarUserName();
                    break;
                case "0":
                    t = s;
                    n = o;
                    break;
                default:
                    t = i._getQunarNickName();
                    n = i._getQunarUserName()
                }
            } else {
                t = i._getQunarNickName();
                n = i._getQunarUserName()
            }
            e.displayName = decodeURIComponent(t).replace(/\"/g, "");
            e.username = decodeURIComponent(n).replace(/\"/g, "");
            return e
        }
        ;
        i._getQunarNickName = function() {
            var e = "";
            var t = i.getCookie("_a");
            var n = i.getCookie("QN42");
            if (!n) {
                n = i.getCookie("_q");
                if (n) {
                    n = n.replace("U.", "")
                }
            }
            if (n) {
                if (t) {
                    e = $.trim(n + "(未激活)")
                } else {
                    e = $.trim(n)
                }
            }
            return e
        }
        ,
        i._getQunarUserName = function() {
            var e = "";
            var t = i.getCookie("_q");
            var n = i.getCookie("_a");
            if (t) {
                if (n) {
                    e = $.trim(t.replace("U.", "") + "(未激活)")
                } else {
                    e = $.trim(t.replace("U.", ""))
                }
            }
            return e
        }
        ,
        i.fresh = function() {
            var e = {};
            var t = i._getinfo();
            if (i.isLogin()) {
                e.isLogin = true;
                e.username = t.displayName
            } else {
                e.isLogin = false
            }
            var n = $("#this_page_url").val();
            e.location = encodeURIComponent(n == null  ? location.href : n);
            e.domain = encodeURIComponent(location.hostname);
            var r = window.QTMPL.CommonUserStatus.render(e);
            $("#login_status").html(r)
        }
        ;
        i.fresh();
        n.exports = r.UserStatus = i
    }
    (t.exports, t, e);
    e.____MODULES["fe7f6fdb93582579849997cadec97f2a"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "99224d03bf7a32d30a4e3b483e38a7fe",
        filename: "util.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(e, t, n) {
        function i(e) {
            var t = r.resolveIdentityCard(e);
            if (!t) {
                return e
            }
            if (e.length === 18) {
                return e.replace(/^(\d{4})\d{11}(\d{2}[\da-z])$/i, "$1***********$2")
            } else if (e.length === 15) {
                return e.replace(/^(\d{4})\d{8}(\d{3})$/, "$1********$2")
            }
            return e
        }
        function s(e) {
            var t = e.split("@");
            if (!t[1]) {
                return t[0]
            }
            var n = t[0].replace(/^(...)(.+)$/, function(e, t, n) {
                return t + Array(n.length + 1).join("*")
            }
            );
            return [n, t[1]].join("@")
        }
        if (typeof window.Utils === "undefined") {
            var r = window.Utils = {}
        }
        r.log = function() {
            if (typeof console !== "undefined") {
                try {
                    console.log.apply(console, [].slice.call(arguments))
                } catch (e) {}
            }
        }
        ;
        r.shorterString = function(e, t) {
            var n = (e || "").split("")
              , r = 0
              , i = 0;
            while (r < t && n[i]) {
                if (/[^\x00-\xff]/.test(n[i])) {
                    r += 2
                } else {
                    r++
                }
                i++
            }
            return n[i] ? e.substr(0, i) + "..." : e
        }
        ;
        r.toDateTime = function(e, t) {
            var n = e.split(/[-\/]/)
              , r = parseInt(n[0], 10)
              , i = parseInt(n[1], 10)
              , s = parseInt(n[2], 10);
            t = t || "";
            var o = t.split(/:/)
              , u = parseInt(o[0], 10) || 0
              , a = parseInt(o[1], 10) || 0
              , f = parseInt(o[2], 10) || 0;
            return new Date(r,i - 1,s,u,a,f)
        }
        ;
        r.toDateString = function(e) {
            var t = e.getMonth() + 1
              , n = e.getDate();
            if (t < 10) {
                t = "0" + t
            }
            if (n < 10) {
                n = "0" + n
            }
            return e.getFullYear() + "-" + t + "-" + n
        }
        ;
        r.deptDateis2013 = function(e) {
            var t = UserStatus.CHECKIDTIME.getTime();
            var n = (new Date(2013,0,1)).getTime();
            if (e.length === 15) {
                return t >= n
            } else {
                return false
            }
        }
        ;
        r.resolveIdentityCard = function(e) {
            var t = e.length, n, i, s, o, u;
            if (t === 15) {
                n = e.match(/^(?:\d{6})(\d{2})(\d{2})(\d{2})(?:\d{3})$/);
                if (!n) {
                    return false
                }
                i = parseInt("19" + n[1], 10);
                s = parseInt(n[2], 10);
                o = parseInt(n[3], 10);
                u = e.charAt(t - 1) % 2
            } else if (t === 18) {
                var a = [7, 9, 10, 5, 8, 4, 2, 1, 6, 3, 7, 9, 10, 5, 8, 4, 2]
                  , f = "10X98765432";
                for (var l = 0, c = 0; l < 17; l++) {
                    c += e.charAt(l) * a[l]
                }
                if (f.charAt(c % 11) !== e.charAt(17).toUpperCase()) {
                    return false
                }
                n = e.match(/^(?:\d{6})(\d{4})(\d{2})(\d{2})(?:\d{3})(?:[0-9]|X)$/i);
                if (!n) {
                    return false
                }
                i = parseInt(n[1], 10);
                s = parseInt(n[2], 10);
                o = parseInt(n[3], 10);
                u = e.charAt(t - 2) % 2
            }
            var h = new Date(i,s - 1,o);
            if (i !== h.getFullYear() || s !== h.getMonth() + 1 || o !== h.getDate()) {
                return false
            }
            return {
                gender: u,
                birth: r.toDateString(h)
            }
        }
        ;
        r.treatSensitiveInfo = function(e, t) {
            if (!t) {
                return ""
            }
            switch (String(e)) {
            case "identity":
                return i(t);
            case "email":
                return s(t);
            case "mobile":
                return t.replace(/^(\d{3})\d{4}(\d{4})$/, "$1****$2");
            default:
                return t.replace(/^(..)(.+)(..)$/, function(e, t, n, r) {
                    return t + Array(n.length + 1).join("*") + r
                }
                )
            }
        }
        ;
        t.exports = r
    }
    (t.exports, t, e);
    e.____MODULES["99224d03bf7a32d30a4e3b483e38a7fe"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "7ced76474629932e525c7260a5a07829",
        filename: "dialog_base.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(e, t, n) {
        (function(e) {
            function n(e, t) {
                this._cache = [];
                this._cFn = e
            }
            if (!e.kit)
                e.kit = {};
            if (!e.module)
                e.module = {};
            if (!e.ui)
                e.ui = {};
            var t = function() {
                var t = {}, n;
                var r = function() {
                    if (!n) {
                        n = e('<div style="width: ' + e(document).width() + 'px;margin: 0 auto;height:0;position: relative;z-index: 999999;"></div>');
                        n.insertBefore(e(":first", document.body))
                    }
                }
                ;
                t.offset = function() {
                    r();
                    return n.offset()
                }
                ;
                t.size = function() {
                    r();
                    return [n.width(), e(window).height()]
                }
                ;
                t.getNode = function() {
                    r();
                    return n
                }
                ;
                t.getNodeOffset = function(e) {
                    var n = t.offset()
                      , r = e.offset();
                    return {
                        left: r.left - n.left,
                        top: r.top - n.top
                    }
                }
                ;
                return function() {
                    return t
                }
            }
            ();
            e.module.layer = function(n) {
                var r = t();
                var i = e(n).appendTo(r.getNode()).hide()
                  , s = e("[node-type=inner]", i);
                var o = {}, u = e(o), a;
                o.show = function() {
                    i.show();
                    u.trigger("lay_show");
                    return o
                }
                ;
                o.hide = function() {
                    i.hide();
                    u.trigger("lay_hide");
                    return o
                }
                ;
                o.getOuter = function() {
                    return i
                }
                ;
                o.getInner = function() {
                    return s
                }
                ;
                o.getWrapSize = function() {
                    return r.size()
                }
                ;
                o.getWrapOffset = function(e) {
                    return r.getNodeOffset(e)
                }
                ;
                o.getSize = function(e) {
                    if (e || !a) {
                        a = [i.width(), i.height()]
                    }
                    return a
                }
                ;
                o.getDom = function(t) {
                    return e("[node-type=" + t + "]", i)
                }
                ;
                o.setPosition = function(e) {
                    i.css(e);
                    return o
                }
                ;
                return o
            }
            ;
            n.prototype = {
                constructor: n,
                _create: function() {
                    var e = this._cFn();
                    this._cache.push({
                        store: e,
                        used: true
                    });
                    return e
                },
                getOne: function() {
                    var e = this._cache;
                    for (var t = 0, n = e.length; t < n; t += 1) {
                        if (e[t].used === false) {
                            e[t].used = true;
                            return e[t].store
                        }
                    }
                    return this._create()
                },
                _setStat: function(t, n) {
                    e.each(this._cache, function(e, r) {
                        if (t === r.store) {
                            r.used = n;
                            return false
                        }
                    }
                    )
                },
                setUsed: function(e) {
                    this._setStat(e, true)
                },
                setUnused: function(e) {
                    this._setStat(e, false)
                },
                getLength: function() {
                    return this._cache.length
                }
            };
            e.kit.Reuse = n;
            e.module.dialog = function() {
                return function(t, n) {
                    if (!t)
                        throw "dialog no template";
                    var r, i, s, o, u, a, f, l, c, h;
                    var p = function() {
                        s = e.extend({}, n);
                        r = e.module.layer(t);
                        o = r.getOuter();
                        u = r.getInner();
                        a = r.getDom("close").click(function() {
                            f()
                        }
                        )
                    }
                    ;
                    p();
                    c = r.show;
                    h = r.hide;
                    f = function(e) {
                        if (typeof l === "function" && !e) {
                            if (l() === false) {
                                return false
                            }
                        }
                        i.clearBeforeHideFn();
                        h();
                        return i
                    }
                    ;
                    i = r;
                    i.show = function() {
                        c();
                        return i
                    }
                    ;
                    i.hide = f;
                    i.setMiddle = function() {
                        var t = i.getWrapSize()
                          , n = r.getSize(true)
                          , s = e(window).scrollTop();
                        var o = {
                            top: s + (t[1] - n[1]) / 2,
                            left: (t[0] - n[0]) / 2
                        };
                        if (o.top < s)
                            o.top = s;
                        if (o.left < 0)
                            o.left = 0;
                        return i.setPosition(o)
                    }
                    ;
                    i.setClose = function(e) {
                        a[e ? "show" : "hide"]()
                    }
                    ;
                    i.setContent = function(e) {
                        if (typeof e === "string") {
                            u.html(e)
                        } else {
                            u.append(e)
                        }
                        return i
                    }
                    ;
                    i.clearContent = function() {
                        u.empty();
                        return i
                    }
                    ;
                    i.setBeforeHideFn = function(e) {
                        l = e
                    }
                    ;
                    i.clearBeforeHideFn = function() {
                        l = null 
                    }
                    ;
                    return i
                }
            }
            ();
            e.ui.dialog = function() {
                var t = '<div class="poplayer_box" node-type="outer" style="display:block;left:420px;top:10px;">' + '     <span class="close" node-type="close"></span>' + '     <div class="poplayer_inner" node-type="inner"></div>' + "</div>";
                var n = null ;
                var r = function(e) {
                    e.clearContent();
                    if (n)
                        n.setUnused(e)
                }
                ;
                var i = function() {
                    var n = e.module.dialog(t);
                    e(n).bind("lay_show", function() {
                        e.ui.mask.show()
                    }
                    ).bind("lay_hide", function() {
                        e.ui.mask.hide()
                    }
                    );
                    return n
                }
                ;
                var s = [];
                var o = function(t) {
                    var n = [];
                    e.each(s, function(e, r) {
                        if (r !== t)
                            n.push(r)
                    }
                    );
                    s = n
                }
                ;
                var u = function(t, n) {
                    var r = function() {
                        o(t);
                        if (!n.isHold) {
                            e(t).unbind("lay_hide", r);
                            e(t).unbind("lay_show", i)
                        }
                    }
                    ;
                    var i = function() {
                        s.push(t)
                    }
                    ;
                    e(t).bind("lay_hide", r).bind("lay_show", i)
                }
                ;
                var a = function() {
                    e(document).keydown(function(t) {
                        if (s.length === 0)
                            return;
                        var n = s[s.length - 1];
                        var r = t.keyCode
                          , i = t.target
                          , o = i.nodeName
                          , u = /^input|textarea$/i;
                        var a = e.contains(n.getOuter()[0], i);
                        if (r === 27) {
                            if (!n.isEsc)
                                return;
                            if (u.test(o) && a && i.type !== "button")
                                return;
                            n.hide()
                        } else if (r === 13 || r === 9) {
                            if (!a) {
                                t.preventDefault()
                            }
                        }
                    }
                    )
                }
                ;
                return function(t) {
                    t = e.extend({
                        isEsc: true,
                        isHold: false,
                        closeBtn: true,
                        width: 500
                    }, t || {});
                    var s = t.isHold;
                    if (!n) {
                        a();
                        n = new e.kit.Reuse(i)
                    }
                    var o = n.getOne();
                    o.getInner().css("width", t.width);
                    o.setClose(t.closeBtn);
                    if (!s) {
                        var f = function() {
                            e(o).unbind("lay_hide", f);
                            r(o)
                        }
                        ;
                        e(o).bind("lay_hide", f)
                    }
                    o.isEsc = t.isEsc;
                    u(o, t);
                    return o
                }
            }
            ();
            e.ui.mask = function() {
                function s() {
                    if (i) {
                        t.css({
                            width: e(document).width(),
                            height: Math.max(e(document).height(), e(window).height()),
                            zIndex: 800
                        })
                    } else {
                        t.css({
                            position: "fixed",
                            zIndex: 800
                        })
                    }
                }
                function o() {
                    clearTimeout(r);
                    r = setTimeout(s, 500)
                }
                function u() {
                    if (i) {
                        e(window).bind("resize", o)
                    }
                }
                function a() {
                    e(window).unbind("resize", o)
                }
                function f() {
                    t = e('<div class="poplayer_bg"></div>').appendTo(document.body);
                    s();
                    return t
                }
                var t, n = 0, r, i = e.browser.msie && e.browser.version === "6.0";
                var l = {
                    show: function() {
                        n++;
                        if (n > 1)
                            return;
                        if (!t)
                            f();
                        u();
                        t.show()
                    },
                    hide: function() {
                        if (!t || n <= 0)
                            return;
                        n--;
                        if (n === 0) {
                            a();
                            t.hide()
                        }
                    }
                };
                return l
            }
            ()
        }
        )(jQuery)
    }
    (t.exports, t, e);
    e.____MODULES["7ced76474629932e525c7260a5a07829"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "0e6feb481eef40bd9ce32d02e4c53134",
        filename: "alert.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(e, t, n) {
        (function() {
            function t(t) {
                return e[t] || ""
            }
            function n(e, t, n) {
                if (typeof t !== "string")
                    n = t || {};
                var r = {
                    textLarge: typeof t === "string" ? t : "",
                    textSmall: "",
                    textSmallCls: "relt_errortip",
                    icon: "warn",
                    wrapCls: "relat_tip",
                    btns: [{
                        txt: n.ok_txt || "确定",
                        cls: n.ok_cls || "btn_gray",
                        cbfun: n.ok_call || $.noop
                    }],
                    closeBtn: true
                };
                if (e === "confirm") {
                    r.icon = "question";
                    r.btns.push({
                        txt: n.cancel_txt || "取消",
                        cls: n.cancel_cls || "btn_gray",
                        cbfun: n.cancel_call || $.noop
                    })
                }
                return $.extend(r, n)
            }
            function r(e, r, i) {
                var s, o, u, a;
                s = n(e, r, i || {});
                if (!s.textSmall) {
                    if (s.btns === 0) {
                        s.wrapCls += " ptrbl30"
                    } else {
                        s.wrapCls += " ptl110"
                    }
                }
                var f = ['<div class="' + s.wrapCls + '">', s.textLarge ? '<div class="' + t(s.icon) + '">' + s.textLarge + "</div>" : "", s.textSmall ? '<div class="' + s.textSmallCls + '">' + s.textSmall + "</div>" : "", '<div class="relt_btn" node-type="btns"></div>', "</div>"].join("");
                u = $(f);
                a = $('[node-type="btns"]', u);
                o = $.ui.dialog({
                    closeBtn: s.closeBtn,
                    isEsc: s.isEsc === false ? false : true,
                    width: s.width
                });
                o.setContent(u);
                o.show().setMiddle();
                $.each(s.btns, function(e, t) {
                    $('<button class="' + t.cls + (e > 0 ? " ml13" : "") + '"><b><b>' + t.txt + "</b></b></button>").click(function() {
                        var e = t.cbfun.call(o);
                        if (e !== false)
                            o.hide()
                    }
                    ).appendTo(a)
                }
                );
                if (s.callback)
                    s.callback();
                s = f = u = a = null ;
                return o
            }
            var e = {
                success: "retcoritle",
                warn: "retitle",
                question: "retinruritle",
                loading: "loading",
                question_m: "retitle_s"
            };
            $.ui.alert = function(e, t) {
                return r("alert", e, t)
            }
            ;
            $.ui.confirm = function(e, t) {
                return r("confirm", e, t)
            }
            ;
            $.ui.loadingAlert = function(e, t) {
                t = $.extend({
                    icon: "loading",
                    isEsc: false,
                    closeBtn: false,
                    btns: []
                }, t);
                return $.ui.alert(e || "正在提交中，请稍侯……", t)
            }
        }
        )()
    }
    (t.exports, t, e);
    e.____MODULES["0e6feb481eef40bd9ce32d02e4c53134"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "b0d64d16b71a5381e7fd64dd5f3c1457",
        filename: "iframeDialog.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(e, t, n) {
        (function() {
            function t() {
                var t = $.module.dialog(e);
                $(t).bind("lay_show", function() {
                    $.ui.mask.show()
                }
                ).bind("lay_hide", function() {
                    $.ui.mask.hide()
                }
                );
                return t
            }
            function n(e) {
                if (!e)
                    return;
                var n = t()
                  , r = {};
                var i = $('<iframe id="ifr0" frameborder="0" src="' + e.url + '"></iframe>');
                r.flushSize = function(e, t) {
                    i.css({
                        width: e,
                        height: t
                    });
                    n.setMiddle()
                }
                ;
                n.setContent(i);
                n.show();
                r.close = n.hide;
                r.dia = n;
                var s = e.size;
                if (s) {
                    r.flushSize(s.width, s.height)
                } else {
                    n.setMiddle()
                }
                return r
            }
            var e = '<div node-type="outer" class="poplayer_box">' + '<div node-type="inner">' + "</div>";
            $.ui.iframeDialog = function(e) {
                return n(e)
            }
        }
        )()
    }
    (t.exports, t, e);
    e.____MODULES["b0d64d16b71a5381e7fd64dd5f3c1457"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "66c4b3aaeb260473d8f5835e521cdd75",
        filename: "tooltip.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(e, t, n) {
        (function(e) {
            function t(e, t) {
                if (e) {
                    if (t.className)
                        e.className = t.className;
                    if (t.cssText)
                        e.style.cssText = t.cssText
                }
            }
            function n(e) {
                return {
                    width: e.outerWidth(),
                    height: e.outerHeight()
                }
            }
            e.module.bubble = function(r, i) {
                var s;
                var o, u, a, f, l, c;
                var h = function() {
                    o = e.module.layer(r);
                    a = o.getOuter();
                    f = o.getInner();
                    l = o.getDom("arrow");
                    c = o.getDom("box")
                }
                ;
                h();
                s = o;
                s.setArrow = function(e) {
                    t(l[0], e);
                    return s
                }
                ;
                s.setBox = function(e) {
                    t(c[0], e);
                    return s
                }
                ;
                s.setContent = function(e) {
                    if (typeof e === "string") {
                        f.html(e)
                    } else {
                        f.append(e)
                    }
                    return s
                }
                ;
                s.clearContent = function() {
                    f.empty();
                    return s
                }
                ;
                s.setLayout = function(e, t) {
                    var r = s.getWrapOffset(e)
                      , i = n(e);
                    t = t || {};
                    if (!t.placement)
                        t.placement = "left-bottom";
                    switch (t.placement) {
                    case "left-bottom":
                        break;
                    case "right-bottom":
                        r.left = r.left + i.width - a.width();
                        break
                    }
                    r.top = r.top + i.height + 6;
                    if (t.repair_x)
                        r.left += t.repair_x;
                    if (t.repair_y)
                        r.top += t.repair_y;
                    s.setPosition(r);
                    return s
                }
                ;
                return s
            }
        }
        )(jQuery);
        (function(e) {
            var t = '<div class="blpop_layer" style="display:hide;">' + '   <div class="box blue_layer" node-type="box">' + '       <div class="jt_layer" node-type="arrow"><cite class="bot"></cite><cite class="top"></cite></div>' + '       <div node-type="inner"></div>' + "    </div>" + "</div>";
            var n = null ;
            var r = function(e) {
                e.clearContent();
                if (n)
                    n.setUnused(e)
            }
            ;
            var i = function() {
                var n = e.module.bubble(t);
                n.destroy = function() {
                    r(n);
                    try {
                        n.hide(true)
                    } catch (e) {}
                }
                ;
                return n
            }
            ;
            var s = {
                white: "box",
                blue: "box blue_layer",
                orange: "box orange_layer"
            };
            e.ui.bubble = function(t) {
                var o = e.extend({
                    style: "orange",
                    width: 103,
                    arrow_cls: "jt_layer",
                    arrow_css: "left:13px;"
                }, t || {});
                if (!n) {
                    n = new e.kit.Reuse(i)
                }
                var u = n.getOne();
                var a = function() {
                    e(u).unbind("lay_hide", a);
                    r(u)
                }
                ;
                e(u).bind("lay_hide", a);
                u.setArrow({
                    className: o.arrow_cls,
                    cssText: o.arrow_css
                });
                u.setBox({
                    className: s[o.style],
                    cssText: "width:" + o.width + "px;"
                });
                return u
            }
        }
        )(jQuery);
        (function(e) {
            function t(e) {
                if (typeof e === "string")
                    e = {
                        content: e
                    };
                var t = '<div class="content" >' + e.content + "</div>";
                if (e.title) {
                    t += '<div class="tgq_tip">' + e.title + "</div>"
                }
                return t
            }
            function n(t, n, r) {
                if (!n || !n.length)
                    return;
                var i = r.placement || ""
                  , s = {
                    placement: i,
                    repair_x: r.repair_x || 0,
                    repair_y: r.repair_y || 0
                };
                n.data("bubble_tooltip", t);
                var o = function() {
                    t.setLayout(n, s)
                }
                ;
                var u = function() {
                    n.data("bubble_tooltip", null );
                    e(t).unbind("lay_hide", u)
                }
                ;
                e(t).bind("lay_hide", u);
                o()
            }
            e.ui.tooltip = function(r, i, s) {
                if (e.isPlainObject(i)) {
                    s = i;
                    i = null 
                }
                s = s || {};
                var o = s.placement || "";
                if (!s.arrow_css && /right/.test(o))
                    s.arrow_css = "right:20px;";
                var u = t(r);
                var a = e.ui.bubble(s);
                a.setContent(u);
                a.show();
                n(a, i, s);
                return a
            }
            ;
            e.ui.onlyTooltip = function(t, n, r) {
                var i = n.data("bubble_tooltip");
                if (i)
                    i.hide();
                i = e.ui.tooltip(t, n, r);
                return i
            }
        }
        )(jQuery)
    }
    (t.exports, t, e);
    e.____MODULES["66c4b3aaeb260473d8f5835e521cdd75"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "026dc2c1d423337ae6ca8f16ca6acaa0",
        filename: "jquery.tooltip.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(e, t, n) {
        (function(e) {
            function t(e, t) {
                this.init("tooltip", e, t)
            }
            function n(e, t) {
                this.init("popover", e, t)
            }
            t.prototype = {
                constructor: t,
                init: function(t, n, r) {
                    this.type = t;
                    this.$element = e(n);
                    this.options = this.getOptions(r);
                    this.bindEvent();
                    if (this.options.selector) {
                        this._options = e.extend({}, this.options, {
                            trigger: "manual",
                            selector: ""
                        })
                    }
                },
                bindEvent: function() {
                    var t, n, r, i, s, o = this.$element, u = this.options.trigger;
                    if (u !== "manual") {
                        t = u === "hover" ? "mouseenter" : "focus";
                        n = u === "hover" ? "mouseleave" : "blur";
                        i = e.proxy(this.enter, this);
                        s = e.proxy(this.leave, this);
                        r = this.options.selector;
                        if (r) {
                            o.delegate(r, t, i).delegate(r, n, s)
                        } else {
                            o.bind(t, i).bind(n, s)
                        }
                    }
                },
                getOptions: function(t) {
                    t = e.extend({}, e.fn[this.type].defaults, t);
                    if (t.selector || this.$element.data("selector")) {
                        var n = this.$element.data();
                        e.each(n, function(e, n) {
                            var r = typeof n;
                            if (r === "string" || r === "number") {
                                t[e] = n
                            }
                        }
                        )
                    }
                    if (t.delay && typeof t.delay === "number") {
                        t.delay = {
                            show: t.delay,
                            hide: t.delay
                        }
                    }
                    return t
                },
                enter: function(t) {
                    return this._toggle(e(t.currentTarget), "show")
                },
                leave: function(t) {
                    return this._toggle(e(t.currentTarget), "hide")
                },
                _toggle: function(e, t) {
                    var n = e[this.type](this._options).data(this.type);
                    var r = n.options.delay && n.options.delay[t];
                    if (!r)
                        return n[t]();
                    clearTimeout(n.timeout);
                    n.hoverState = t;
                    n.timeout = setTimeout(function() {
                        if (n.hoverState === t)
                            n[t]()
                    }
                    , r)
                },
                getOpt: function(t) {
                    var n = this.$element
                      , r = this.options;
                    var i = n.data(t) || r[t];
                    if (e.isFunction(i))
                        i = i(n, this);
                    return i
                },
                show: function() {
                    var t = this.$element
                      , n = this.options
                      , r = this;
                    var i = {}
                      , s = {};
                    e.each(["content", "title"], function(e, t) {
                        var n = r.getOpt(t);
                        if (n)
                            i[t] = n
                    }
                    );
                    e.each(["width", "placement", "style", "arrow_cls", "arrow_css", "repair_x", "repair_y"], function(e, t) {
                        var n = r.getOpt(t);
                        if (n)
                            s[t] = n
                    }
                    );
                    e.ui.onlyTooltip(i, t, s)
                },
                hide: function() {
                    var e = this.$element;
                    var t = e.data("bubble_tooltip");
                    if (t)
                        t.hide()
                }
            };
            e.fn.tooltip = function(n) {
                return this.each(function() {
                    var r = e(this)
                      , i = r.data("tooltip")
                      , s = typeof n === "object" && n;
                    if (!i)
                        r.data("tooltip", i = new t(this,s));
                    if (typeof n === "string")
                        i[n]()
                }
                )
            }
            ;
            e.fn.tooltip.defaults = {
                trigger: "hover"
            };
            n.prototype = t.prototype;
            e.fn.popover = function(t) {
                return this.each(function() {
                    var r = e(this)
                      , i = r.data("popover")
                      , s = typeof t === "object" && t;
                    if (!i)
                        r.data("popover", i = new n(this,s));
                    if (typeof t === "string")
                        i[t]()
                }
                )
            }
            ;
            e.fn.popover.defaults = {
                trigger: "hover",
                style: "white"
            }
        }
        )(jQuery)
    }
    (t.exports, t, e);
    e.____MODULES["026dc2c1d423337ae6ca8f16ca6acaa0"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "4ec45b60a81506e39517a7d63c215200",
        filename: "index.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        e.____MODULES["7ced76474629932e525c7260a5a07829"];
        e.____MODULES["0e6feb481eef40bd9ce32d02e4c53134"];
        e.____MODULES["b0d64d16b71a5381e7fd64dd5f3c1457"];
        e.____MODULES["66c4b3aaeb260473d8f5835e521cdd75"];
        e.____MODULES["026dc2c1d423337ae6ca8f16ca6acaa0"]
    }
    (t.exports, t, e);
    e.____MODULES["4ec45b60a81506e39517a7d63c215200"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "d19596cf292662d0a77787cc426fc7d3",
        filename: "loadCSS.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(e, t, n) {
        function s(e, t) {
            var n = r || !("onload" in e);
            if (n) {
                setTimeout(function() {
                    o(e, t)
                }
                , 1);
                return
            }
            e.onload = function() {
                e = e.onload = null ;
                t()
            }
        }
        function o(e, t) {
            var n = e.sheet;
            var i;
            if (r && n) {
                i = true
            } else if (n) {
                try {
                    if (n.cssRules) {
                        i = true
                    }
                } catch (s) {
                    if (s.name === "NS_ERROR_DOM_SECURITY_ERR") {
                        i = true
                    }
                }
            }
            setTimeout(function() {
                if (i) {
                    t()
                } else {
                    o(e, t)
                }
            }
            , 20)
        }
        var r = navigator.userAgent.replace(/.*AppleWebKit\/(\d+)\..*/, "$1") * 1 < 536;
        var i = n.QNR;
        i.loadCSS = function(e, t) {
            var n = document.createElement("link");
            n.setAttribute("rel", "stylesheet");
            n.setAttribute("href", e);
            s(n, t);
            document.getElementsByTagName("head")[0].appendChild(n)
        }
    }
    (t.exports, t, e);
    e.____MODULES["d19596cf292662d0a77787cc426fc7d3"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "e49a8ad9e2be38b65c14f8488baba241",
        filename: "loginDia.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        function f() {
            l();
            c()
        }
        function l() {
            $.getScript(s + "js", function() {
                o = true
            }
            )
        }
        function c() {
            a.loadCSS(s + "css", function() {
                u = true
            }
            )
        }
        function h(e, t) {
            e = $.extend({
                title: "",
                btnText: "不登录，直接预订",
                clicFunc: function() {}
            }, e);
            var n = $("#QunarPopBox")
              , r = n.find(".login_content_body");
            if (!n.length || !r.length) {
                return
            }
            r.find(".login_unite").hide().filter(".j-direct-a").show();
            if (!r.find(".j-direct-a").length) {
                var i = []
                  , s = e.title ? "30" : "75";
                i.push('<div class="login_unite j-direct-a" style="_margin-right:-3px;margin-top:', s, 'px;">');
                e.title && i.push('<h2 style="font-size:12px;">', e.title, "</h2>");
                i.push('<p><a class="btn_large j-direct-btn" href="#"><span><b class="b-bg" style="font-size:12px;">', e.btnText, "</b></span></a></p>");
                i.push("</div>");
                var o = jQuery(i.join(""));
                r.append(o);
                o.find(".j-direct-btn").on("click", function(n) {
                    n.preventDefault();
                    typeof e.clicFunc === "function" && e.clicFunc.call(this);
                    t && typeof t.close === "function" && t.close();
                    return false
                }
                )
            }
        }
        var i = e.____MODULES["285adc5af3055e36addfeabe5289c690"];
        var s = "http://user.qunar.com/webApi/popup.jsp?";
        var o = false;
        var u = false;
        var a = r.QNR;
        $(function() {
            f()
        }
        );
        var p;
        a.showLoginDia = function(e) {
            if (!o || !u) {
                if (!p) {
                    p = new Date
                } else {
                    var t = new Date;
                    if (t - p > 1e3 * 5) {
                        $.ui.alert("登陆服务暂时不可用，请刷新页面再试");
                        return
                    }
                }
                setTimeout(function() {
                    a.showLoginDia(e)
                }
                , 500);
                return
            }
            var n = e.callback;
            e.callback = function() {
                var e = [].slice.call(arguments);
                n && n.apply(this, e);
                UserStatus && UserStatus.fresh && UserStatus.fresh();
                i.trigger("success.login", e)
            }
            ;
            if (e.skipLogin) {
                e.union = true
            }
            var r = new $.LoginPop(e);
            if (e.skipLogin) {
                h(e.skipLogin, r.popBox)
            }
        }
    }
    (t.exports, t, e);
    e.____MODULES["e49a8ad9e2be38b65c14f8488baba241"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "26e08e2404d276130d4d3698b53f8f3a",
        filename: "jquery.placeholder.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(e, t, n) {
        (function(e) {
            var t = "0.1.1";
            e.fn.placeholder = function() {
                return e(this).each(function() {
                    var t = e(this);
                    var n = t.css("color");
                    var r = t.data("placeholder");
                    var i = t.data("placeholder-color") || "#999";
                    var s = t.data("placeholder-clsname");
                    var o = t.data("placeholder-align");
                    var u = t.css("text-align");
                    if (r == null )
                        return;
                    var a = function() {
                        return e.trim(t.val()) == "" || t.val() == r
                    }
                    ;
                    this.isPlaceHolderEmpty = a;
                    var f = function() {
                        if (s) {
                            t.removeClass(s)
                        } else {
                            t.css("color", "")
                        }
                        t.css("text-align", u)
                    }
                    ;
                    var l = function() {
                        if (s) {
                            t.addClass(s)
                        } else {
                            t.css("color", i)
                        }
                        t.css("text-align", o)
                    }
                    ;
                    t.unbind(".placeholder").bind("focus.placeholder", function() {
                        if (a()) {
                            t.val("");
                            f()
                        }
                    }
                    ).bind("blur.placeholder", function() {
                        if (a()) {
                            t.val(r);
                            l()
                        } else {
                            f()
                        }
                    }
                    );
                    this.initPlaceHolder = function() {
                        if (a()) {
                            t.val(r);
                            l()
                        } else {
                            f()
                        }
                    }
                    ;
                    this.initPlaceHolder()
                }
                )
            }
        }
        )(jQuery)
    }
    (t.exports, t, e);
    e.____MODULES["26e08e2404d276130d4d3698b53f8f3a"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "65accefedae979e31e9ba91ac118fc10",
        filename: "jquery.selector.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(e, t, n) {
        (function(e, t) {
            var n = e.jQuery
              , r = e.document;
            var i = "YSELECTOR"
              , s = ".SELECTOR_EVENT"
              , o = "hover"
              , u = n.browser.msie && n.browser.version === "6.0";
            var a = function() {}
            ;
            a.options = {
                emptyHidden: false,
                maxRows: 10,
                index: null ,
                direction: "bottom",
                onchange: function() {},
                onselect: function(e) {
                    return e || ""
                }
            };
            a.prototype = {
                _init: function(e) {
                    var t = this;
                    t._setOptions(e || {});
                    t._bindEvents()
                },
                _bindEvents: function() {
                    function i(t) {
                        if (e.option("disable")) {
                            return
                        }
                        if (r) {
                            e._hide()
                        } else {
                            e._show()
                        }
                        r = !r
                    }
                    var e = this
                      , t = e.option("jquery")
                      , r = false;
                    t.delegate(".yselector_input", "click" + s, i).delegate(".yselector_arraw", "mousedown" + s, function(t) {
                        e.option("input").focus();
                        t.preventDefault();
                        if (this.setCapture) {
                            this.setCapture()
                        }
                        i(t)
                    }
                    ).delegate(".yselector_arraw", "click" + s, function(e) {
                        if (this.releaseCapture) {
                            this.releaseCapture()
                        }
                    }
                    ).delegate(".yselector_input", "focusout" + s, function() {
                        if (r) {
                            e._hide();
                            r = false
                        }
                        var t = e.val()
                          , i = e._getByValue(t);
                        n(n.fn.yselector.events).trigger("blur", [e, i, e.option("holder")])
                    }
                    ).delegate(".yselector_suggest ul", "mousedown" + s, function(t) {
                        t.preventDefault();
                        if (this.setCapture) {
                            this.setCapture()
                        }
                        var r = t.target;
                        if (r.tagName !== "A") {
                            return
                        }
                        var s = n(r).data("index");
                        e.index(s);
                        i(t)
                    }
                    ).delegate(".yselector_suggest ul", "click" + s, function(e) {
                        if (this.releaseCapture) {
                            this.releaseCapture()
                        }
                    }
                    ).delegate(".yselector_suggest ul", "mouseenter" + s, function(t) {
                        e._cur().removeClass(o)
                    }
                    ).delegate(".yselector_input", "keydown" + s, function(t) {
                        if (e.option("disable")) {
                            return
                        }
                        var n = t.keyCode;
                        if (n === 37 || n === 38) {
                            e.previous();
                            return false
                        } else if (n === 39 || n === 40) {
                            e.next();
                            return false
                        } else if (n === 13) {
                            i(t)
                        } else if (n === 8) {
                            return false
                        }
                    }
                    )
                },
                _cur: function(e) {
                    var t = this
                      , n = e == null  ? t.option("index") : e
                      , r = t.option("suggest").find("a:eq(" + n + ")");
                    return r
                },
                _drawHtml: function() {
                    var e = this;
                    var t = ['<div class="yselector">', '<div class="yselector_box">', '<div class="yselector_arraw"><b></b></div>', '<span class="yselector_input" tabindex="0"></span>', "</div>", '<div style="display:none;" class="yselector_suggest">', "<ul></ul>", "</div>", "</div>"];
                    var r = n(t.join("\n"))
                      , i = e.option("holder").hide();
                    i.after(r);
                    e.option("jquery", r);
                    e.option("suggest", n(".yselector_suggest", r));
                    e.option("input", n(".yselector_input", r))
                },
                _drawSuggest: function() {
                    var e = [], t, n = this, r = n.option("data");
                    for (var i = 0, s = r.length; i < s; i++) {
                        t = r[i];
                        e.push('<li><a data-value="' + t.value + '" hidefocus="on" data-index="' + i + '"');
                        e.push(' onclick="return false;" href="javascript:;" tabindex="-1">' + t.text + "</a></li>")
                    }
                    n.option("suggest").html("<ul>" + e.join("\n") + "</ul>")
                },
                _setOptions: function(e) {
                    var t = this;
                    t.options = n.extend({}, a.options, e);
                    var r = e.rawSelect, i = r.options, s = r.selectedIndex, o = [], u;
                    for (var f = 0, l = i.length; f < l; f++) {
                        u = i[f];
                        o.push({
                            value: u.value || u.text,
                            text: u.text
                        })
                    }
                    t.option("holder", n(r));
                    t.option("index", e.index != null  ? e.index : s);
                    t._drawHtml();
                    t.setOptions(o)
                },
                _getByValue: function(e, t) {
                    if (!e) {
                        return
                    }
                    var n = this.option("data"), r;
                    t = t || "value";
                    for (var i = 0, s = n.length; i < s; i++) {
                        r = n[i];
                        if (r[t] == e) {
                            return r
                        }
                    }
                },
                _setByObject: function(e, t) {
                    e = e || {};
                    if (!t && this.option("index") === e.index) {
                        return
                    }
                    var r = this
                      , i = r.option("onselect")
                      , s = r.option("onchange");
                    var o = i ? i(e.text) : e.text || "";
                    r.option("value", e.value || "");
                    r.option("text", o);
                    r.option("index", e.index || 0);
                    var u = r.option("holder")
                      , a = r.option("input");
                    if (u) {
                        u[0].selectedIndex = e.index
                    }
                    if (a) {
                        r.option("input").text(o)
                    }
                    if (s) {
                        s.call(r, e)
                    }
                    n(n.fn.yselector.events).trigger("change", [r, e, r.option("holder")])
                },
                _triggerClass: function(e, t) {
                    var n = this;
                    if (e === t) {
                        return
                    }
                    n._cur(e).removeClass(o);
                    n._cur(t).addClass(o)
                },
                _show: function() {
                    var e = this
                      , t = e.option("suggest")
                      , n = e.option("index")
                      , r = e.option("direction");
                    e._drawSuggest();
                    var i = t.find("a");
                    i.eq(n).addClass(o);
                    t.show();
                    var s = e.option("maxRows");
                    var u = Math.min(i.size(), s) * i.height();
                    var a = r === "top" ? 0 - u - e.option("jquery").height() : 0;
                    t.find("ul").css("height", u).css("top", a)
                },
                _hide: function() {
                    this.option("suggest").hide()
                },
                setOptions: function(e) {
                    var t = this
                      , n = t.option("jquery");
                    e = e || [];
                    var r = t.option("holder")[0];
                    r.length = 0;
                    for (var i = 0, s = e.length, o; i < s; i++) {
                        o = e[i];
                        o.index = i;
                        r.options.add(new Option(o.text,o.value))
                    }
                    t.option("data", e);
                    if (!e.length && t.option("emptyHidden")) {
                        n.hide()
                    } else {
                        n.show()
                    }
                    t._setByObject(e[t.option("index")] || e[0], true)
                },
                first: function() {
                    return this.option("data")[0] || {}
                },
                option: function(e, t) {
                    if (t != null ) {
                        this.options[e] = t
                    } else {
                        return this.options[e]
                    }
                },
                previous: function() {
                    var e = this
                      , t = e.index() - 1;
                    if (t < 0) {
                        t = e.option("data").length + t
                    }
                    e.index(t)
                },
                next: function() {
                    var e = this;
                    e.index(e.option("index") + 1)
                },
                index: function(e) {
                    var t = this;
                    if (e == null ) {
                        return t.option("index")
                    }
                    var n = t.option("data")
                      , r = n[e]
                      , i = t.option("index");
                    if (!r) {
                        r = t.first();
                        e = 0
                    }
                    t._setByObject(r)
                },
                val: function(e, t) {
                    var n = this;
                    if (e == null ) {
                        return n.option("value")
                    }
                    var r = n._getByValue(e);
                    if (r == null ) {
                        r = n.first()
                    }
                    n._setByObject(r, t)
                },
                text: function(e) {
                    var t = this;
                    if (e == null ) {
                        return t.option("text")
                    }
                    var n = t._getByValue(e, "text");
                    if (n == null ) {
                        n = t.first()
                    }
                    t._setByObject(n)
                },
                disable: function() {
                    this.option("jquery").addClass("disble");
                    this.option("disable", true)
                },
                enable: function() {
                    this.option("jquery").removeClass("disble");
                    this.option("disable", false)
                }
            };
            n.fn.extend({
                yselector: function(e) {
                    n.fn.yselector.events = {};
                    this.each(function(t, r) {
                        var s = n(this);
                        var o = s.data(i);
                        if (!o) {
                            e = e || {};
                            e.rawSelect = s[0];
                            o = new a;
                            s.data(i, o);
                            o._init(e)
                        }
                        return o
                    }
                    )
                }
            })
        }
        )(this)
    }
    (t.exports, t, e);
    e.____MODULES["65accefedae979e31e9ba91ac118fc10"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "a40dfa3b9d47360e1f4e570477cde2ba",
        filename: "jquery.qsuggest-1.2.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(e, t, n) {
        (function(e) {
            function s(e) {
                var t = e.offset();
                t["top"] += e.outerHeight();
                return t
            }
            function o(e) {
                var t = e.closest("table").data("data")
                  , n = t[e.attr("data-ind") * 1];
                return n.val
            }
            function u(e, t) {
                if (!this.init)
                    return new qsuggest(e,t);
                else
                    return this.init(e, t)
            }
            var t = function() {
                var e = "data-detect-oninput"
                  , t = {}
                  , n = {}
                  , r = 1
                  , i = 1;
                var s = function(e, n, r, i) {
                    if (e.addEventListener)
                        e.addEventListener(n, r, false);
                    else if (e.attachEvent)
                        e.attachEvent("on" + n, r);
                    (t[i] || (t[i] = [])).push({
                        t: n,
                        h: r
                    })
                }
                ;
                var o = function(e, n) {
                    if (!t[n])
                        return;
                    for (var r = 0, i; i = t[n][r]; r++)
                        if (e.removeEventListener)
                            e.removeEventListener(i["t"], i["h"], false);
                        else if (e.detachEvent)
                            e.detachEvent("on" + i["t"], i["h"]);
                    delete t[n]
                }
                ;
                var u = function(e, t) {
                    var n = e.value;
                    var r = function() {
                        var i;
                        if ((i = e.value) !== n) {
                            if (r._sleep !== true)
                                t.call(e, i, n);
                            n = e.value
                        }
                    }
                    ;
                    return r
                }
                ;
                var a = navigator.userAgent.toLowerCase();
                return {
                    version: "1.3",
                    bind: function(t, o) {
                        var f, l = o[e];
                        if (!l)
                            o[e] = l = r++;
                        if (!(f = t.getAttribute(e)))
                            t.setAttribute(e, f = "" + i++);
                        var c = u(t, o);
                        if ("oninput" in t && !/opera/.test(a))
                            s(t, "input", c, l);
                        else {
                            var h;
                            s(t, "focus", function() {
                                if (!h)
                                    h = setInterval(c, 100)
                            }
                            , l);
                            s(t, "blur", function() {
                                if (h) {
                                    clearInterval(h);
                                    h = null 
                                }
                            }
                            , l)
                        }
                        n[l] = {
                            eid: f,
                            checker: c
                        };
                        return t
                    },
                    unbind: function(t, r) {
                        if (r[e]) {
                            o(t, r[e]);
                            delete n[r[e]]
                        }
                        return t
                    },
                    set: function(t, r) {
                        var i = t.getAttribute(e);
                        if (i) {
                            var s = [];
                            for (var o in n)
                                if (n[o]["eid"] === i) {
                                    s.push(n[o]["checker"]);
                                    n[o]["checker"]._sleep = true
                                }
                            t.value = r;
                            for (var u = 0, a = s.length; u < a; u++) {
                                s[u].call(t);
                                s[u]._sleep = false
                            }
                        } else
                            t.value = r
                    }
                }
            }
            ();
            e.qsuggest = {
                version: "1.2"
            };
            var n = e.qsuggest.ROOT_KEY = "q-suggest";
            var r = 0;
            var i = {
                ajax: {
                    url: null ,
                    cache: false,
                    success: function() {}
                },
                reader: function(e) {
                    return e
                },
                loader: function(e) {
                    return e
                },
                max: 10,
                min: 1,
                container: null ,
                delay: 100,
                rdelay: 1e3,
                requestWithNothing: false,
                trimQuery: true,
                css: {
                    "z-index": 1e4
                },
                render: function(e) {
                    return String(e).replace(/&/g, "&amp;").replace(/</g, "&lt;").replace(/>/g, "&gt;")
                }
            };
            e.extend(u.prototype, {
                init: function(s, u) {
                    this.key = ++r;
                    var a = this.ns = n + this.key;
                    u = this.args = e.extend(true, {}, i, u || {});
                    var f = this.activeEl = e(s);
                    var l = this;
                    this.el = e('<div class="' + n + (u.customClass ? " " + u.customClass : "") + '"></div>').appendTo(u["container"] || document.body).hide();
                    this.el.data(n, this);
                    this._handler = null ;
                    this._ajaxHandler = null ;
                    this._excludeEl = null ;
                    this._mouseFocus = null ;
                    this._last = [];
                    this._cache = {};
                    this._value = null ;
                    e.each(u["on"] || {}, function(e, t) {
                        f.bind(e + "." + a, t)
                    }
                    );
                    if (u["css"])
                        this.el.css(l.args["css"]);
                    var l = this;
                    t.bind(f[0], function() {
                        l.show()
                    }
                    );
                    f.bind("keyup." + a, function(e) {
                        var t = l.visible();
                        var n = e.keyCode;
                        if (n === 40 && !t) {
                            l.show();
                            return
                        }
                        if (!t)
                            return;
                        var r = l.el.find('tr[data-sug_type="0"]');
                        var i = r.filter(".active");
                        switch (n) {
                        case 38:
                        case 40:
                            l._excludeEl = l._mouseFocus;
                            var s = r.index(i);
                            s = e.keyCode === 38 ? s - 1 : s + 1;
                            if (s >= r.length)
                                s = 0;
                            if (s < 0)
                                s = r.length - 1;
                            i.removeClass("active");
                            i = r.eq(s);
                            var u = "";
                            if (i.length > 0) {
                                u = o(i);
                                l.setValue(u);
                                i.addClass("active")
                            }
                            e.preventDefault();
                            l._trigger("q-suggest-user-action", [e.type, u, n]);
                            break;
                        case 13:
                            if (i.length > 0) {
                                l.setValue(o(i))
                            }
                            ;
                        case 27:
                            l.hide();
                            l._trigger("q-suggest-user-action", [e.type, l.getValue(), n]);
                            break;
                        case 18:
                        case 9:
                            break
                        }
                    }
                    );
                    f.bind("blur." + a, function(e) {
                        if (l.visible()) {
                            var t = l.el.find("tr.active");
                            if (t.length > 0) {
                                l.setValue(o(t))
                            }
                            l.hide()
                        }
                    }
                    );
                    e("tr", this.el[0]).live("mouseover." + a + " mouseout." + a + " mousedown." + a, function(t) {
                        var n = e.nodeName(t.target, "tr") ? e(t.target) : e(t.target).parents("tr").eq(0);
                        if (e(n[0]).attr("data-sug_type") == 1) {
                            t.preventDefault();
                            return
                        }
                        var r = n[0] != l._excludeEl;
                        if (t.type === "mouseover") {
                            if (r) {
                                n.parents().children().removeClass("active");
                                n.addClass("active");
                                l._excludeEl = null 
                            }
                            l._mouseFocus = n[0]
                        } else if (t.type === "mouseout") {
                            l._mouseFocus = null 
                        } else {
                            l.setValue(o(n));
                            l.hide();
                            l._trigger("q-suggest-user-action", [t.type, l.getValue(), null ])
                        }
                    }
                    );
                    return this
                },
                req: function() {
                    var t = this;
                    if (t._handler)
                        clearTimeout(t._handler);
                    if (t._timeoutHandler) {
                        clearTimeout(t._timeoutHandler);
                        t._timeoutHandler = null 
                    }
                    if (t._ajaxHandler) {
                        t._ajaxHandler = null 
                    }
                    t._handler = setTimeout(function() {
                        var n = t.activeEl.val(), r = t.args.loader(n), i = null , s;
                        if (t.args.trimQuery)
                            r = e.trim(r);
                        r = r.replace(/[~!@#\$%\^&\*\(\)_\+<>\?:\\\\"\|\{\}`,\.\/;'\\\{\}]+/ig, "");
                        if (!r && !t.args.requestWithNothing) {
                            t.draw(null );
                            return
                        }
                        if (t._last && t._last[0] === r) {
                            t.draw(t._last[1]);
                            return
                        }
                        if (t._last && t._last[0] == r)
                            i = t._last;
                        else if (t.args.cache && t._cache[r])
                            i = t._cache[r];
                        if (i)
                            t.draw((t._last = i)[1]);
                        else if (!t.args.ajax.url)
                            t.draw(null );
                        else {
                            var o = t.args.ajax.url.replace(/\*([^*]+)$/, encodeURIComponent(r) + "$1");
                            var u = t.args.ajax.success;
                            t._timeoutHandler = setTimeout(function() {
                                t.hide()
                            }
                            , t.args.rdelay);
                            t._ajaxHandler = e.ajax(e.extend({}, t.args.ajax, {
                                url: o,
                                success: function(e, i) {
                                    clearTimeout(t._timeoutHandler);
                                    t._timeoutHandler = null ;
                                    t._ajaxHandler = null ;
                                    if (n !== t.activeEl.val())
                                        return;
                                    var s = t.args.reader.call(t, e, i);
                                    if (t.type(s) === "Array") {
                                        t.draw(s, e);
                                        t._last = t._cache[r] = [r, s, i]
                                    }
                                    u.apply(this, arguments)
                                }
                            }))
                        }
                    }
                    , t.args.delay)
                },
                type: function(e) {
                    return Object.prototype.toString.call(e).slice(8, -1)
                },
                show: function() {
                    this.req()
                },
                hide: function() {
                    if (this.visible()) {
                        this.el.hide();
                        this._trigger("q-suggest-hide")
                    }
                },
                draw: function(t, n) {
                    this.el.empty();
                    var r = this.args.min
                      , i = this.args.max;
                    if (!t || !t.length || t.length < r) {
                        this.hide();
                        return
                    }
                    var o = []
                      , u = this.args.render
                      , a = true;
                    o.push('<table cellspacing="0" cellpadding="2"><tbody>');
                    e.each(t, function(e, t) {
                        if (e >= i)
                            return false;
                        var n = "";
                        if (t.type !== 1 && a) {
                            a = false;
                            n = ' class="active" '
                        }
                        o.push(["<tr", n, ' data-sug_type="', t.type, '" data-ind="', e, '"><td>', u(t.txt), "</td></tr>"].join(""))
                    }
                    );
                    o.push("</tbody></table>");
                    this._trigger("q-suggest-beforeshow", [this.el, n]);
                    var f = e(o.join("")).appendTo(this.el).data("data", t);
                    if (!this.args["container"])
                        this.el.css(s(this.activeEl));
                    var l = this.args["width"]
                      , c = this.activeEl.outerWidth();
                    if (!l || l < c)
                        l = c;
                    this.el.css("width", l);
                    this.el.show();
                    l = Math.max(c, e("table", this.el).width() + 2);
                    this.el.css("width", l);
                    this._trigger("q-suggest-show", [t])
                },
                dispose: function() {
                    this._trigger("q-suggest-dispose");
                    this.activeEl.unbind("." + this.ns);
                    e(window).unbind("." + this.ns);
                    this.el.remove()
                },
                visible: function() {
                    return this.el.is(":visible")
                },
                _trigger: function() {
                    this.activeEl.triggerHandler.apply(this.activeEl, arguments)
                },
                setValue: function(e) {
                    t.set(this.activeEl[0], e);
                    this._value = e
                },
                getValue: function() {
                    return this._value
                },
                set: function(e, t) {
                    var n = false;
                    switch (e) {
                    case "container":
                        this.el.appendTo(t || document.body);
                        this.el.css({
                            top: "",
                            left: ""
                        });
                        break
                    }
                    if (!n)
                        for (var r = 0, i = e.split("."), s = i.length, o = this.args; r < s && (r !== s - 1 && (o[i[r]] || (o[i[r]] = {})) || (o[i[r]] = t)); o = o[i[r]],
                        r++) {}
                    return t
                },
                get: function(e) {
                    for (var t = 0, n = this.args, r = e.split("."), i = r.length; t < i && (n = n[r[t]]); t++) {}
                    return n
                }
            });
            e.fn.qsuggest = function() {
                var t = arguments;
                if (arguments.length > 1 && this.data(n)) {
                    var r = null ;
                    if (arguments[0] === "option" || arguments[0] === "setting")
                        this.each(function(i, s) {
                            var o = e(s);
                            var u = this.data(n);
                            if (u)
                                r = r || (t.length > 2 ? u.set(t[1], t[2]) : u.get(t[1]))
                        }
                        );
                    return r
                } else if (arguments.length <= 1) {
                    this.each(function(r, i) {
                        var s = e(i);
                        if (s.data(n)) {
                            s.data(n).dispose();
                            s.removeData(n)
                        }
                        var o = new u(i,t[0]);
                        s.data(n, o)
                    }
                    )
                }
                return this
            }
        }
        )(jQuery)
    }
    (t.exports, t, e);
    e.____MODULES["a40dfa3b9d47360e1f4e570477cde2ba"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "9f1b70254a12910ca876d609712646b5",
        filename: "jquery.datepicker.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(e, t, n) {
        ~function() {
            var e = window.SERVER_TIME || new Date;
            var t = {
                YEAY: "year",
                MONTH: "month"
            }
              , n = {
                SELECTEVENT: "selectEvent"
            }
              , r = "hover"
              , i = "datepicker"
              , s = {
                LABEL: ".calentor-box",
                SUG: ".calentor_suggest",
                INPUT: ".calentor-input",
                YEAR: ".js-year",
                MONTH: ".js-month",
                DATEBODY: "tbody",
                LEFT: ".left a",
                RIGHT: ".right a",
                CLOSE: ".close",
                ICON: ".mo-boxContainer"
            }
              , o = $.browser.msie && parseInt($.browser.version, 10) < 9
              , u = {
                YEAR: "年",
                MONTH: "月",
                MON: "一",
                TUE: "二",
                WEN: "三",
                THU: "四",
                FRI: "五",
                SAT: "六",
                SUN: "日"
            }
              , a = {
                YEAR: "year",
                MONTH: "month",
                MON: "mo",
                TUE: "tu",
                WEN: "we",
                THU: "th",
                FRI: "fr",
                SAT: "sa",
                SUN: "su"
            };
            var f = function() {}
            ;
            $.extend(f.prototype, {
                init: function(e) {
                    this.conf = e;
                    this.isShow = false;
                    this._renderUI()
                },
                _renderUI: function() {
                    var e = []
                      , t = this.conf;
                    var n = t.minVal, r = t.maxVal, i = t.currVal, s = t.cls, o;
                    e.push('<div class="calentor ', s, '">');
                    e.push('  <div class="calentor-box">');
                    e.push('    <div class="calentor-arraw"><b></b></div>');
                    e.push('    <span class="calentor-input">', i, "</span>");
                    e.push("  </div>");
                    e.push('  <div style="display: none;" class="calentor_suggest">');
                    e.push("    <ul>");
                    for (o = n; o < r + 1; o++) {
                        e.push('<li><a href="javascript:;">', o, "</a></li>")
                    }
                    e.push("    </ul>");
                    e.push("  </div>");
                    e.push("</div>");
                    this.ele = $(e.join(""))
                },
                bindEvent: function() {
                    function i(t) {
                        t.preventDefault();
                        if (!e.isShow) {
                            e._show()
                        } else {
                            e._hide()
                        }
                    }
                    var e = this, t, n = this.sug = this.ele.find(s.SUG), r = this.inp = this.ele.find(s.INPUT);
                    r.bind("mousedown", i).prev().bind("mousedown", function(e) {
                        e.preventDefault();
                        i(e)
                    }
                    );
                    n.delegate("a", "mousedown", function(n) {
                        n.preventDefault();
                        t = this.innerHTML;
                        r.text(t);
                        e._hide();
                        e.onchange(t)
                    }
                    );
                    $(document).mousedown(function(t) {
                        if (!e.isShow)
                            return;
                        var n = t.target;
                        var r = e.ele.has(n).length;
                        !r && e._hide()
                    }
                    )
                },
                onchange: function(e) {
                    var t = this.conf.type;
                    $(this).trigger(n.SELECTEVENT, {
                        value: e,
                        type: t
                    })
                },
                getObj: function() {
                    return this.ele
                },
                getVal: function() {
                    return this.inp.text()
                },
                setVal: function(e) {
                    this.inp.text(e)
                },
                _show: function() {
                    var e = this.sug
                      , t = this.conf;
                    var n = e.find("a");
                    var i = t.minVal
                      , s = t.maxVal
                      , o = parseInt(this.getVal(), 10)
                      , u = s - i + 1
                      , a = o - i;
                    var f = u * n.height();
                    var l = 0;
                    this.isShow = true;
                    e.show();
                    n.eq(a).addClass(r);
                    e.find("ul").css("top", l).scrollTop(a * n.height())
                },
                _hide: function() {
                    this.isShow = false;
                    this.sug.hide().find("a").removeClass(r)
                }
            });
            var l = function() {}
            ;
            $.extend(l.prototype, {
                _init: function(e) {
                    this.conf = e;
                    this.holder = $(this.conf.holder);
                    var n = this.conf.minDate
                      , r = this.conf.maxDate
                      , i = this.conf.defaultDate;
                    var s = new f
                      , o = new f;
                    s.init({
                        type: t.YEAY,
                        minVal: n.getFullYear(),
                        currVal: i.getFullYear(),
                        maxVal: r.getFullYear(),
                        cls: ""
                    });
                    o.init({
                        type: t.MONTH,
                        minVal: 1,
                        currVal: 1,
                        maxVal: 12,
                        cls: "month"
                    });
                    this.year = s;
                    this.month = o;
                    this._renderUI();
                    this._bindEvent()
                },
                _renderUI: function() {
                    var e = this.currDate()
                      , t = this.conf.en ? a : u
                      , n = ['<div class="calendar-pop" style="display:none;">', '   <div class="mo-pop-panel">', '       <a class="close" href="javascript:void(0)"></a>', '       <div class="year-month clrfix">', '           <span class="character js-year">', t.YEAR, "</span>", '           <span class="character js-month">', t.MONTH, "</span>", "       </div>", '       <div class="mopart">', '           <div class="left"><a href="javascript:void(0)"></a></div>', '           <table width="0" cellspacing="0" cellpadding="0" border="0" class="calendar-tab">', "               <tbody>", "               </tbody>", "           </table>", '           <div class="right"><a href="javascript:void(0)"></a></div>', '           <div style="clear: both;"></div>', "       </div>", "   </div>", "</div>"];
                    this.calendar = $(n.join(""));
                    this.holder.parent().after(this.calendar);
                    this._onAfterRender(e)
                },
                _onAfterRender: function(e) {
                    this.dateBody = this.calendar.find(s.DATEBODY);
                    this.calendar.find(s.YEAR).before(this.year.getObj());
                    this.calendar.find(s.MONTH).before(this.month.getObj());
                    this.year.bindEvent();
                    this.month.bindEvent()
                },
                _renderDate: function(e) {
                    var t = e.getFullYear()
                      , n = e.getMonth()
                      , r = (new Date(t,n,"01")).getDay() - 1;
                    r = r == -1 ? 6 : r;
                    var i = (new Date(t,n + 1,0)).getDate(), s = 1, o = 1, f = [], l, c = this.currDate(), h = c.getTime() != this.conf.defaultDate.getTime() && c.getFullYear() == t && c.getMonth() == n, p = h ? c.getDate() : "", d = this.conf.en ? a : u;
                    f.push('<tr class="thead">');
                    f.push("   <td>", d.MON, "</td>");
                    f.push("   <td>", d.TUE, "</td>");
                    f.push("   <td>", d.WEN, "</td>");
                    f.push("   <td>", d.THU, "</td>");
                    f.push("   <td>", d.FRI, "</td>");
                    f.push('   <td class="holi">', d.SAT, "</td>");
                    f.push('   <td class="holi">', d.SUN, "</td>");
                    f.push("</tr>");
                    while (o <= i) {
                        f.push('<tr class="tdate">');
                        for (var v = 0; v < 7; v++) {
                            if (s == 1 && v < r || o > i) {
                                l = '<td class="cnone">&nbsp;</td>'
                            } else if (p == o) {
                                l = '<td class="curr">' + p + "</td>";
                                o++
                            } else {
                                l = "<td>" + o + "</td>";
                                o++
                            }
                            f.push(l)
                        }
                        f.push("</tr>");
                        s += 1
                    }
                    return f.join("")
                },
                _renderEnDate: function(e) {
                    var t = e.getFullYear()
                      , n = e.getMonth()
                      , r = (new Date(t,n,"01")).getDay();
                    var i = (new Date(t,n + 1,0)).getDate(), s = 1, o = 1, f = [], l, c = this.currDate(), h = c.getTime() != this.conf.defaultDate.getTime() && c.getFullYear() == t && c.getMonth() == n, p = h ? c.getDate() : "", d = this.conf.en ? a : u;
                    f.push('<tr class="thead">');
                    f.push('   <td class="holi">', d.SUN, "</td>");
                    f.push("   <td>", d.MON, "</td>");
                    f.push("   <td>", d.TUE, "</td>");
                    f.push("   <td>", d.WEN, "</td>");
                    f.push("   <td>", d.THU, "</td>");
                    f.push("   <td>", d.FRI, "</td>");
                    f.push('   <td class="holi">', d.SAT, "</td>");
                    f.push("</tr>");
                    while (o <= i) {
                        f.push('<tr class="tdate">');
                        for (var v = 0; v < 7; v++) {
                            if (s == 1 && v < r || o > i) {
                                l = '<td class="cnone">&nbsp;</td>'
                            } else if (p == o) {
                                l = '<td class="curr">' + p + "</td>";
                                o++
                            } else {
                                l = "<td>" + o + "</td>";
                                o++
                            }
                            f.push(l)
                        }
                        f.push("</tr>");
                        s += 1
                    }
                    return f.join("")
                },
                _bindEvent: function() {
                    var e = this
                      , t = this.calendar
                      , r = e.holder.prev()
                      , i = this.conf.en;
                    $(document).mousedown(function(n) {
                        var i = n.target;
                        var s = t.has(i).length || r.has(i).length;
                        if (!e.isShow || i == e.conf.holder || s)
                            return;
                        e.hide()
                    }
                    );
                    $(this.year).bind(n.SELECTEVENT, function(t, n) {
                        e._redraw()
                    }
                    );
                    $(this.month).bind(n.SELECTEVENT, function(t, n) {
                        e._redraw()
                    }
                    );
                    this.holder.bind("click", function(t) {
                        e._toggleEvent();
                        e._f_leave = 0
                    }
                    ).prev().bind("mousedown", function(t) {
                        t.preventDefault();
                        !e.holder.is(":focus") && e.holder.focus();
                        e._f_leave = 1;
                        e._toggleEvent()
                    }
                    );
                    this.holder.bind("blur", function(t) {
                        var n = e.conf.onchange;
                        if (n) {
                            n.call(this, e.holder.val())
                        }
                    }
                    );
                    t.find(s.LEFT).mousedown(function(t) {
                        e._redraw("pre")
                    }
                    );
                    t.find(s.RIGHT).mousedown(function(t) {
                        e._redraw("next")
                    }
                    );
                    t.find(s.CLOSE).mousedown(function(t) {
                        e.hide()
                    }
                    );
                    t.mousedown(function(t) {
                        e._f_leave = 1;
                        t.preventDefault()
                    }
                    ).bind("click", ".tdate td", function(t) {
                        var n, r, s;
                        if ($(t.target).is(".tdate td:not(.cnone)")) {
                            n = t.target.innerHTML;
                            r = e.month.getVal();
                            s = e.year.getVal();
                            r = r.length == 1 ? "0" + r : r;
                            n = n.length == 1 ? "0" + n : n;
                            e.holder.val(i ? r + "-" + n + "-" + s : s + "-" + r + "-" + n);
                            e.hide(true);
                            e.holder.css("color", "")
                        }
                        t.preventDefault();
                        return false
                    }
                    )
                },
                _redraw: function(e) {
                    var t = parseInt(this.year.getVal(), 10), n = parseInt(this.month.getVal(), 10), r = 1, i;
                    switch (e) {
                    case "pre":
                        t = n == 1 ? t - 1 : t;
                        n = n == 1 ? 12 : --n;
                        break;
                    case "next":
                        t = n == 12 ? ++t : t;
                        n = n == 12 ? 1 : ++n;
                        break
                    }
                    i = new Date(t,n - 1,r);
                    this.year.setVal(t);
                    this.month.setVal(n);
                    this.conf.en ? this.dateBody.html(this._renderEnDate(i)) : this.dateBody.html(this._renderDate(i))
                },
                _toggleEvent: function() {
                    if (!this.isShow) {
                        this.show()
                    } else {
                        this.hide()
                    }
                },
                currDate: function() {
                    var e = this.holder.val()
                      , t = e.replace(/\D/g, "")
                      , n = /^\d{8}$/
                      , r = t && n.test(t);
                    var i = null , s = this.conf.en, o, u, a, f;
                    if (r) {
                        o = t.substr(s ? 4 : 0, 4);
                        u = parseInt(t.substr(s ? 0 : 4, 2), 10) - 1;
                        a = t.substr(s ? 2 : 6, 2);
                        i = new Date(Date.UTC(o, u, a));
                        f = this.formatStr(i);
                        f != e && this.holder.val(f) && this.holder.css("color", "")
                    }
                    return r ? i : this.conf.defaultDate
                },
                formatStr: function(e) {
                    var t = e.getUTCFullYear();
                    month = e.getUTCMonth() + 1;
                    day = e.getUTCDate();
                    return this.conf.en ? [month < 10 ? "0" + month : month, day < 10 ? "0" + day : day, t].join("-") : [t, month < 10 ? "0" + month : month, day < 10 ? "0" + day : day].join("-")
                },
                show: function() {
                    var e;
                    this.isShow = true;
                    e = this.currDate();
                    this.year.setVal(e.getFullYear());
                    this.month.setVal(e.getMonth() + 1);
                    this.conf.en ? this.dateBody.html(this._renderEnDate(e)) : this.dateBody.html(this._renderDate(e));
                    this.holder.focus();
                    if (o && !this.holder.parent().hasClass("e_error")) {
                        this.ruler = this.holder.data("jvalid-ruler");
                        this.holder.removeAttr("data-jvalid-ruler")
                    }
                    this.calendar.show();
                    return this
                },
                hide: function(e) {
                    var t;
                    this.isShow = false;
                    this.calendar.hide();
                    e || this.currDate();
                    o && this.ruler && this.holder.attr("data-jvalid-ruler", this.ruler);
                    this.holder.jvalid && this.holder.jvalid();
                    t = this.conf.onchange;
                    t && t.call(this, this.holder.val());
                    return this
                }
            });
            $.fn.extend({
                datepicker: function(e) {
                    this.each(function(t, n) {
                        var r = $(this), s;
                        var o = r.data(i);
                        if (!o) {
                            s = $.extend({}, e);
                            s.holder = this;
                            o = new l;
                            r.data(i, o);
                            o._init(s)
                        }
                    }
                    );
                    return this
                }
            })
        }
        ()
    }
    (t.exports, t, e);
    e.____MODULES["9f1b70254a12910ca876d609712646b5"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "ad05b58af7a3e1c622124b2ca5f09d7a",
        filename: "price_html_dimu.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(e, t, n) {
        function h(e, t) {
            t = t || 0;
            return Math.floor(Math.random() * (e - t)) + t
        }
        function p() {
            return ["z-index:", h(o, o - 20), ";left:", h(4, 1) * r, "px;"].join("")
        }
        function d(e) {
            return ["z-index:", h(o, o + 20), ";left:", e * r, "px;"].join("")
        }
        function v() {
            var e = h(1e3);
            if (l[e]) {
                return v()
            }
            l[e] = 1;
            return "js-p" + e
        }
        function m() {
            var e = "";
            var t;
            var n;
            var r;
            for (t = 0; t < i; t++) {
                a[t] = [];
                for (n = 0; n < s; n++) {
                    e = v();
                    a[t][n] = e;
                    u.push(".", e, "{", d(t), "}")
                }
            }
            for (r = 0; r < s; r++) {
                e = v();
                f[r] = e;
                u.push(".", e, "{", p(), "}")
            }
            l = null ;
            return u.join("")
        }
        function g() {
            var e = m();
            var t = document.createElement("style");
            t.type = "text/css";
            if (t.styleSheet) {
                t.styleSheet.cssText += e
            } else {
                t.appendChild(document.createTextNode(e))
            }
            document.getElementsByTagName("head")[0].appendChild(t)
        }
        function y(e) {
            var t = e.toString().split("");
            var n = ['<span class="prc_wp" style="zoom:1;position: relative;overflow:hidden;width:', r * t.length, 'px;"><em class="prc">'];
            var i = [];
            var o = h(t.length);
            $.each(t, function(e, n) {
                var r = h(s);
                if (o == e) {
                    i.push("<b" + (f[r] ? ' class="' + f[r] + '"' : "") + ">" + h(10) + "</b>");
                    o = h(t.length)
                }
                if (a[e]) {
                    i.push("<b" + (a[e][r] ? ' class="' + a[e][r] + '"' : "") + ">" + n + "</b>")
                } else {
                    i.push("<b" + (d(e) ? ' style="' + d(e) + '"' : "") + ">" + n + "</b>")
                }
            }
            );
            i.sort(function(e, t) {
                return 1 - h(2)
            }
            );
            n.push(i.join(""));
            n.push("</em></span>");
            return n.join("")
        }
        var r = 7;
        var i = 4;
        var s = 13;
        var o = parseInt(((new Date).valueOf() + "").slice(-2)) + 50;
        var u = [];
        var a = [];
        var f = [];
        var l = {};
        var c;
        var b = {
            config: function(e) {
                r = e
            },
            getHTML: y
        };
        t.exports = n.Price_html = b
    }
    (t.exports, t, e);
    e.____MODULES["ad05b58af7a3e1c622124b2ca5f09d7a"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "bef865947dd487135872ba9b505506e3",
        filename: "jquery.transit.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(e, t, n) {
        (function(e) {
            "use strict";
            function r(e) {
                var n = ["Moz", "Webkit", "O", "ms"];
                var r = e.charAt(0).toUpperCase() + e.substr(1);
                if (e in t.style) {
                    return e
                }
                for (var i = 0; i < n.length; ++i) {
                    var s = n[i] + r;
                    if (s in t.style) {
                        return s
                    }
                }
            }
            function i() {
                t.style[n.transform] = "";
                t.style[n.transform] = "rotateY(90deg)";
                return t.style[n.transform] !== ""
            }
            function a(e) {
                if (typeof e === "string") {
                    this.parse(e)
                }
                return this
            }
            function f(e, t, n) {
                if (t === true) {
                    e.queue(n)
                } else if (t) {
                    e.queue(t, n)
                } else {
                    n()
                }
            }
            function l(t) {
                var n = [];
                e.each(t, function(t) {
                    t = e.camelCase(t);
                    t = e.transit.propertyMap[t] || t;
                    t = p(t);
                    if (e.inArray(t, n) === -1) {
                        n.push(t)
                    }
                }
                );
                return n
            }
            function c(t, n, r, i) {
                var s = l(t);
                if (e.cssEase[r]) {
                    r = e.cssEase[r]
                }
                var o = "" + v(n) + " " + r;
                if (parseInt(i, 10) > 0) {
                    o += " " + v(i)
                }
                var u = [];
                e.each(s, function(e, t) {
                    u.push(t + " " + o)
                }
                );
                return u.join(", ")
            }
            function h(t, r) {
                if (!r) {
                    e.cssNumber[t] = true
                }
                e.transit.propertyMap[t] = n.transform;
                e.cssHooks[t] = {
                    get: function(n) {
                        var r = e(n).css("transform") || new a;
                        return r.get(t)
                    },
                    set: function(n, r) {
                        var i = e(n).css("transform") || new a;
                        i.setFromString(t, r);
                        e(n).css({
                            transform: i
                        })
                    }
                }
            }
            function p(e) {
                return e.replace(/([A-Z])/g, function(e) {
                    return "-" + e.toLowerCase()
                }
                )
            }
            function d(e, t) {
                if (typeof e === "string" && !e.match(/^[\-0-9\.]+$/)) {
                    return e
                } else {
                    return "" + e + t
                }
            }
            function v(t) {
                var n = t;
                if (e.fx.speeds[n]) {
                    n = e.fx.speeds[n]
                }
                return d(n, "ms")
            }
            e.transit = {
                version: "0.1.3",
                propertyMap: {
                    marginLeft: "margin",
                    marginRight: "margin",
                    marginBottom: "margin",
                    marginTop: "margin",
                    paddingLeft: "padding",
                    paddingRight: "padding",
                    paddingBottom: "padding",
                    paddingTop: "padding"
                },
                enabled: true,
                useTransitionEnd: false
            };
            var t = document.createElement("div");
            var n = {};
            var s = navigator.userAgent.toLowerCase().indexOf("chrome") > -1;
            n.transition = r("transition");
            n.transitionDelay = r("transitionDelay");
            n.transform = r("transform");
            n.transformOrigin = r("transformOrigin");
            n.transform3d = i();
            e.extend(e.support, n);
            var o = {
                MozTransition: "transitionend",
                OTransition: "oTransitionEnd",
                WebkitTransition: "webkitTransitionEnd",
                msTransition: "MSTransitionEnd"
            };
            var u = n.transitionEnd = o[n.transition] || null ;
            t = null ;
            e.cssEase = {
                _default: "ease",
                "in": "ease-in",
                out: "ease-out",
                "in-out": "ease-in-out",
                snap: "cubic-bezier(0,1,.5,1)"
            };
            e.cssHooks.transform = {
                get: function(t) {
                    return e(t).data("transform")
                },
                set: function(t, r) {
                    var i = r;
                    if (!(i instanceof a)) {
                        i = new a(i)
                    }
                    if (n.transform === "WebkitTransform" && !s) {
                        t.style[n.transform] = i.toString(true)
                    } else {
                        t.style[n.transform] = i.toString()
                    }
                    e(t).data("transform", i)
                }
            };
            e.cssHooks.transformOrigin = {
                get: function(e) {
                    return e.style[n.transformOrigin]
                },
                set: function(e, t) {
                    e.style[n.transformOrigin] = t
                }
            };
            h("scale");
            h("translate");
            h("rotate");
            h("rotateX");
            h("rotateY");
            h("rotate3d");
            h("perspective");
            h("skewX");
            h("skewY");
            h("x", true);
            h("y", true);
            a.prototype = {
                setFromString: function(e, t) {
                    var n = typeof t === "string" ? t.split(",") : t.constructor === Array ? t : [t];
                    n.unshift(e);
                    a.prototype.set.apply(this, n)
                },
                set: function(e) {
                    var t = Array.prototype.slice.apply(arguments, [1]);
                    if (this.setter[e]) {
                        this.setter[e].apply(this, t)
                    } else {
                        this[e] = t.join(",")
                    }
                },
                get: function(e) {
                    if (this.getter[e]) {
                        return this.getter[e].apply(this)
                    } else {
                        return this[e] || 0
                    }
                },
                setter: {
                    rotate: function(e) {
                        this.rotate = d(e, "deg")
                    },
                    rotateX: function(e) {
                        this.rotateX = d(e, "deg")
                    },
                    rotateY: function(e) {
                        this.rotateY = d(e, "deg")
                    },
                    scale: function(e, t) {
                        if (t === undefined) {
                            t = e
                        }
                        this.scale = e + "," + t
                    },
                    skewX: function(e) {
                        this.skewX = d(e, "deg")
                    },
                    skewY: function(e) {
                        this.skewY = d(e, "deg")
                    },
                    perspective: function(e) {
                        this.perspective = d(e, "px")
                    },
                    x: function(e) {
                        this.set("translate", e, null )
                    },
                    y: function(e) {
                        this.set("translate", null , e)
                    },
                    translate: function(e, t) {
                        if (this._translateX === undefined) {
                            this._translateX = 0
                        }
                        if (this._translateY === undefined) {
                            this._translateY = 0
                        }
                        if (e !== null ) {
                            this._translateX = d(e, "px")
                        }
                        if (t !== null ) {
                            this._translateY = d(t, "px")
                        }
                        this.translate = this._translateX + "," + this._translateY
                    }
                },
                getter: {
                    x: function() {
                        return this._translateX || 0
                    },
                    y: function() {
                        return this._translateY || 0
                    },
                    scale: function() {
                        var e = (this.scale || "1,1").split(",");
                        if (e[0]) {
                            e[0] = parseFloat(e[0])
                        }
                        if (e[1]) {
                            e[1] = parseFloat(e[1])
                        }
                        return e[0] === e[1] ? e[0] : e
                    },
                    rotate3d: function() {
                        var e = (this.rotate3d || "0,0,0,0deg").split(",");
                        for (var t = 0; t <= 3; ++t) {
                            if (e[t]) {
                                e[t] = parseFloat(e[t])
                            }
                        }
                        if (e[3]) {
                            e[3] = d(e[3], "deg")
                        }
                        return e
                    }
                },
                parse: function(e) {
                    var t = this;
                    e.replace(/([a-zA-Z0-9]+)\((.*?)\)/g, function(e, n, r) {
                        t.setFromString(n, r)
                    }
                    )
                },
                toString: function(e) {
                    var t = [];
                    for (var r in this) {
                        if (this.hasOwnProperty(r)) {
                            if (!n.transform3d && (r === "rotateX" || r === "rotateY" || r === "perspective" || r === "transformOrigin")) {
                                continue
                            }
                            if (r[0] !== "_") {
                                if (e && r === "scale") {
                                    t.push(r + "3d(" + this[r] + ",1)")
                                } else if (e && r === "translate") {
                                    t.push(r + "3d(" + this[r] + ",0)")
                                } else {
                                    t.push(r + "(" + this[r] + ")")
                                }
                            }
                        }
                    }
                    return t.join(" ")
                }
            };
            e.fn.transition = e.fn.transit = function(t, r, i, s) {
                var o = this;
                var a = 0;
                var l = true;
                if (typeof r === "function") {
                    s = r;
                    r = undefined
                }
                if (typeof i === "function") {
                    s = i;
                    i = undefined
                }
                if (typeof t.easing !== "undefined") {
                    i = t.easing;
                    delete t.easing
                }
                if (typeof t.duration !== "undefined") {
                    r = t.duration;
                    delete t.duration
                }
                if (typeof t.complete !== "undefined") {
                    s = t.complete;
                    delete t.complete
                }
                if (typeof t.queue !== "undefined") {
                    l = t.queue;
                    delete t.queue
                }
                if (typeof t.delay !== "undefined") {
                    a = t.delay;
                    delete t.delay
                }
                if (typeof r === "undefined") {
                    r = e.fx.speeds._default
                }
                if (typeof i === "undefined") {
                    i = e.cssEase._default
                }
                r = v(r);
                var h = c(t, r, i, a);
                var p = e.transit.enabled && n.transition;
                var d = p ? parseInt(r, 10) + parseInt(a, 10) : 0;
                if (d === 0) {
                    var m = function(e) {
                        o.css(t);
                        if (s) {
                            s()
                        }
                        e()
                    }
                    ;
                    f(o, l, m);
                    return o
                }
                var g = {};
                var y = function(r) {
                    var i = false;
                    var a = function() {
                        if (i) {
                            o.unbind(u, a)
                        }
                        if (d > 0) {
                            o.each(function() {
                                this.style[n.transition] = g[this] || null 
                            }
                            )
                        }
                        if (typeof s === "function") {
                            s.apply(o)
                        }
                        if (typeof r === "function") {
                            r()
                        }
                    }
                    ;
                    if (d > 0 && u && e.transit.useTransitionEnd) {
                        i = true;
                        o.bind(u, a)
                    } else {
                        window.setTimeout(a, d)
                    }
                    o.each(function() {
                        if (d > 0) {
                            this.style[n.transition] = h
                        }
                        e(this).css(t)
                    }
                    )
                }
                ;
                var b = function(e) {
                    var t = 0;
                    if (n.transition === "MozTransition" && t < 25) {
                        t = 25
                    }
                    window.setTimeout(function() {
                        y(e)
                    }
                    , t)
                }
                ;
                f(o, l, b);
                return this
            }
            ;
            e.transit.getTransitionValue = c
        }
        )(jQuery)
    }
    (t.exports, t, e);
    e.____MODULES["bef865947dd487135872ba9b505506e3"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "0ad4f09dfd96908df2f3d29b36444953",
        filename: "jquery.jvalidForm.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(e, t, n) {
        (function(e, t, n) {
            function d(e) {
                if (e && e.name) {
                    var t = e.name;
                    if (p[t]) {
                        Utils.log("Checker " + t + " has been override.")
                    }
                    p[t] = e
                }
            }
            function v(e) {
                return p[e]
            }
            function g(e) {
                return !e.is(":disabled") && e.is(":visible")
            }
            function b(e) {
                e = e || {};
                var t = {}
                  , n = {};
                $.each(y.split(" "), function(r, i) {
                    if (e[i]) {
                        t[i] = e[i]
                    }
                    if (e["each_" + i]) {
                        n[i] = e["each_" + i]
                    }
                }
                );
                return {
                    each: n,
                    group: t
                }
            }
            function w(e) {
                for (var t = 0, n = e.length; t < n; t++) {
                    if (!e[t]) {
                        return false
                    }
                }
                return true
            }
            function E(e, t) {
                var n = e.data("YSELECTOR");
                if (e.data(o) && n && n.option("input").is(":visible")) {
                    e.jvalid({
                        checkIt: function() {
                            return true
                        },
                        reader: function() {
                            return n.val()
                        },
                        onchecked: function(e, t) {
                            var r = n.option("jquery");
                            if (e) {
                                r.jvalidTip("reset")
                            } else {
                                r.jvalidTip(t);
                                r.removeClass("e_error");
                                r.jvalidTip("width")
                            }
                        }
                    })
                } else if (e.data("placeholder")) {
                    e.jvalid({
                        reader: function() {
                            return e[0].isPlaceHolderEmpty && e[0].isPlaceHolderEmpty() ? "" : e.val()
                        }
                    })
                } else {
                    e.jvalid(t)
                }
            }
            var r = "DEFAULT_CHECKER"
              , i = "THANK_YOU_FOR_CHOICE"
              , s = "jvalid"
              , o = "jvalid-ruler"
              , u = "[data-jvalid-ruler]";
            var a = t.Deferred
              , f = t.trim
              , l = t.noop
              , c = t.each
              , h = function(e) {
                return Object.prototype.toString.call(e).slice(8, 9)
            }
              , p = {};
            t.extend({
                checker: {
                    addItem: d,
                    getItem: v
                }
            });
            p[r] = {
                name: r,
                message: i,
                check: function(e, t) {
                    t.result(true)
                }
            };
            var m = function() {}
            ;
            m.prototype = {
                _getNext: function() {
                    var e = this
                      , t = e._i + 1;
                    e._c = e._l[t] ? p[e._l[t]] : null ;
                    if (!e._c && e._l[t]) {
                        Utils.log("Checker " + e._l[t] + " do not exsit.")
                    }
                    e._i = t;
                    return e._c
                },
                _checkNext: function() {
                    var e = this;
                    if (e._isChecked()) {
                        return
                    }
                    var t = e._getNext();
                    if (t) {
                        t.check(e._txt, this);
                        return true
                    }
                    return false
                },
                _checked: function() {
                    var e = this;
                    if (!e._c) {
                        return
                    }
                    var t = e._c.name;
                    e._t[t] = 1
                },
                _isChecked: function() {
                    var e = this;
                    if (!e._c) {
                        return false
                    }
                    var t = e._c.name;
                    return !!e._t[t]
                },
                _formatRuler: function(e) {
                    var t = h(e)
                      , n = this;
                    if (t === "S") {
                        n._l = f(e).split(/ +/)
                    } else {
                        n._l = t === "A" ? e : []
                    }
                },
                check: function(e, t, n) {
                    var r = this;
                    n = n || {};
                    r._oncheck = n.oncheck || l;
                    r._onchecked = n.onchecked || l;
                    r._ontimeout = n.ontimeout || l;
                    r._timeout = parseInt(n.timeout, 10) || 0;
                    r._extend = n.extend || l;
                    r._formatRuler(e);
                    r._t = [];
                    r._d = a();
                    r._txt = t;
                    r._c = null ;
                    r._r = -1;
                    r._i = -1;
                    r._oncheck();
                    r._d.promise(r);
                    r.done(function(e) {
                        if (e === -2) {
                            r._ontimeout(e)
                        } else {
                            r._onchecked(e, r._c ? r._c.message : "");
                            r._extend(e, r)
                        }
                        r._r = Number(e)
                    }
                    );
                    if (r._timeout) {
                        setTimeout(function() {
                            if (r._r === -1) {
                                r.end(-2)
                            }
                        }
                        , r._timeout)
                    }
                    r.next(true)
                },
                status: function() {
                    return this._r
                },
                next: function(e) {
                    var t = this;
                    if (!t._checkNext()) {
                        t.end(e)
                    }
                    t._checked()
                },
                result: function(e) {
                    var t = this;
                    if (e && t._checkNext()) {
                        return
                    } else {
                        t.end(e)
                    }
                    t._checked()
                },
                end: function(e) {
                    var t = this;
                    if (t._r !== -1) {
                        return
                    }
                    t._d.resolve(e)
                }
            };
            t.jvalid = {
                each: {},
                group: {}
            };
            t.fn.jvalid = function(e) {
                return this.each(function() {
                    var n = $(this);
                    e = $.extend({}, t.jvalid.each, e);
                    var r = e.checkIt || g;
                    if (!r(n)) {
                        n.data(s, null );
                        return
                    }
                    var i = n.data(s);
                    if (!i) {
                        i = new m;
                        n.data(s, i)
                    }
                    var u = n.data(o), a = {}, f;
                    if (h(e.reader) === "F") {
                        f = e.reader(n)
                    } else {
                        f = n.val();
                        if (this.isPlaceHolderEmpty && this.isPlaceHolderEmpty()) {
                            f = ""
                        }
                    }
                    $.each(e, function(e, t) {
                        if (typeof t === "function") {
                            a[e] = function() {
                                t.apply(n, [].slice.apply(arguments))
                            }
                        } else {
                            a[e] = t
                        }
                    }
                    );
                    i.checkNode = this;
                    i.check(u, f, a);
                    i.checkNode = null 
                }
                )
            }
            ;
            var y = "oncheck onchecked ontimeout timeout extend";
            t.jvalid.each = {
                onchecked: function(e, t) {
                    var n = this;
                    if (e) {
                        n.jvalidTip("correct")
                    } else {
                        n.jvalidTip(t)
                    }
                }
            };
            t.fn.jvalidForm = function(e) {
                var t = b(e);
                this.each(function() {
                    var e = $(this);
                    if (!e.is("form")) {
                        return
                    }
                    e.delegate(u, "focusout." + s, function(e) {
                        var n = e.target
                          , r = $(n);
                        $(n).jvalid(t.each)
                    }
                    );
                    var n = $.fn.yselector;
                    if (n) {
                        $(n.events).bind("blur." + s, function(e, n, r, i) {
                            E(i, t.each)
                        }
                        )
                    }
                    e.submit(function() {
                        if (t.group.oncheck) {
                            if (t.group.oncheck.call(null ) === false) {
                                return
                            }
                        }
                        var e = [];
                        $(u).map(function(n, r) {
                            var i = $(r);
                            E(i, t.each);
                            var o = i.data(s);
                            if (o) {
                                e.push(o)
                            }
                        }
                        );
                        $.when.apply(null , e).then(function() {
                            var e = w(arguments);
                            if (t.group.onchecked) {
                                t.group.onchecked.call(null , e)
                            }
                        }
                        )
                    }
                    )
                }
                );
                return this
            }
        }
        )(this, jQuery)
    }
    (t.exports, t, e);
    e.____MODULES["0ad4f09dfd96908df2f3d29b36444953"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "687c1f14ac4951dddf447ea89d1d67b6",
        filename: "jquery.jvalidtip.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(e, t, n) {
        (function(e) {
            e.fn.jvalidTip = function(t) {
                return this.each(function() {
                    var n = e(this);
                    var r = n.parent();
                    var i = n.data("tipper");
                    if (t === "correct") {
                        n.jvalidTip("reset");
                        r.addClass("e_correct")
                    } else if (t === "reset") {
                        if (i) {
                            i.hide()
                        }
                        r.removeClass("e_error e_correct disble textbox_disable")
                    } else if (t === "disable") {
                        n.jvalidTip("reset");
                        n.addClass("disble");
                        r.addClass("textbox_disable")
                    } else if (t === "width") {
                        var s = r.outerWidth();
                        i.find(".inner").css("width", s)
                    } else {
                        r.removeClass("e_correct").addClass("e_error");
                        if (!i) {
                            var s = r.outerWidth();
                            i = e(['<div class="e_error_notice" style="z-index:12">', '    <div class="inner" style="width:106px;">', '        <div class="box orange_layer">', '            <div class="jt_layer"><cite class="bot"></cite><cite class="top"></cite></div>', '            <div class="content"></div>', "        </div>", "    </div>", "</div>"].join(""));
                            n.data("tipper", i);
                            i.find(".inner").css("width", s);
                            r.before(i)
                        }
                        i.find(".content").text(t);
                        i.show()
                    }
                }
                )
            }
        }
        )(jQuery)
    }
    (t.exports, t, e);
    e.____MODULES["687c1f14ac4951dddf447ea89d1d67b6"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "fb54b3a06596b92c40cf7ebad73651b3",
        filename: "checkers.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(e, t, n) {
        (function(e) {
            "use strict";
            function n(e) {
                return /^\w+([-+.]\w+)*@\w+([-.]\w+)*\.\w+([-.]\w+)*$/.test(e)
            }
            function r(e) {
                return /^1\d{10}$/.test(e)
            }
            function i(e) {
                return !!Utils.resolveIdentityCard(e)
            }
            function s(e) {
                return i(e) && !Utils.deptDateis2013(e)
            }
            function o(e) {
                var t = /^([12]\d{3})(\-)(\d{2})\-(\d{2})$/
                  , n = t.exec(e);
                if (!n) {
                    return false
                }
                var r = n[1] | 0
                  , i = n[3] | 0
                  , s = n[4] | 0;
                if (i > 12 || i < 1 || s < 1 || s > 31) {
                    return false
                }
                return (new Date(r,i - 1,s)).getDate() === s
            }
            function u(e) {
                var t = 0
                  , n = /[^\x00-\xff]/
                  , r = e.split("");
                for (var i = 0; i < r.length; i++) {
                    if (n.test(r[i])) {
                        t += 2
                    } else {
                        t += 1
                    }
                }
                return t
            }
            var t = "一-龥-";
            e.checker.addItem({
                name: "allow_empty",
                message: "",
                check: function(t, n) {
                    t = e.trim(t);
                    if (t) {
                        n.next(false)
                    } else {
                        n.end(true)
                    }
                }
            });
            e.checker.addItem({
                name: "empty",
                message: "不能为空",
                check: function(t, n) {
                    t = e.trim(t);
                    if (t) {
                        n.result(true)
                    } else {
                        n.result(false)
                    }
                }
            });
            e.checker.addItem({
                name: "name_character",
                message: "请输入正确姓名",
                check: function(t, n) {
                    t = e.trim(t);
                    var r = t.length;
                    for (var i = 0; i < r; i++) {
                        if (/[\u4e00-\u9fa5\ue844-\ue863a-z \/]/i.test(t.charAt(i))) {
                            continue
                        } else {
                            this.message = "提示：姓名中不能包含“" + t.charAt(i) + "”";
                            return n.result(false)
                        }
                    }
                    n.result(true)
                }
            });
            e.checker.addItem({
                name: "name_character2",
                message: "乘机人姓名不能以“/”开头或结尾",
                check: function(t, n) {
                    t = e.trim(t);
                    n.result(!/^\/|\/$/.test(t))
                }
            });
            e.checker.addItem({
                name: "ch_name",
                message: "您输入的格式不正确，拼音后面不能再输入汉字，请用拼音替代",
                check: function(t, n) {
                    t = e.trim(t);
                    if (!/^[\u4e00-\u9fa5\ue844-\ue863].*$/i.test(t)) {
                        n.result(true)
                    } else {
                        if (/^[\u4e00-\u9fa5\ue844-\ue863]+[a-z]*$/i.test(t)) {
                            n.result(true)
                        } else {
                            n.result(false)
                        }
                    }
                }
            });
            e.checker.addItem({
                name: "ch_name1",
                message: "含有中文的姓名中不允许含空格或/，请去掉姓名中的空格或/",
                check: function(t, n) {
                    t = e.trim(t);
                    if (!/^[\u4e00-\u9fa5].*$/i.test(t)) {
                        n.result(true)
                    } else {
                        if (/[\/ ]/i.test(t)) {
                            n.result(false)
                        } else {
                            n.result(true)
                        }
                    }
                }
            });
            e.checker.addItem({
                name: "en_name",
                message: "姓名过短，请输入正确姓名",
                check: function(t, n) {
                    t = e.trim(t);
                    if (/^[\u4e00-\u9fa5].*$/i.test(t)) {
                        n.result(true)
                    } else {
                        if (t.replace("/", "").length < 3) {
                            n.result(false)
                        } else {
                            n.result(true)
                        }
                    }
                }
            });
            e.checker.addItem({
                name: "en_name1",
                message: "英文后不能使用汉字",
                check: function(t, n) {
                    t = e.trim(t);
                    if (/^[\u4e00-\u9fa5\ue844-\ue863].*$/i.test(t)) {
                        n.result(true)
                    } else {
                        if (/[^\/ a-z]/i.test(t)) {
                            n.result(false)
                        } else {
                            n.result(true)
                        }
                    }
                }
            });
            e.checker.addItem({
                name: "en_name2",
                message: '请您严格按照办理登机手续时所持有效证件上的姓名填写。填写英文姓名请在姓与名之间用"/"分隔，并按照证件上的姓名顺序填写。',
                check: function(t, n) {
                    t = e.trim(t);
                    if (/^[\u4e00-\u9fa5\ue844-\ue863].*$/i.test(t)) {
                        n.result(true)
                    } else {
                        if (!/^[a-z]+\/[a-z ]*$/i.test(t)) {
                            n.result(false)
                        } else {
                            n.result(true)
                        }
                    }
                }
            });
            e.checker.addItem({
                name: "toolong",
                message: "您的姓名过长，民航系统无法输入，您输入姓名中前54个字符（包括“/”）或27个汉字即可",
                check: function(e, t) {
                    var n = u(e);
                    if (n > 54) {
                        t.result(false)
                    } else {
                        t.result(true)
                    }
                }
            });
            e.checker.addItem({
                name: "tooslow",
                message: "您输入的姓名过短，中文姓名至少2个字、英文姓名至少3个字母,请严格按照办理登机手续时所持有效证件上的姓名填写。",
                check: function(t, n) {
                    t = e.trim(t);
                    if (/^[\u4e00-\u9fa5\ue844-\ue863].*$/i.test(t)) {
                        n.result(t.length > 1)
                    } else {
                        n.result(t.length > 3)
                    }
                }
            });
            e.checker.addItem({
                name: "strangeword",
                message: "输入中含有生僻字，请换成拼音",
                check: function(t, n) {
                    var r = this;
                    var i = n.checkNode;
                    e.getJSON("http://ws.qunar.com/cnCheck.jsp?callback=?", {
                        p: t
                    }, function(t) {
                        var s = []
                          , o = []
                          , u = []
                          , a = []
                          , f = []
                          , l = -1;
                        e.each(t.result, function(e, t) {
                            var n = t.py.replace(/\d+/g, "");
                            if (t.t === 1) {
                                s.push(t.f);
                                o.push(n);
                                if (l === -1) {
                                    l = e
                                }
                            }
                            f.push(n ? n : t.f);
                            u.push(t.f)
                        }
                        );
                        e(i).data("PINYIN", f);
                        u = u.join("").slice(l);
                        r.message = "您的姓名中包含生僻字“" + s.join("") + "”，请将“" + u + "”用拼音替代。";
                        if (l > 0) {
                            r.message += "如：张艈远，请填写“张yuyuan”。"
                        } else if (l === 0) {
                            r.message += "如：艈远新，请填写“yu/yuanxin”。"
                        }
                        n.result(!s.length)
                    }
                    )
                }
            });
            e.checker.addItem({
                name: "ID",
                message: "身份证号码错误",
                check: function(t, n) {
                    t = e.trim(t);
                    if (i(t)) {
                        n.result(true)
                    } else {
                        n.result(false)
                    }
                }
            });
            e.checker.addItem({
                name: "email",
                message: "email格式错误",
                check: function(t, r) {
                    t = e.trim(t);
                    if (n(t)) {
                        r.result(true)
                    } else {
                        r.result(false)
                    }
                }
            });
            e.checker.addItem({
                name: "ID2013",
                message: "2013年1月1日起，一代身份证不能办理乘机手续，请使用二代身份证或其他有效证件预订及乘机。",
                check: function(t, n) {
                    t = e.trim(t);
                    if (s(t)) {
                        n.result(true)
                    } else {
                        n.result(false)
                    }
                }
            });
            e.checker.addItem({
                name: "international_mobile",
                message: "手机号码错误",
                check: function(t, n) {
                    t = e.trim(t);
                    var i = e(n.checkNode);
                    var s = i.val(t).parents("body").find("input[name=contact_mobile_prenum]");
                    var o = e.trim(s.val());
                    if (t.length > 11 || !/^\d+$/.test(t)) {
                        n.result(false);
                        return
                    }
                    if (o === "86") {
                        if (t === "13800138000") {
                            n.result(false);
                            return
                        }
                        if (r(t)) {
                            n.result(true)
                        } else {
                            n.result(false)
                        }
                    } else {
                        if (!("match" in s.data()) || s.data("match")) {
                            e.ajax({
                                url: "/redirct/mobile/pcheck?phone=" + o + t,
                                cache: false,
                                type: "GET",
                                dataType: "jsonp",
                                async: false,
                                timeout: 1e3,
                                success: function(e) {
                                    if (e.code == 0 || e == null ) {
                                        n.result(true)
                                    } else {
                                        n.result(false)
                                    }
                                },
                                error: function() {
                                    n.result(true)
                                }
                            })
                        } else {
                            n.result(false)
                        }
                    }
                }
            });
            e.checker.addItem({
                name: "mobile",
                message: "手机号码错误",
                check: function(t, n) {
                    t = e.trim(t);
                    if (t === "13800138000") {
                        n.result(false);
                        return
                    }
                    if (r(t)) {
                        n.result(true)
                    } else {
                        n.result(false)
                    }
                }
            });
            e.checker.addItem({
                name: "id2-12",
                message: "此产品仅限儿童(2-12岁)购买",
                check: function(t, n) {
                    t = e.trim(t);
                    var r;
                    if (t.length === 15) {
                        r = "19" + t.substring(6, 12)
                    } else {
                        r = t.substring(6, 14)
                    }
                    r = r.replace(/(\d{4})(\d\d)(\d\d)/, "$1-$2-$3");
                    var i = Utils.toDateTime(r);
                    var s = Utils.toDateTime(r);
                    var o = i.setFullYear(i.getFullYear() + 12);
                    var u = s.setFullYear(s.getFullYear() + 2);
                    if (o > UserStatus.DEPART && u < UserStatus.DEPART) {
                        n.result(true)
                    } else {
                        n.result(false)
                    }
                }
            });
            e.checker.addItem({
                name: "2-12",
                message: "此产品仅限儿童(2-12岁)购买",
                check: function(t, n) {
                    var r = e.trim(t);
                    var i = Utils.toDateTime(r);
                    var s = Utils.toDateTime(r);
                    var o = i.setFullYear(i.getFullYear() + 12);
                    var u = s.setFullYear(s.getFullYear() + 2);
                    if (o > UserStatus.DEPART && u < UserStatus.DEPART) {
                        n.result(true)
                    } else {
                        n.result(false)
                    }
                }
            });
            e.checker.addItem({
                name: "id14d-2y",
                message: "此产品仅限婴儿(14天-2岁)购买",
                check: function(t, n) {
                    t = e.trim(t);
                    var r;
                    if (t.length === 15) {
                        r = "19" + t.substring(6, 12)
                    } else {
                        r = t.substring(6, 14)
                    }
                    r = r.replace(/(\d{4})(\d\d)(\d\d)/, "$1-$2-$3");
                    var i = Utils.toDateTime(r);
                    var s = Utils.toDateTime(r);
                    var o = i.getTime() + 14 * 24 * 3600 * 1e3;
                    var u = s.setFullYear(s.getFullYear() + 2);
                    if (o < UserStatus.DEPART.getTime() && u > UserStatus.DEPART) {
                        n.result(true)
                    } else {
                        n.result(false)
                    }
                }
            });
            e.checker.addItem({
                name: "14d-2y",
                message: "此产品仅限婴儿(14天-2岁)购买",
                check: function(t, n) {
                    t = e.trim(t);
                    var r = t;
                    r = r.replace(/(\d{4})(\d\d)(\d\d)/, "$1-$2-$3");
                    var i = Utils.toDateTime(r);
                    var s = Utils.toDateTime(r);
                    var o = i.getTime() + 14 * 24 * 3600 * 1e3;
                    var u = s.setFullYear(s.getFullYear() + 2);
                    if (o < UserStatus.DEPART.getTime() && u > UserStatus.DEPART) {
                        n.result(true)
                    } else {
                        n.result(false)
                    }
                }
            });
            e.checker.addItem({
                name: "gt12",
                message: "乘机人小于12周岁，请购买儿童票",
                check: function(t, n) {
                    t = e.trim(t);
                    var r = t;
                    if (t.length == 18) {
                        r = t.substring(6, 14);
                        r = r.replace(/(\d{4})(\d\d)(\d\d)/, "$1-$2-$3")
                    }
                    var i = Utils.toDateTime(r);
                    var s = i.setFullYear(i.getFullYear() + 12);
                    if (s < UserStatus.DEPART) {
                        n.result(true)
                    } else {
                        n.result(false)
                    }
                }
            });
            e.checker.addItem({
                name: "gt15",
                message: "乘机人小于2周岁，请购买婴儿票",
                check: function(t, n) {
                    var r = e.trim(t);
                    var i = Utils.toDateTime(r);
                    var s = i.setFullYear(i.getFullYear() + 2);
                    if (s < UserStatus.DEPART) {
                        n.result(true)
                    } else {
                        n.result(false)
                    }
                }
            });
            e.checker.addItem({
                name: "gt15_2",
                message: "婴儿客票建议到航空公司直接预订",
                check: function(t, n) {
                    var r = e.trim(t);
                    var i = Utils.toDateTime(r);
                    var s = i.setFullYear(i.getFullYear() + 2);
                    if (s < UserStatus.DEPART) {
                        n.result(true)
                    } else {
                        n.result(false)
                    }
                }
            });
            e.checker.addItem({
                name: "idgt15",
                message: "乘机人小于2周岁，请购买婴儿票",
                check: function(t, n) {
                    t = e.trim(t);
                    var r;
                    if (t.length === 15) {
                        r = "19" + t.substring(6, 12)
                    } else {
                        r = t.substring(6, 14)
                    }
                    r = r.replace(/(\d{4})(\d\d)(\d\d)/, "$1-$2-$3");
                    var i = Utils.toDateTime(r);
                    var s = i.setFullYear(i.getFullYear() + 2);
                    if (s < UserStatus.DEPART) {
                        n.result(true)
                    } else {
                        n.result(false)
                    }
                }
            });
            e.checker.addItem({
                name: "idgt15_2",
                message: "婴儿客票建议到航空公司直接预订",
                check: function(t, n) {
                    t = e.trim(t);
                    var r;
                    if (t.length === 15) {
                        r = "19" + t.substring(6, 12)
                    } else {
                        r = t.substring(6, 14)
                    }
                    r = r.replace(/(\d{4})(\d\d)(\d\d)/, "$1-$2-$3");
                    var i = Utils.toDateTime(r);
                    var s = i.setFullYear(i.getFullYear() + 2);
                    if (s < UserStatus.DEPART) {
                        n.result(true)
                    } else {
                        n.result(false)
                    }
                }
            });
            e.checker.addItem({
                name: "yt70",
                message: "春秋航空暂不接受70岁(含)以上的成人机票预订。",
                check: function(t, n) {
                    var r = window.is9C;
                    if (r) {
                        t = e.trim(t);
                        var i;
                        if (t.length === 15) {
                            i = "19" + t.substring(6, 12)
                        } else {
                            i = t.substring(6, 14)
                        }
                        i = i.replace(/(\d{4})(\d\d)(\d\d)/, "$1-$2-$3");
                        i = Utils.toDateTime(i);
                        var s = i.setFullYear(i.getFullYear() + 70);
                        var o = new Date(UserStatus.DEPART);
                        o.setHours(0);
                        o.setMinutes(0);
                        if (s > o) {
                            n.result(true)
                        } else {
                            n.result(false)
                        }
                    } else {
                        n.result(true)
                    }
                }
            });
            e.checker.addItem({
                name: "yt70b",
                message: "春秋航空暂不接受70岁(含)以上的成人机票预订。",
                check: function(t, n) {
                    var r = window.is9C;
                    if (r) {
                        var i = e.trim(t);
                        i = Utils.toDateTime(i);
                        var s = i.setFullYear(i.getFullYear() + 70);
                        var o = new Date(UserStatus.DEPART);
                        o.setHours(0);
                        o.setMinutes(0);
                        if (s > o) {
                            n.result(true)
                        } else {
                            n.result(false)
                        }
                    } else {
                        n.result(true)
                    }
                }
            });
            e.checker.addItem({
                name: "date",
                message: "格式必须为yyyy-mm-dd，如2008-02-03",
                check: function(t, n) {
                    var r = e.trim(t);
                    if (o(r)) {
                        n.result(true)
                    } else {
                        n.result(false)
                    }
                }
            });
            e.checker.addItem({
                name: "length20",
                message: "必须少于20个字符",
                check: function(t, n) {
                    var r = e.trim(t);
                    if (r.length > 20) {
                        n.result(false)
                    } else {
                        n.result(true)
                    }
                }
            });
            e.checker.addItem({
                name: "length100",
                message: "长度不能超过100位",
                check: function(t, n) {
                    var r = e.trim(t);
                    if (r.length > 100) {
                        n.result(false)
                    } else {
                        n.result(true)
                    }
                }
            });
            e.checker.addItem({
                name: "passport",
                message: "护照号码格式错误",
                check: function(t, n) {
                    var r = e.trim(t);
                    if (/^[a-zA-Z0-9]{1,20}$/.test(r)) {
                        n.result(true)
                    } else {
                        n.result(false)
                    }
                }
            });
            e.checker.addItem({
                name: "otherID",
                message: "证件号码只能是英文和数字，请去掉中文及其他字符。如军官证：空字第123456号，请填写123456；台胞证：1234567890（B） 请填写1234567890B",
                check: function(t, n) {
                    var r = this;
                    var i = e.trim(t);
                    if (/^[a-zA-Z0-9]{18}$/.test(i)) {
                        if (s(i)) {
                            n.result(true)
                        } else {
                            r.message = "证件类型或证件号码错误";
                            n.result(false)
                        }
                    } else if (/^[a-zA-Z0-9]{1,50}$/.test(i)) {
                        n.result(true)
                    } else {
                        r.message = "证件号码只能是英文和数字，请去掉中文及其他字符。如军官证：空字第123456号，请填写123456；台胞证：1234567890（B） 请填写1234567890B";
                        n.result(false)
                    }
                }
            });
            e.checker.addItem({
                name: "city",
                message: "必须选择行程单或者保单邮寄地址",
                check: function(t, n) {
                    var r = e.trim(t);
                    if (r) {
                        n.result(true)
                    } else {
                        n.result(false)
                    }
                }
            });
            e.checker.addItem({
                name: "mobile_prenum",
                message: "请您输入正确的国家代码",
                check: function(t, n) {
                    function u() {
                        o.jvalid()
                    }
                    var r = e.trim(t);
                    var i = n.checkNode;
                    var s = e(i);
                    var o = s.val(r).parents("li.ct2").find("input[name=contact_phone]");
                    if (r === "")
                        r = i.value = "86";
                    if (/^\d{1,5}$/.test(r)) {
                        if (r === "86") {
                            n.result(true);
                            s.data("match", true);
                            u()
                        } else {
                            e.ajax({
                                url: "/redirct/mobile/psuggest?prenum=" + r,
                                cache: false,
                                type: "GET",
                                dataType: "jsonp",
                                async: false,
                                timeout: 1e3,
                                success: function(e) {
                                    if (e.code == 0 || e == null ) {
                                        n.result(true);
                                        s.data("match", true)
                                    } else {
                                        n.result(false);
                                        s.data("match", false)
                                    }
                                    u()
                                },
                                error: function() {
                                    n.result(true);
                                    s.data("match", true)
                                }
                            })
                        }
                    } else {
                        n.result(false);
                        s.data("match", false);
                        u()
                    }
                }
            })
        }
        )(jQuery)
    }
    (t.exports, t, e);
    e.____MODULES["fb54b3a06596b92c40cf7ebad73651b3"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "6fced91ae0f26ad2328764bd973046f7",
        filename: "base.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        e.____MODULES["57cdcc7110ade8a32a1a21345a56e4ab"];
        e.____MODULES["ed363c2895983ed5ec86a2f6ef0f3113"];
        e.____MODULES["ca01f3c708c85165711b9e6acfc1add6"];
        e.____MODULES["fb1f09b371084164351ecbe7c8ebfd62"];
        e.____MODULES["db27d266a7f8f73b8f914fe58f71627c"];
        e.____MODULES["c6dbf6ff3d90430844986c61a4c40a1d"];
        e.____MODULES["fe7f6fdb93582579849997cadec97f2a"];
        e.____MODULES["99224d03bf7a32d30a4e3b483e38a7fe"];
        e.____MODULES["4ec45b60a81506e39517a7d63c215200"];
        e.____MODULES["d19596cf292662d0a77787cc426fc7d3"];
        e.____MODULES["e49a8ad9e2be38b65c14f8488baba241"];
        e.____MODULES["26e08e2404d276130d4d3698b53f8f3a"];
        e.____MODULES["65accefedae979e31e9ba91ac118fc10"];
        e.____MODULES["a40dfa3b9d47360e1f4e570477cde2ba"];
        e.____MODULES["9f1b70254a12910ca876d609712646b5"];
        e.____MODULES["ad05b58af7a3e1c622124b2ca5f09d7a"];
        e.____MODULES["bef865947dd487135872ba9b505506e3"];
        e.____MODULES["0ad4f09dfd96908df2f3d29b36444953"];
        e.____MODULES["687c1f14ac4951dddf447ea89d1d67b6"];
        e.____MODULES["fb54b3a06596b92c40cf7ebad73651b3"]
    }
    (t.exports, t, e);
    e.____MODULES["6fced91ae0f26ad2328764bd973046f7"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "6fe75c4c8f8e88739fe71b3345e93bcc",
        filename: "secureModel.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        function p() {
            switch (u.code) {
            case 19:
                d();
                break;
            case 20:
                v(true);
                break;
            case 21:
                v(false, "error");
                break;
            case 22:
                y();
                break;
            case 23:
                y("error");
                break;
            case 24:
                S();
                break;
            default:
                h(u)
            }
        }
        function d() {
            $.ui.alert(u.msg, {
                ok_call: function() {
                    S()
                }
            });
            o.reset()
        }
        function v(e, t) {
            var n = {
                autoSend: e,
                error: t === "error",
                formid: "js_phonecode_form",
                backid: "js_phonecode_back",
                regetid: "js_phonecode_reget",
                mobilecode: "js_mobilecode",
                errorpannel: "js_phonecode_error"
            };
            N(u.mtoken);
            var r = QTMPL.BookingSecurePhoneCode.render(n);
            var i = E(r);
            m(n, i);
            if (e) {
                var s = $("#" + n.regetid);
                s.click()
            }
            o.reset()
        }
        function m(e, t) {
            $("#" + e.formid).submit(function() {
                var n = $("#" + e.mobilecode).val();
                n = $.trim(n);
                if (!/^\d{6}$/.test(n)) {
                    $("#" + e.errorpannel).removeClass("hide");
                    return false
                }
                t.hide();
                k("mobilecode", n);
                o.submit();
                C();
                return false
            }
            );
            $("#" + e.backid).click(function() {
                t.hide()
            }
            );
            g(e, t)
        }
        function g(e, t) {
            var n = o.contactor.getPnrInfo();
            var r = T(n)["contactMob"];
            var i = T(n)["contactPreNum"];
            var s = $("#" + e.regetid);
            var u = l.init({
                sendButton: s,
                disableClass: "btn_gray_disable",
                remainTime: 59,
                remainHtml: "<b><b>($remainTime秒后)可重新发送验证码</b></b>",
                regetHtml: "<b><b>重新获取验证码</b></b>"
            });
            s.click(function() {
                u.send({
                    url: "/tts/getOrderSecurityCode.json",
                    dataType: "json",
                    method: "POST",
                    param: {
                        mtoken: N() || "",
                        contactMob: r,
                        contactPreNum: i
                    },
                    succeed: function(e) {
                        N(e.mtoken)
                    },
                    faild: function(e) {
                        S()
                    }
                })
            }
            );
            t.setBeforeHideFn(function() {
                u.clr()
            }
            )
        }
        function y(e) {
            var t = {
                error: e === "error",
                timestamp: (new Date).getTime(),
                formid: "js_imagecode_form",
                backid: "js_imagecode_back",
                regetid: "js_imagecode_reget",
                imagecode: "js_imagecode",
                errorpannel: "js_imagecode_error",
                imagecodeid: "js_imagecodeid"
            };
            var n = QTMPL.BookingSecureImageCode.render(t);
            var r = E(n);
            b(t, r);
            o.reset()
        }
        function b(e, t) {
            $("#" + e.backid).click(function() {
                t.hide()
            }
            );
            $("#" + e.formid).submit(function() {
                var n = $("#" + e.imagecode).val();
                n = $.trim(n);
                if (n.length === 0) {
                    $("#" + e.errorpannel).removeClass("hide");
                    return false
                }
                t.hide();
                k("vercodenew", n);
                o.submit();
                C();
                return false
            }
            );
            w(e, t)
        }
        function w(e, t) {
            function i() {
                var e = n.attr("src");
                var t = (new Date).getTime();
                n.attr("src", e.replace(/_=(\d+)$/, "_=" + t))
            }
            var n = $("#" + e.imagecodeid);
            var r = $("#" + e.regetid);
            n.click(function() {
                i()
            }
            );
            r.click(function(e) {
                e.preventDefault();
                i()
            }
            )
        }
        function E(e) {
            var t = $.ui.dialog({
                closeBtn: true,
                isEsc: true
            }).setContent(e);
            t.show().setMiddle();
            return t
        }
        function S() {
            var e = o.data.urlInfo;
            var t = e["flight_type"];
            var n = "http://flight.qunar.com/twell/flight/Search.jsp?from=gntts&";
            var r = {};
            switch (t) {
            case "1":
                r["searchType"] = "OnewayFlight";
                r["fromCity"] = e.from;
                r["toCity"] = e.to;
                r["fromDate"] = x(e.starttime);
                break;
            case "2":
                r["searchType"] = "RoundTripFlight";
                r["fromCity"] = e.dpt;
                r["toCity"] = e.arr;
                r["fromDate"] = x(e.cdeptDate);
                r["toDate"] = x(e.bdeptDate);
                break
            }
            n += $.param(r);
            window.location.href = n
        }
        function x(e) {
            return e.replace(/(\d{4})(\d{2})(\d{2})/, "$1-$2-$3")
        }
        function T(e) {
            var t = {};
            var n = e.split("&");
            $.each(n, function(e, n) {
                var r = n.split("=");
                var i = r[0]
                  , s = r[1];
                t[i] = s || ""
            }
            );
            return t
        }
        function N(e) {
            if (typeof e === "undefined") {
                return a
            }
            a = e
        }
        function C() {
            f = ""
        }
        function k(e, t) {
            f = e + "=" + t
        }
        var i = e.____MODULES["312540359c661f626d6031b9f938e9a2"];
        var s = window.model;
        var o = null ;
        var u = null ;
        var a = null ;
        var f = "";
        var l = new PhoneCode;
        var c = function() {}
        ;
        var h = function() {}
        ;
        var L = i.create();
        L.fn.init = function(e) {
            h = e.callback;
            o = e.bmSubmit;
            u = e.data;
            p()
        }
        ;
        L.fn.getPnrInfo = function() {
            return f
        }
        ;
        s.autoRun.push(function(e) {
            s.dataModel.secureModel = new L(e)
        }
        )
    }
    (t.exports, t, e);
    e.____MODULES["6fe75c4c8f8e88739fe71b3345e93bcc"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "56651e552f7af646f30e83853e831698",
        filename: "index.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        e.____MODULES["6fe75c4c8f8e88739fe71b3345e93bcc"]
    }
    (t.exports, t, e);
    e.____MODULES["56651e552f7af646f30e83853e831698"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "2c2414ef08179d855f17dd8e8df23d65",
        filename: "passengerData.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(e, t, n) {
        function r(e) {
            this._name = "BM_PassengerData";
            this._path = "src/scripts/domestic/user/pageLogic/booking/bm_passengerdata.js";
            this._type = e;
            this._cacheData = null ;
            this.successCallbackTask = [];
            this.failCallbackTask = [];
            this.invoking = false
        }
        $.extend(r.prototype, {
            _getData: function(e) {
                var t = function() {}
                ;
                var n = e.success || t;
                var r = e.fail || t;
                var i = this._type;
                this.successCallbackTask.push(n);
                this.failCallbackTask.push(r);
                if (this.cacheData) {
                    this._doTask(cacheData);
                    return
                }
                if (!this.invoking) {
                    this._invoke(i)
                }
            },
            _invoke: function(e, t, n) {
                var r = this;
                var i = {
                    passenger: "queryconsumer.jsp",
                    contact: "querycontact.jsp",
                    all: "queryallcontact.jsp"
                };
                var s = "http://user.qunar.com/webApi/" + i[e] + "?callback=?";
                $.ajax({
                    type: "GET",
                    url: s,
                    data: "format=js&csrfToken=" + (/csrfToken=([^;]+)/.exec(document.cookie) || [])[1],
                    timeout: 60 * 1e3,
                    dataType: "jsonp",
                    success: function(e) {
                        r._doTask(e);
                        this.cacheData = e
                    },
                    error: function() {
                        r._doTask({});
                        this.cacheData = null 
                    }
                });
                this.invoking = true
            },
            _doTask: function(e) {
                if (e && e.data) {
                    $.each(this.successCallbackTask, function(t, n) {
                        n(e.data)
                    }
                    )
                } else {
                    $.each(this.failCallbackTask, function(t, n) {
                        n(e)
                    }
                    )
                }
                this.successCallbackTask = [];
                this.failCallbackTask = []
            },
            getData: function(e) {
                this._getData(e);
                return this
            }
        });
        window["BM_PassengerData"] = new r("passenger");
        window["BM_ContactData"] = new r("contact")
    }
    (t.exports, t, e);
    e.____MODULES["2c2414ef08179d855f17dd8e8df23d65"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "8c66c344f7c4c50b5de0d128d5abff77",
        filename: "index.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        function s() {
            BM_ContactData.getData({
                success: function(e) {
                    i.trigger("dataready.contactor", [e]);
                    i.trigger("contactdataready.expressinfo", [e])
                },
                fail: function() {
                    i.trigger("loaderror.contactor")
                }
            });
            BM_PassengerData.getData({
                success: function(e) {
                    i.trigger("dataready.passanger", [e])
                },
                fail: function() {
                    i.trigger("loaderror.passanger")
                }
            })
        }
        e.____MODULES["2c2414ef08179d855f17dd8e8df23d65"];
        var i = e.____MODULES["285adc5af3055e36addfeabe5289c690"];
        i.on("success.login", function(e, t) {
            s()
        }
        )
    }
    (t.exports, t, e);
    e.____MODULES["8c66c344f7c4c50b5de0d128d5abff77"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "46829e63382620ab4d60b5b4b9a0dcbe",
        filename: "BookingTips.mustache",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(e, t, n) {
        if (typeof window.QTMPL === "undefined")
            window.QTMPL = {};
        window.QTMPL["BookingTips"] = new window.Hogan.Template(function(e, t, n) {
            var r = this;
            r.b(n = n || "");
            if (r.s(r.f("tips", e, t, 1), e, t, 0, 9, 143, "{{ }}")) {
                r.rs(e, t, function(e, t, r) {
                    r.b('<div class="module_tipbg module_tipbg_pr">');
                    r.b("\n" + n);
                    r.b('    <div class="wrinner">');
                    r.b("\n" + n);
                    r.b('        <p class="waring_text">');
                    r.b(r.t(r.f("tips", e, t, 0)));
                    r.b("</p>");
                    r.b("\n" + n);
                    r.b("    </div>");
                    r.b("\n" + n);
                    r.b("</div>");
                    r.b("\n")
                }
                );
                e.pop()
            }
            return r.fl();
        }
        );
        if (typeof t !== "undefined")
            t.exports = window.QTMPL["BookingTips"]
    }
    (t.exports, t, e);
    e.____MODULES["46829e63382620ab4d60b5b4b9a0dcbe"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "5aeae11ca1ddf2026d293b70f84f15ed",
        filename: "Tips.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        var i = e.____MODULES["312540359c661f626d6031b9f938e9a2"];
        var s = i.create();
        var o = e.____MODULES["285adc5af3055e36addfeabe5289c690"];
        e.____MODULES["46829e63382620ab4d60b5b4b9a0dcbe"];
        s.fn.initialize = function(e) {
            this._name = "BM_Tips";
            this._path = "src/scripts/domestic/user/pageLogic/booking/bm_tips.js";
            this._data = e.originData;
            this._firstTripInfo = this._data.flightInfo[0];
            this.voucherModel = e.voucherModel;
            this._parse();
            this._researchClick()
        }
        ;
        s.fn._researchClick = function() {
            function l() {
                var e = t.roundTrip;
                var r = t.flightInfo[0];
                var i = t.flightInfo[1];
                var u;
                if (e) {
                    u = ["即将为您重新搜索机票:<br>去程：", r.dc, "&nbsp;到&nbsp;", r.ac, "&nbsp;&nbsp;起飞日期：<strong>", s, "</strong><br>回程：", i.dc, "&nbsp;到&nbsp;", i.ac, "&nbsp;&nbsp;起飞日期：<strong>", i.dd, "</strong>"].join("")
                } else {
                    u = ["即将为您重新搜索机票:&nbsp;&nbsp;出发：", r.dc, "&nbsp;&nbsp;到达：", r.ac, "<br>起飞日期：<strong>", s, "</strong>"].join("")
                }
                $.ui.confirm(u, {
                    ok_cls: "btn_blue",
                    ok_call: function() {
                        var e = n._getSearchUrl(s);
                        window.open(e);
                        o.trigger("monitor.behavior", ["reSearch", {}])
                    }
                })
            }
            var e = $("#js_reSearch");
            if (!e[0])
                return;
            var t = this._data;
            var n = this;
            var r = new Date;
            var i = new Date(this._getCTime(r));
            var s = [i.getFullYear(), i.getMonth() + 1, i.getDate()].join("-");
            var u = new Date(i.getFullYear(),i.getMonth(),i.getDate());
            var a = t.flightInfo[0].dd.split("-");
            var f = new Date(a[0],a[1] - 1,a[2]);
            if (+f < +u) {
                e.bind("click", function(e) {
                    e.preventDefault();
                    l()
                }
                )
            } else {
                e.bind("click", function(e) {
                    o.trigger("monitor.behavior", ["reSearch", {}])
                }
                )
            }
        }
        ;
        s.fn._getCTime = function(e) {
            var t = window.SERVER_TIME || new Date;
            var n = window.CLIENT_TIME || new Date;
            return e.getTime() - n.getTime() + t.getTime()
        }
        ;
        s.fn._getSearchUrl = function(e) {
            var t = this._data;
            var n = t.roundTrip ? "RoundTripFlight" : "OnewayFlight";
            var r = t.flightInfo[0].dc;
            var i = t.flightInfo[0].ac;
            var s = e || t.flightInfo[0].dd;
            var o = t.flightInfo[1] ? t.flightInfo[1].ad : t.flightInfo[0].ad;
            var u = ["http://flight.qunar.com/twell/flight/Search.jsp?searchType=", n, "&fromCity=", encodeURIComponent(r), "&toCity=", encodeURIComponent(i), "&fromDate=", s, "&toDate=", o].join("");
            return u
        }
        ;
        s.fn._parse = function(e) {
            var t = {
                tips: null 
            };
            var n = [];
            var r = this._cqFunc()
              , i = this._miaoFunc()
              , s = this._applyFunc()
              , u = this._changeCabinFunc()
              , a = this._priceChangeFunc()
              , f = this._couponFunc()
              , l = this._evfChangeFunc()
              , c = this._evfFunc()
              , h = this._fcdTips();
            if (c) {
                n.push(c)
            }
            n.push(r);
            if (i) {
                n.push(i)
            } else {
                n.push(s);
                if (u) {
                    o.trigger("monitor.behavior", ["changCabinTips", {}]);
                    n.push(u)
                } else {
                    n.push(a)
                }
            }
            if (f) {
                n.push(f)
            }
            if (l) {
                n.push(l)
            }
            if (a) {
                o.trigger("monitor.behavior", ["priceChangeTips", {}])
            }
            if (h) {
                n.push(h)
            }
            var p = [];
            $.each(n, function(e, t) {
                if (t !== "") {
                    t = '<span class="waring_wrapper">' + t + "</span>";
                    p.push(t)
                }
            }
            );
            if (p.length < 1)
                return;
            t.tips = p.join(" ");
            this._render(t)
        }
        ;
        s.fn._priceChangeFunc = function() {
            var e = this._data;
            var t = e.currentPrice || 0;
            var n = e.urlInfo.price || 0;
            var r = t - n;
            var i = e.currentRd || 0;
            var s = e.urlInfo.rd || 0;
            var o = i - s;
            switch (e.priceInfo.prdTag) {
            case "UFF":
                var u = ""
                  , a = "";
                if (o != 0 || r != 0) {
                    u = '优飞币变为<span class="highlight">' + i + "</span>个/成人，";
                    if (r != 0) {
                        a = '舱位价格变为<span class="rmb highlight">&yen;' + t + "</span>/成人，"
                    }
                    return ["很抱歉的通知您，您预订的" + this._getFlightCode() + "航班", a, u, '我们已经为您修改价格信息，您可以继续预订，或者<a id="js_reSearch" target="_blank" href="', this._getSearchUrl(), '">重新搜索</a>。'].join("")
                }
                break;
            case "LCF":
                var f = e.priceInfo.goodsItemPrices.UFD.implicit;
                var l = e.extInfo.ufd;
                var c = 0;
                if (l >= 0) {
                    c = f - l
                }
                var h = "";
                var p = "";
                var d = "";
                if (r != 0 || c != 0) {
                    if (r != 0) {
                        d = "舱位价格";
                        if (r > 0) {
                            h = '升高了<span class="rmb highlight">&yen;' + r + "</span>，";
                            p = "很抱歉的通知您"
                        } else {
                            h = '下降了<span class="rmb highlight">&yen;' + Math.abs(r) + "</span>，";
                            p = "很高兴的通知您"
                        }
                    } else if (c != 0) {
                        d = "可贷金额";
                        if (c > 0) {
                            h = '升高了<span class="rmb highlight">&yen;' + c + "</span>，";
                            p = "很高兴的通知您"
                        } else {
                            h = '减少了<span class="rmb highlight">&yen;' + Math.abs(c) + "</span>，";
                            p = "很抱歉的通知您"
                        }
                    }
                    return [p + "，您预订的" + this._getFlightCode() + "航班" + d, h, "我们已经为您修改价格信息，", '修改后的价格为<span class="highlight rmb">&yen;' + t + '</span>，贷<span class="highlight rmb">&yen;' + f + '</span>，现付<span class="highlight rmb">&yen;' + (t - f) + "</span>，", "您可以继续预订，", '或者<a id="js_reSearch" target="_blank" href="', this._getSearchUrl(), '">重新搜索</a>。'].join("")
                }
                break;
            default:
                return this._defaultPriceChangeFunc()
            }
            return ""
        }
        ;
        s.fn._defaultPriceChangeFunc = function() {
            var e = this._data;
            var t = e.urlInfo
              , n = t.prt
              , r = t.price
              , i = e.sendFlyFund
              , s = {}
              , u = e.flyFundCount || 0
              , a = e.flyFundSwitch
              , f = e.currentPrice
              , l = "low"
              , c = "low"
              , h = ""
              , p = "";
            try {
                s = JSON.parse(e.extInfo.business_exts)
            } catch (d) {}
            if (f === null ) {
                return ""
            }
            if (!r) {
                o.trigger("LOG4J.error", ["url里缺少price参数，请检查"]);
                return ""
            }
            var v = f - r;
            var m = s.ffd || 0;
            var g = u - m;
            o.trigger("LOG4J.info", ["booking过来价格：", r, ";booking过来类型:", n, ";接口回数：pr:", e.priceInfo.pr, "、bpr:", e.priceInfo.bpr]);
            var y = {
                high: {
                    feeling: "抱歉",
                    ms: "升高",
                    "class": "pr_up",
                    d: "且"
                },
                low: {
                    feeling: "高兴",
                    ms: "降低",
                    "class": "pr_down",
                    d: "但"
                }
            };
            if (v > 0) {
                c = "high"
            }
            if (g < 0) {
                l = "high"
            }
            var b = y[l];
            var w = y[c];
            if (this._bprFunc()) {
                p = w["d"] + this._bprFunc() + "，"
            }
            if (a && (m != 0 || i)) {
                var E = ['，我们已经为您修改价格信息，您可以继续预订，或者<a id="js_reSearch" target="_blank" href="', this._getSearchUrl(), '">重新搜索</a>。'].join("");
                var S = '<span class="highlight">' + u + "</span>/成人";
                var x = ["很" + w["feeling"] + "的通知您，您预订的", this._getFlightCode(), "航班舱位<strong>价格" + w["ms"] + "了", '<span class="highlight">' + Math.abs(v) + "</span>元</strong>"].join("");
                var T = [x, E, "<br />本产品支持返飞基金活动。登录购买本产品，实际乘坐后可返飞基金", S + "。"].join("");
                var N = [x, "，本产品无法享受返赠飞基金活动", E].join("");
                var C = [x, "，实际乘坐后可返飞基金" + (g == 0 ? "仍为" : "变为"), S, E].join("");
                if (v === 0) {
                    if (u === 0 && m > 0) {
                        h = ["很抱歉的通知您，由于活动规则调整，本产品无法享受返赠飞基金活动", "，我们已经为您修改飞基金信息", '，您可以继续预订，或者<a id="js_reSearch" target="_blank" href="', this._getSearchUrl(), '">重新搜索</a>。'].join("")
                    } else if (u > 0 && m === 0) {
                        h = ["很高兴的通知您，本产品支持返飞基金活动。登录购买本产品，实际乘坐后可返飞基金", S + "。"].join("")
                    } else if (g != 0) {
                        h = ["很" + b["feeling"] + "的通知您，由于活动规则调整，实际乘坐后可返飞基金变为", S, '，我们已经为您修改飞基金信息，您可以继续预订，或者<a id="js_reSearch" target="_blank" href="', this._getSearchUrl(), '">重新搜索</a>。'].join("")
                    }
                } else {
                    if (u === 0 && m > 0) {
                        h = N
                    } else if (u > 0 && m === 0) {
                        h = T
                    } else {
                        h = C
                    }
                }
            }
            if (h) {
                return h
            }
            if (v === 0) {
                return ""
            }
            var k = null ;
            if (this._data.priceInfo.prdTag == "EVF") {
                k = ["很", w["feeling"], "的通知您，您预订的航班<strong>价格", w["ms"], '了<span class="highlight">', Math.abs(v), "</span>元</strong>，", this._getLijian(), p, "我们已经为您修改价格信息，", this._getVouchersCPMsg(), '您可以继续预订，或者<a id="js_reSearch" target="_blank" href="', this._getSearchUrl(), '">重新搜索</a>。'].join("")
            } else {
                k = ["很", w["feeling"], "的通知您，您预订的" + this._getFlightCode() + "航班舱位<strong>价格", w["ms"], '了<span class="highlight">', Math.abs(v), "</span>元</strong>，", this._getLijian(), p, "我们已经为您修改价格信息，", this._getVouchersCPMsg(), '您可以继续预订，或者<a id="js_reSearch" target="_blank" href="', this._getSearchUrl(), '">重新搜索</a>。'].join("")
            }
            return k
        }
        ;
        s.fn._invoiceFunc = function() {
            var e = this._data.expressInfo;
            var t = this._data;
            if (!t.packingSuccess) {
                if (e && e.isLXInvoice) {
                    if (this._data.carSellResult && this._data.showFPOriginal == false) {
                        return ""
                    }
                    if (this._firstTripInfo.fc === "9C") {
                        return ""
                    }
                    return "您所选购的产品由旅行社提供，仅提供旅行发票做为报销凭证。"
                }
            }
            return ""
        }
        ;
        s.fn._couponFunc = function() {
            var e = this._data.qdhInfo || {};
            var t = this._data.priceInfo.pr;
            var n = this._data.priceInfo.bpr;
            var r = n ? n : t;
            var i = e.couponPrice ? e.couponPrice + "元" : "相应价格的";
            var s = this._data.flightInfo[0];
            var o = s.dd.replace(/-/g, "/") + " " + s.dt;
            var u = new Date(o);
            var a = u.getTime();
            var f = (new Date("2014/08/01")).getTime();
            var l = (new Date("2014/08/31 23:59:59")).getTime();
            var c = a >= f && a <= l ? 30 : 50;
            var h = a > l ? false : true;
            if (e.showQdhCoupon) {
                return "请在页面下方“我的优惠券”处输入短信中的优惠代码，即可在" + r + "元基础上享受" + i + "直减优惠"
            }
            return ""
        }
        ;
        s.fn._evfChangeFunc = function() {
            if (this._data.priceInfo.prdTag == "EVF") {
                var e = this._data.evfInfo.dptTimeRangeStart;
                var t = this._data.evfInfo.dptTimeRangeEnd;
                var n = JSON.parse(this._data.extInfo.business_exts);
                if (e != n.depTime1 || t != n.depTime2) {
                    return ["您预订的航班起飞时间变更为", '<strong><span class="highlight">', dptTimeStartH, " - ", dptTimeEndH, "</span></strong>，", "我们已经为您修改起飞时间信息，", '您可以继续预订，或者<a id="js_reSearch" target="_blank" href="', this._getSearchUrl(), '">重新搜索</a>。'].join("")
                }
            }
            return ""
        }
        ;
        s.fn._bprFunc = function() {
            var e = this._data
              , t = e.priceInfo.bpr
              , n = e.urlInfo
              , r = n.prt
              , i = e.insurInfo.fs;
            if (!t && r && r === "0" && i) {
                return "不含保险的价格已经售完"
            }
            return ""
        }
        ;
        s.fn._cqFunc = function() {
            var e = this._firstTripInfo;
            o.trigger("LOG4J.info", ["航空公司二字码：", e.fc]);
            if (e.fc === "9C") {
                return "您好，根据航空公司规定，本航班无法提供邮寄行程单，如有需要请致电购票代理商，此产品保证真实。"
            }
            return ""
        }
        ;
        s.fn._miaoFunc = function() {
            var e = window.location.host
              , t = {
                "miao.qunar.com": {
                    tips: "去哪儿特惠，此机票为特价机票，不得退改签，行程单机场自取。"
                },
                "okmiao.qunar.com": {
                    tips: "秒杀客票数量有限，售完后系统将限制您支付，你可以在下一时段参与秒杀。<br />如您需要机票行程单，请前往天津长沙机场柜台或奥凯当地营业部自取，咨询电话：4000-668-866"
                }
            };
            o.trigger("LOG4J.info", ["代理商域名：", e]);
            return t[e] ? t[e].tips : ""
        }
        ;
        s.fn._applyFunc = function() {
            var e = this._data.policyInfo;
            var t = e.prt;
            var n = this._data.urlInfo.flight_type || 1;
            var r = this._data.priceInfo.isOta;
            o.trigger("LOG4J.info", ["价格类型", t]);
            var i = e.itp == 1 || n != 1;
            var s = i ? {
                2: "",
                3: "您所购买的是特殊机票产品，代理商无法保证100%申请成功。申请成功后将短信通知您，请您在收到申请成功信息后再支付。此机票行程单票面价格可能会与实际支付价格不同。"
            } : {
                3: "您所购买的是特殊机票产品，代理商无法保证100%申请成功。申请成功后将短信通知您，请您在收到申请成功信息后再支付。"
            };
            if (r) {
                return ""
            }
            return s[t] || ""
        }
        ;
        s.fn._changeCabinFunc = function() {
            var e = this._data
              , t = this._firstTripInfo.cb || ""
              , n = e.urlInfo.cw || ""
              , r = ""
              , i = e.sendFlyFund
              , s = {}
              , u = e.flyFundSwitch
              , a = e.flyFundCount || 0;
            try {
                s = JSON.parse(e.extInfo.business_exts)
            } catch (f) {}
            var l = s.ffd || 0;
            var c = a - l;
            var h = e.currentPrice || 0;
            var p = ['，您可以继续预订，或者<a id="js_reSearch" target="_blank" href="', this._getSearchUrl(), '">重新搜索</a>。'].join("");
            var d = '<span class="highlight">' + a + "</span>/成人";
            var v = ["很抱歉的通知您，您预订的", this._getFlightCode(), '航班舱位<strong>已售完</strong>，我们为您找到了本航班中<strong>最低价<span class="highlight">', h, "</span>元</strong>(", e.flightInfo[0].cbcn, ")", this._getVouchersCWMsg()].join("");
            o.trigger("LOG4J.info", ["booking过来舱位：", n, ";接口回来舱位:", t]);
            if (t.toLowerCase() !== n.toLowerCase()) {
                r = v + p;
                if (u && (l != 0 || i)) {
                    var m = [v, "，由于活动规则调整，本产品无法享受返赠飞基金活动", p].join("");
                    if (a === 0 && l > 0) {
                        r = m
                    } else if (a > 0 && l === 0) {
                        r = [v, p, "<br />本产品支持返飞基金活动。登录购买本产品，实际乘坐后可返飞基金", d + "。"].join("")
                    } else if (c != 0) {
                        r = [v, "，实际乘坐后可返飞基金变为", d, p].join("")
                    }
                }
                return r
            }
            return ""
        }
        ;
        s.fn._getLijian = function() {
            var e = this._data;
            var t = e.priceInfo.cutPrice;
            if (t && t > 0) {
                return ["立减金额为", t, "元/人，"].join("")
            }
            return ""
        }
        ;
        s.fn._getFanxian = function(e, t) {
            var n = this._data.isLow;
            if (n == 0) {
                return ""
            }
            var r = this._data;
            var i = r.priceInfo.fx || 0
              , s = e || "";
            if (e == "onlyChangeFanxian") {
                s = "现在"
            } else {
                s = ""
            }
            if (i || t) {
                return "<strong>返现金额" + s + "为 : <i class='rmb highlight'>&yen;" + i + "</i></strong>&nbsp;"
            } else {
                return ""
            }
        }
        ;
        s.fn._getFlightCode = function() {
            return this._firstTripInfo.co
        }
        ;
        s.fn._render = function(e) {
            var t = QTMPL.BookingTips.render(e);
            $("#js_bookingTips").html(t).removeClass("hide")
        }
        ;
        s.fn._getVouchersCWMsg = function() {
            var e = this.voucherModel.getVouchesInfo();
            if (e.urlCc > 0 && e.nowCc == 0) {
                return '，<span style="color: red;">原' + e.urlCc + "元" + e.vname + "已取消</span>"
            }
            if (e.urlCc == 0 && e.nowCc > 0) {
                return "（含" + e.nowPrice + "元 * " + e.nowCount + "份" + '<a target="_blank" href="/voucher/agreement?type=' + e.type + '">' + e.vname + "</a>" + "）"
            }
            if (e.urlCc > 0 && e.nowCc > 0) {
                return "（含" + e.nowPrice + "元 * " + e.nowCount + "份" + e.vname + "）"
            }
            return ""
        }
        ;
        s.fn._getVouchersCPMsg = function() {
            if (this.voucherModel.getVoucherSaleType() == "2") {
                return ""
            }
            var e = this.voucherModel.getVouchesInfo();
            if (e.urlCc > 0 && e.nowCc == 0) {
                return '，<span style="color: red;">原' + e.urlCc + "元" + e.vname + "已取消</span>，"
            } else if (e.nowCc > 0) {
                return "修改后的价格包括" + e.nowCc + "元（" + e.nowPrice + "元 * " + e.nowCount + "份）的" + e.vname + "，"
            }
            return ""
        }
        ;
        s.fn._evfFunc = function() {
            if (this._data.priceInfo.prdTag == "EVF") {
                return "支付成功后保证出票，具体航班和起降时间将在出票完成后短信通知您。"
            }
            return ""
        }
        ;
        s.fn._fcdTips = function() {
            var e = this._data.priceInfo.prdTag == "LCF";
            if (e) {
                var t = model.dataModel.normalizeModel.goodsItemMap.UFD.implicit;
                var n = this._data.priceInfo.pr;
                var r = this._data.priceInfo.bpr;
                var i = r ? r : n;
                var s = e ? i - t : 0;
                return '此订单属于非常贷活动产品，价值<span class="rmb highlight">&yen;' + i + '</span>。去哪儿网已为您提供<span class="rmb highlight">&yen;' + t + '</span>的非常贷金额，请于6个月内返还。此订单现付金额为<span class="rmb highlight">&yen;' + s + "</span>"
            }
            return ""
        }
        ;
        n.exports = s
    }
    (t.exports, t, e);
    e.____MODULES["5aeae11ca1ddf2026d293b70f84f15ed"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "2e5a68584d2af0b990b5929b2c5d9643",
        filename: "RoundtripTips.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        var i = e.____MODULES["312540359c661f626d6031b9f938e9a2"];
        var s = e.____MODULES["5aeae11ca1ddf2026d293b70f84f15ed"];
        var o = i.create(s);
        o.fn.initialize = function() {
            this._name = "BM_RoundTripTips";
            this._path = "src/scripts/domestic/user/pageLogic/booking/bm_roundtriptips.js"
        }
        ;
        o.fn._parse = function() {
            var e = {
                tips: []
            };
            e.tips.push(this._priceChangeFunc());
            e.tips.push(this._isCZ());
            e.tips.push(this._applyFunc());
            var t = [];
            $.each(e.tips, function(e, n) {
                if (n !== "")
                    t.push(n)
            }
            );
            if (t.length < 1)
                return;
            e.tips = t.join("<br />");
            this._render(e)
        }
        ;
        o.fn._isCZ = function() {
            var e = this._data.urlInfo;
            LOG4J.info("航空公司二字码：", this._firstTripInfo.fc);
            return this._firstTripInfo.fc === "CZ" && e["encode"] ? "不能改期升舱，只能退票!" : ""
        }
        ;
        o.fn._getFlightCode = function() {
            var e = this._data.flightInfo;
            return [e[0].co, e[1].co].join("/")
        }
        ;
        n.exports = o
    }
    (t.exports, t, e);
    e.____MODULES["2e5a68584d2af0b990b5929b2c5d9643"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "817c9ea8e3e8856a5b8ebdf933f97238",
        filename: "index.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        var i = e.____MODULES["285adc5af3055e36addfeabe5289c690"];
        var s = e.____MODULES["2e5a68584d2af0b990b5929b2c5d9643"];
        var o = e.____MODULES["5aeae11ca1ddf2026d293b70f84f15ed"];
        i.on("dataready.datamodel", function(e, t) {
            var n = t.originData;
            var r = n.roundTrip ? new s(t) : new o(t)
        }
        )
    }
    (t.exports, t, e);
    e.____MODULES["817c9ea8e3e8856a5b8ebdf933f97238"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "a9842ead0e267c58ab20484f04037efe",
        filename: "normalizeModel.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        var i = e.____MODULES["285adc5af3055e36addfeabe5289c690"];
        var s = e.____MODULES["312540359c661f626d6031b9f938e9a2"];
        var o = window.model;
        var u = s.create();
        u.fn.initialize = function(e) {
            this.serverData = e;
            this.curPriceTag = this.defaultPriceTag = e.priceInfo.dtTag;
            this.goodsItemMap = e.priceInfo.goodsItemPrices;
            this.parseDtGoodsItem();
            this.normalizeData()
        }
        ;
        u.fn.normalizeData = function(e) {
            var t = this.curPriceTag = e || this.curPriceTag;
            var n = this.serverData;
            var r = n.priceInfo.priceTag;
            var s = r["ADU"];
            var o = this.goodsItemMap;
            var u = n["INS"];
            var a = n["VOU"];
            var f = n.priceInfo;
            var l = this.dtGoodsMap;
            var c = "";
            var h = null ;
            var p = "";
            var d = "";
            var v = 0;
            this.commonGoods = [];
            this.fBindGoods = [];
            if (s) {
                for (var m = 0, g = s.length; m < g; m++) {
                    var y = s[m];
                    if (y.productPackageCode === t) {
                        var b = y.expression.split(/,|\+/) || [];
                        for (var w = 0, E = b.length; w < E; w++) {
                            var S = b[w];
                            var x = "";
                            if ($.inArray(S, y.goodsItemCodes) === -1) {
                                if (S != "CPA_RDD" && S != "CPA_RDA") {
                                    this.commonGoods.push(S)
                                }
                                continue
                            }
                            x = o[S]["goodsCode"];
                            switch (x) {
                            case "INS":
                                p = S;
                                d = y.expression;
                                n.insurInfo = u[S];
                                n.insurInfo.profitsFee = o[S].cut;
                                break;
                            case "VOU":
                                n.voucherInfo = a[S];
                                this.hasVoucher = true;
                                break;
                            case "FJJ":
                                n.sendFlyFund = n.flyFundSwitch;
                                n.flyFundCount = o[S]["implicit"];
                                this.commonGoods.push(x);
                                break;
                            default:
                                if (S != "CPA_RDD" && S != "CPA_RDA") {
                                    this.commonGoods.push(o[S]["goodsCode"])
                                }
                                break
                            }
                        }
                        if (!n.insurInfo && l["INS"]) {
                            n.insurInfo = u[l["INS"]];
                            n.insurInfo.profitsFee = o[l["INS"]].cut;
                            p = l["INS"];
                            d = this.dtGoodsItem
                        }
                        if (p) {
                            var T = new RegExp(",?" + p + "\\+([^,]*)");
                            this.fBindGoods = ((T.exec(d) || [])[1] || "").split("+")
                        }
                        if (!n.voucherInfo && l["VOU"]) {
                            n.voucherInfo = a[l["VOU"]]
                        }
                        if (this.hasGood({
                            priceTag: t,
                            good: "INS",
                            bigClass: true
                        })) {
                            n.urlInfo.prt = "1"
                        }
                        c = y.friend || "";
                        if (c) {
                            h = this.getPriceInfoByTag(c);
                            v = h && h.price;
                            f.pr = Math.min(y.packagePrice, v || Infinity);
                            f.bpr = Math.max(y.packagePrice, v || 0)
                        } else {
                            f.pr = f.bpr = y.packagePrice
                        }
                        break
                    }
                }
            }
            if (r["CHI"] && r["CHI"][0] && r["CHI"][0]["packagePrice"]) {
                f.cpr = r["CHI"][0]["packagePrice"]
            } else {
                f.cpr = 0;
                f.inventory.child = 0
            }
            if (r["INF"] && r["INF"][0] && r["INF"][0]["packagePrice"]) {
                f.ipr = r["INF"][0]["packagePrice"]
            } else {
                f.ipr = 0;
                f.inventory.infant = 0
            }
            this.normalizeTGQData();
            i.trigger("normalizedData.normalizeData", n)
        }
        ;
        u.fn.isHasVoucher = function() {
            return this.hasVoucher
        }
        ;
        u.fn.getFBindGoods = function() {
            return this.fBindGoods
        }
        ;
        u.fn.getCommonGoods = function() {
            return this.commonGoods
        }
        ;
        u.fn.parseDtGoodsItem = function() {
            var e = this.dtGoodsItem = this.serverData.priceInfo.dtGoodsItem || "";
            var t = this.goodsItemMap;
            var n = "";
            this.dtGoodsMap = {};
            if (e) {
                var r = e.split(/,|\+/);
                for (var i = 0, s = r.length; i < s; i++) {
                    n = r[i];
                    if (!t[n]) {
                        continue
                    }
                    this.dtGoodsMap[t[n]["goodsCode"]] = n
                }
            }
        }
        ;
        u.fn.isFBind = function(e) {
            var t = e.priceTag || this.defaultPriceTag
              , n = e.good;
            var r = this.getPriceInfoByFilter({
                filter: {
                    name: "productPackageCode",
                    value: t
                }
            }).expression;
            return r.indexOf("+" + n) > -1 ? true : false
        }
        ;
        u.fn.getPriceInfoByFilter = function(e) {
            e = e || {};
            var t = e.filter;
            var n = t.name;
            var r = t.value;
            var i = r;
            var s = e.passengerType || 1;
            var o = this.serverData;
            var u = o.priceInfo.priceTag;
            var a = null ;
            var f = null ;
            var l = "";
            switch (s + "") {
            case "1":
                a = u["ADU"];
                if (a) {
                    for (var c = 0, h = a.length; c < h; c++) {
                        f = a[c];
                        l = f[n];
                        if (n === "expression") {
                            l = this.sortString(l);
                            i = this.sortString(r)
                        }
                        if (l === i) {
                            return {
                                tag: f.productPackageCode,
                                price: f.packagePrice,
                                expression: f.expression
                            }
                        }
                    }
                }
                return {};
                break;
            case "2":
                a = u["CHI"];
                break;
            case "3":
                a = u["INF"];
                break
            }
            if (a) {
                return {
                    tag: a[0].productPackageCode,
                    price: a[0].packagePrice,
                    expression: ""
                }
            } else {
                return {}
            }
        }
        ;
        u.fn.getPriceInfoBySel = function(e) {
            var t = this.getFBindGoods();
            var n = this.getCommonGoods();
            var r = e.goodsList;
            if (e.INS) {
                t[0] && (r = r.concat(t))
            }
            r = r.concat(n);
            return this.getPriceInfoByFilter({
                passengerType: e.passengerType,
                filter: {
                    name: "expression",
                    value: r.join(",")
                }
            })
        }
        ;
        u.fn.getGoodName = function(e) {
            return this.dtGoodsMap[e]
        }
        ;
        u.fn.hasGood = function(e) {
            if (!e) {
                return false
            }
            var t = e.priceTag || this.curPriceTag
              , n = e.good
              , r = e.bigClass;
            var i = this.goodsItemMap;
            var s = "";
            var o = this.getPriceInfoByFilter({
                filter: {
                    name: "productPackageCode",
                    value: t
                }
            }).expression;
            var u = o.split(/,|\+/);
            for (var a = 0, f = u.length; a < f; a++) {
                s = r && i[u[a]] ? i[u[a]]["goodsCode"] : u[a];
                if (s == n) {
                    return true
                }
            }
            return false
        }
        ;
        u.fn.sortString = function(e) {
            var t = e.split(/,|\+/);
            var n = [];
            var r = this.goodsItemMap;
            var i = "";
            var s = false;
            for (var o = 0, u = t.length; o < u; o++) {
                i = t[o];
                s = i === "CPA_RDA" || i === "CPA_RDD";
                if (s || !r[i]) {
                    n.push(i)
                } else {
                    n.push(r[i]["goodsCode"])
                }
            }
            return n.sort().join(",")
        }
        ;
        u.fn.normalizeTGQData = function() {
            var e = this.curPriceTag;
            var t = this.serverData;
            var n = null ;
            var r = t.tgqInfo;
            for (var i in r) {
                if (i.indexOf(e) != -1) {
                    n = r[i];
                    t["randcInfo"] = n["randcInfo"];
                    t["tgqAdult"] = n["tgqAdult"];
                    break
                }
            }
        }
        ;
        u.fn.setCurPriceTag = function(e) {
            this.curPriceTag = e || this.defaultPriceTag
        }
        ;
        u.fn.getPriceInfoByTag = function(e) {
            return this.getPriceInfoByFilter({
                passengerType: 1,
                filter: {
                    name: "productPackageCode",
                    value: e
                }
            })
        }
        ;
        u.fn.getCurPriceTag = function() {
            return this.curPriceTag || this.defaultPriceTag
        }
        ;
        u.fn.computePriceTag = function(e) {
            var t = o.dataModel.productModel;
            var n = t.productName;
            var r = o.dataModel.passengerInfoModel;
            var i;
            var s;
            if (e) {
                s = e.insures()
            } else {
                s = r.isOneAdultNoInsure()
            }
            switch (n) {
            case "UFF":
                var u = t.getCurSel();
                if (u) {
                    if (!s) {
                        i = "UFF1"
                    } else {
                        if (this.hasVoucher) {
                            i = "UFF2"
                        } else {
                            i = "UFF3"
                        }
                    }
                } else {
                    if (!s) {
                        i = "UFF4"
                    } else {
                        if (this.hasVoucher) {
                            i = "UFF5"
                        } else {
                            i = "UFF6"
                        }
                    }
                }
                break;
            case "LPF":
                if (s) {
                    i = "LPF1"
                } else {
                    i = "LPF2"
                }
                break;
            default:
                break
            }
            return i
        }
        ;
        o.autoRun.push(function(e) {
            o.dataModel.normalizeModel = new u(e)
        }
        )
    }
    (t.exports, t, e);
    e.____MODULES["a9842ead0e267c58ab20484f04037efe"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "ec564127d68765f47596a307f28f0a90",
        filename: "index.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        e.____MODULES["a9842ead0e267c58ab20484f04037efe"]
    }
    (t.exports, t, e);
    e.____MODULES["ec564127d68765f47596a307f28f0a90"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "405484846fde387d26a3f192a1242f7a",
        filename: "ufeeModel.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        var i = e.____MODULES["285adc5af3055e36addfeabe5289c690"];
        var s = e.____MODULES["312540359c661f626d6031b9f938e9a2"];
        var o = window.model;
        var u = s.create();
        u.fn.initialize = function(e) {
            this.serverData = e;
            this.curPriceTag = this.defaultPriceTag = e.extInfo.tag;
            this.goodsItemMap = e.priceInfo.goodsItemPrices || {};
            this.normalizeModel = o.dataModel.normalizeModel;
            this.curSel = false;
            this.checkedTag = e.extTags && e.extTags["checked"];
            this.uncheckedTag = e.extTags && e.extTags["notChecked"];
            if (this.normalizeModel.hasGood({
                good: "CPA_RDD"
            })) {
                this.curSel = true
            }
            this.ufeeCoins = e.currentRd || 0
        }
        ;
        u.fn.getDisTag = function(e) {
            if (e) {
                return this.checkedTag || ""
            }
            return this.uncheckedTag || ""
        }
        ;
        u.fn.getCurSel = function() {
            return this.curSel
        }
        ;
        u.fn.setCurSel = function(e) {
            this.curSel = e
        }
        ;
        u.fn.getUfeeCoins = function() {
            return this.ufeeCoins
        }
        ;
        u.fn.updateData = function(e) {
            this.normalizeModel.normalizeData(e)
        }
        ;
        u.fn.getCurPriceTag = function() {
            return this.normalizeModel.getCurPriceTag()
        }
        ;
        u.fn.getPriceInfoBySel = function(e) {
            var t = [];
            var n = this.normalizeModel;
            e.goodsList = t;
            t.push(this.getCurSel() ? "CPA_RDD" : "CPA_RDA");
            if (e.INS) {
                t.push("INS")
            }
            return n.getPriceInfoBySel(e)
        }
        ;
        i.on("dataready.datamodel", function(e, t) {
            var n = t.originData;
            switch (n.priceInfo.prdTag) {
            case "UFF":
                o.dataModel.productModel = new u(n);
                o.dataModel.productModel.productName = "UFF";
                break
            }
        }
        )
    }
    (t.exports, t, e);
    e.____MODULES["405484846fde387d26a3f192a1242f7a"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "48618eacee0ea65be4ab8e218e228af0",
        filename: "BookingUfeeTip.mustache",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(e, t, n) {
        if (typeof window.QTMPL === "undefined")
            window.QTMPL = {};
        window.QTMPL["BookingUfeeTip"] = new window.Hogan.Template(function(e, t, n) {
            var r = this;
            r.b(n = n || "");
            r.b('<div class="module_tipbg module_tipbg_pr">');
            r.b("\n" + n);
            r.b('    <div class="wrinner" style="overflow:hidden;">');
            r.b("\n" + n);
            r.b('        <p><input class="booking_switch" type="checkbox" ');
            if (r.s(r.f("curSel", e, t, 1), e, t, 0, 162, 169, "{{ }}")) {
                r.rs(e, t, function(e, t, n) {
                    n.b("checked")
                }
                );
                e.pop()
            }
            r.b("/> ");
            r.b("\n" + n);
            r.b('         我自愿参加<a href="http://qcx.trade.qunar.com/tts/ufee/core/explanation" target="_blank">优飞币活动</a>，<!--本订单原价<span class="rmb">&yen;<span class="price">');
            r.b(r.v(r.f("price", e, t, 0)));
            r.b('</span></span>，-->已获得优飞币立抵<span class="rmb highlight">&yen;');
            r.b(r.v(r.f("dkprice", e, t, 0)));
            r.b("</span>。");
            r.b("\n" + n);
            r.b('            <br>&nbsp;&nbsp;&nbsp;&nbsp;若发生退票或改签，将自动取消参与优飞币活动资格。退票时，将从退票款中扣减优飞币抵扣金额<span class="rmb highlight">&yen;');
            r.b(r.v(r.f("dkprice", e, t, 0)));
            r.b('</span>；改签时，将在改签费上加收优飞币抵扣金额<span class="rmb highlight">&yen;');
            r.b(r.v(r.f("dkprice", e, t, 0)));
            r.b("</span>。");
            r.b("\n" + n);
            r.b("        </p>");
            r.b("\n" + n);
            r.b("    </div>");
            r.b("\n" + n);
            r.b("</div>");
            return r.fl();
        }
        );
        if (typeof t !== "undefined")
            t.exports = window.QTMPL["BookingUfeeTip"]
    }
    (t.exports, t, e);
    e.____MODULES["48618eacee0ea65be4ab8e218e228af0"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "d60f1c5e500f8e2ce6aa450da1f79c83",
        filename: "Ufee.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        e.____MODULES["48618eacee0ea65be4ab8e218e228af0"];
        var i = e.____MODULES["285adc5af3055e36addfeabe5289c690"];
        var s = e.____MODULES["312540359c661f626d6031b9f938e9a2"];
        var o = s.create();
        o.fn.initialize = function(e) {
            this.ufeeModel = e.productModel;
            this.serverData = e.originData;
            this.normalizeModel = e.normalizeModel;
            this.tmpl = QTMPL.BookingUfeeTip;
            if (this.serverData.priceInfo.priceTag.ADU.length != 2) {
                this.drawStructure();
                this._bindEvent()
            }
        }
        ;
        o.fn.switchTag = function(e) {
            var t = this.ufeeModel;
            t.updateData(e);
            this.updateView(e)
        }
        ;
        o.fn.updateView = function(e) {
            i.trigger("updateview.broadcast", e)
        }
        ;
        o.fn.drawStructure = function() {
            var e = this;
            var t = e.ufeeModel;
            var n = e.normalizeModel;
            var r = t.getCurPriceTag();
            var i = n.getPriceInfoByTag(r).price || 0;
            var s = t.getUfeeCoins();
            var o = {
                price: i,
                dkprice: s,
                curSel: e.ufeeModel.getCurSel()
            };
            html = e.tmpl.render(o);
            $("#js_ufeesTips").html(html).removeClass("hide")
        }
        ;
        o.fn._bindEvent = function() {
            var e = this;
            var t = e.ufeeModel;
            var n = e.normalizeModel;
            var r = t.getDisTag(true);
            var i = t.getDisTag(false);
            var s = n.getPriceInfoByTag(r).price || 0;
            var o = n.getPriceInfoByTag(i).price || 0;
            var u = t.getUfeeCoins();
            $("#js_ufeesTips").delegate(".booking_switch", "click", function(n) {
                function h(n) {
                    a.prop("checked", n);
                    var s = n ? r : i;
                    t.setCurSel(n);
                    e.switchTag(s)
                }
                var a = $(this);
                var f = a.prop("checked");
                var l = ['<div class="yfyh_tip">', '<h4 class="title">您确定不享受优惠吗？</h4>', '<div class="content">', '<p>参与优飞币活动则享受机票价<span class="rmb em highlight">&yen;' + s + '</span>（已用优飞币立抵<span class="rmb em highlight">&yen;' + u + "</span>）</p>", "<p>取消后将不享受此价格</p>", "</div>", '<p class="gray tj">放弃优惠后该航班机票价格为<span class="rmb em" style="color:#555;">&yen;' + o + "</span></p>", "</div>"].join("");
                if (f) {
                    h(f)
                } else {
                    var c = {
                        ok_txt: "我要享受优惠",
                        ok_cls: "btn_blue",
                        cancel_txt: "放弃优惠",
                        wrapCls: "relat_tip w424",
                        icon: "warn",
                        ok_call: function() {
                            h(true)
                        },
                        cancel_call: function() {
                            h(false)
                        }
                    };
                    $.ui.confirm(l, c)
                }
            }
            )
        }
        ;
        n.exports = o
    }
    (t.exports, t, e);
    e.____MODULES["d60f1c5e500f8e2ce6aa450da1f79c83"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "d245e7e9f12e4073d146dc0e882f06e4",
        filename: "index.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        e.____MODULES["405484846fde387d26a3f192a1242f7a"];
        n.exports = e.____MODULES["d60f1c5e500f8e2ce6aa450da1f79c83"]
    }
    (t.exports, t, e);
    e.____MODULES["d245e7e9f12e4073d146dc0e882f06e4"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "5b64dc726fed3c12841157c5d512592e",
        filename: "lpfModel.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        var i = e.____MODULES["285adc5af3055e36addfeabe5289c690"];
        var s = e.____MODULES["312540359c661f626d6031b9f938e9a2"];
        var o = window.model;
        var u = s.create();
        u.fn.initialize = function(e) {
            this.serverData = e;
            this.normalizeModel = o.dataModel.normalizeModel
        }
        ;
        u.fn.getPriceInfoBySel = function(e) {
            var t = [];
            var n = this.normalizeModel;
            e.goodsList = t;
            t.push("CPA_RDD");
            if (e.INS) {
                t.push("INS")
            }
            return n.getPriceInfoBySel(e)
        }
        ;
        i.on("dataready.datamodel", function(e, t) {
            var n = t.originData;
            switch (n.priceInfo.prdTag) {
            case "LPF":
                o.dataModel.productModel = new u(n);
                o.dataModel.productModel.productName = "LPF";
                break
            }
        }
        )
    }
    (t.exports, t, e);
    e.____MODULES["5b64dc726fed3c12841157c5d512592e"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "daa76be72b683eac33b70a94561a474e",
        filename: "Lpf.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        e.____MODULES["48618eacee0ea65be4ab8e218e228af0"];
        var i = e.____MODULES["285adc5af3055e36addfeabe5289c690"];
        var s = e.____MODULES["312540359c661f626d6031b9f938e9a2"];
        var o = s.create();
        o.fn.initialize = function(e) {
            this.lpfModel = e.productModel
        }
        ;
        n.exports = o
    }
    (t.exports, t, e);
    e.____MODULES["daa76be72b683eac33b70a94561a474e"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "cc9ae53653c6cafec99da022b7438bea",
        filename: "index.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        e.____MODULES["5b64dc726fed3c12841157c5d512592e"];
        n.exports = e.____MODULES["daa76be72b683eac33b70a94561a474e"]
    }
    (t.exports, t, e);
    e.____MODULES["cc9ae53653c6cafec99da022b7438bea"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "45007e05cf4207c26ace0ffe2d0c23af",
        filename: "cpfModel.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        var i = e.____MODULES["285adc5af3055e36addfeabe5289c690"];
        var s = e.____MODULES["312540359c661f626d6031b9f938e9a2"];
        var o = window.model;
        var u = s.create();
        u.fn.initialize = function(e) {
            this.serverData = e;
            this.normalizeModel = o.dataModel.normalizeModel
        }
        ;
        u.fn.getPriceInfoBySel = function(e) {
            var t = [];
            var n = this.normalizeModel;
            e.goodsList = t;
            if (e.INS) {
                t.push("INS")
            }
            return n.getPriceInfoBySel(e)
        }
        ;
        i.on("dataready.datamodel", function(e, t) {
            var n = t.originData;
            switch (n.priceInfo.prdTag) {
            case "CPF":
                o.dataModel.productModel = new u(n);
                o.dataModel.productModel.productName = "CPF";
                break
            }
        }
        )
    }
    (t.exports, t, e);
    e.____MODULES["45007e05cf4207c26ace0ffe2d0c23af"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "596b9fcaa5b5fbab7f48faae68804c14",
        filename: "Cpf.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        e.____MODULES["48618eacee0ea65be4ab8e218e228af0"];
        var i = e.____MODULES["285adc5af3055e36addfeabe5289c690"];
        var s = e.____MODULES["312540359c661f626d6031b9f938e9a2"];
        var o = s.create();
        o.fn.initialize = function(e) {
            this.cpfModel = e.productModel
        }
        ;
        n.exports = o
    }
    (t.exports, t, e);
    e.____MODULES["596b9fcaa5b5fbab7f48faae68804c14"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "665960f1facc7f2fc4bba4870aecfb70",
        filename: "index.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        e.____MODULES["45007e05cf4207c26ace0ffe2d0c23af"];
        n.exports = e.____MODULES["596b9fcaa5b5fbab7f48faae68804c14"]
    }
    (t.exports, t, e);
    e.____MODULES["665960f1facc7f2fc4bba4870aecfb70"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "533f7bda93f949d5ff28149a7c6ad9f3",
        filename: "btfModel.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        var i = e.____MODULES["285adc5af3055e36addfeabe5289c690"];
        var s = e.____MODULES["312540359c661f626d6031b9f938e9a2"];
        var o = window.model;
        var u = s.create();
        u.fn.initialize = function(e) {
            this.serverData = e;
            this.normalizeModel = o.dataModel.normalizeModel
        }
        ;
        u.fn.getPriceInfoBySel = function(e) {
            var t = [];
            var n = this.normalizeModel;
            e.goodsList = t;
            if (e.INS) {
                t.push("INS")
            }
            return n.getPriceInfoBySel(e)
        }
        ;
        i.on("dataready.datamodel", function(e, t) {
            var n = t.originData;
            switch (n.priceInfo.prdTag) {
            case "BTF":
                o.dataModel.productModel = new u(n);
                o.dataModel.productModel.productName = "BTF";
                break
            }
        }
        )
    }
    (t.exports, t, e);
    e.____MODULES["533f7bda93f949d5ff28149a7c6ad9f3"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "47512e21b92f2d74e123e3c6ab8c1933",
        filename: "Btf.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        e.____MODULES["48618eacee0ea65be4ab8e218e228af0"];
        var i = e.____MODULES["285adc5af3055e36addfeabe5289c690"];
        var s = e.____MODULES["312540359c661f626d6031b9f938e9a2"];
        var o = s.create();
        o.fn.initialize = function(e) {
            this.btfModel = e.productModel
        }
        ;
        n.exports = o
    }
    (t.exports, t, e);
    e.____MODULES["47512e21b92f2d74e123e3c6ab8c1933"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "a672c01a0dd44a2e380a1b0efb4c338d",
        filename: "index.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        e.____MODULES["533f7bda93f949d5ff28149a7c6ad9f3"];
        n.exports = e.____MODULES["47512e21b92f2d74e123e3c6ab8c1933"]
    }
    (t.exports, t, e);
    e.____MODULES["a672c01a0dd44a2e380a1b0efb4c338d"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "6fa9d316a8d0e8b9c104e867dc5719fb",
        filename: "lcfModel.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        var i = e.____MODULES["285adc5af3055e36addfeabe5289c690"];
        var s = e.____MODULES["312540359c661f626d6031b9f938e9a2"];
        var o = window.model;
        var u = s.create();
        u.fn.initialize = function(e) {
            this.serverData = e;
            this.normalizeModel = o.dataModel.normalizeModel;
            this.ufdPrice = o.dataModel.normalizeModel.goodsItemMap.UFD.implicit
        }
        ;
        u.fn.getPriceInfoBySel = function(e) {
            var t = [];
            var n = this.normalizeModel;
            e.goodsList = t;
            if (e.INS) {
                t.push("INS")
            }
            return n.getPriceInfoBySel(e)
        }
        ;
        i.on("dataready.datamodel", function(e, t) {
            var n = t.originData;
            switch (n.priceInfo.prdTag) {
            case "LCF":
                o.dataModel.productModel = new u(n);
                o.dataModel.productModel.productName = "LCF";
                break
            }
        }
        )
    }
    (t.exports, t, e);
    e.____MODULES["6fa9d316a8d0e8b9c104e867dc5719fb"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "1e7e41cbd00e8c3ecf6254b98019a945",
        filename: "Lcf.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        var i = e.____MODULES["285adc5af3055e36addfeabe5289c690"];
        var s = e.____MODULES["312540359c661f626d6031b9f938e9a2"];
        var o = s.create();
        o.fn.initialize = function(e) {
            this.lcfModel = e.productModel
        }
        ;
        n.exports = o
    }
    (t.exports, t, e);
    e.____MODULES["1e7e41cbd00e8c3ecf6254b98019a945"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "75cdcdad37870e8cb01cf4645c220816",
        filename: "index.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        e.____MODULES["6fa9d316a8d0e8b9c104e867dc5719fb"];
        n.exports = e.____MODULES["1e7e41cbd00e8c3ecf6254b98019a945"]
    }
    (t.exports, t, e);
    e.____MODULES["75cdcdad37870e8cb01cf4645c220816"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "4b751b15b58a550548b4f0ed130842ed",
        filename: "lafModel.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        var i = e.____MODULES["285adc5af3055e36addfeabe5289c690"];
        var s = e.____MODULES["312540359c661f626d6031b9f938e9a2"];
        var o = window.model;
        var u = s.create();
        u.fn.initialize = function(e) {
            this.serverData = e;
            this.normalizeModel = o.dataModel.normalizeModel
        }
        ;
        u.fn.getPriceInfoBySel = function(e) {
            var t = [];
            var n = this.normalizeModel;
            e.goodsList = t;
            if (e.INS) {
                t.push("INS")
            }
            return n.getPriceInfoBySel(e)
        }
        ;
        i.on("dataready.datamodel", function(e, t) {
            var n = t.originData;
            switch (n.priceInfo.prdTag) {
            case "LAF":
                o.dataModel.productModel = new u(n);
                o.dataModel.productModel.productName = "LAF";
                break
            }
        }
        )
    }
    (t.exports, t, e);
    e.____MODULES["4b751b15b58a550548b4f0ed130842ed"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "9ffb960cb7070c5fd091dfb4b20afe4b",
        filename: "Laf.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        var i = e.____MODULES["285adc5af3055e36addfeabe5289c690"];
        var s = e.____MODULES["312540359c661f626d6031b9f938e9a2"];
        var o = s.create();
        o.fn.initialize = function(e) {
            this.lafModel = e.productModel
        }
        ;
        n.exports = o
    }
    (t.exports, t, e);
    e.____MODULES["9ffb960cb7070c5fd091dfb4b20afe4b"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "2461df866d519f416c81d282fe9f0094",
        filename: "index.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        e.____MODULES["4b751b15b58a550548b4f0ed130842ed"];
        n.exports = e.____MODULES["9ffb960cb7070c5fd091dfb4b20afe4b"]
    }
    (t.exports, t, e);
    e.____MODULES["2461df866d519f416c81d282fe9f0094"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "7ec4b0a2f018ea1c816204bab03f3e6d",
        filename: "evfModel.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        var i = e.____MODULES["285adc5af3055e36addfeabe5289c690"];
        var s = e.____MODULES["312540359c661f626d6031b9f938e9a2"];
        var o = window.model;
        var u = s.create();
        u.fn.initialize = function(e) {
            this.serverData = e;
            this.normalizeModel = o.dataModel.normalizeModel;
            var t = Math.ceil(e.evfInfo.flyTime / 60 * 2) / 2;
            var n = t.toString().split(".");
            var r = n[0] + "小时";
            if (n[1]) {
                r += "30分钟"
            }
            var i = new Date(e.evfInfo.dptTimeRangeStart);
            var s = new Date(e.evfInfo.dptTimeRangeEnd);
            this.dptTimeStartH = this.formatDate(i, "hh:mm");
            this.dptTimeEndH = this.formatDate(s, "hh:mm");
            this.dptRange = this.dptTimeStartH + " - " + (this.dptTimeEndH == "00:00" ? "24:00" : this.dptTimeEndH);
            this.flightDurationStr = r
        }
        ;
        u.fn.formatDate = function(e, t) {
            var n = {
                "M+": e.getMonth() + 1,
                "d+": e.getDate(),
                "h+": e.getHours(),
                "m+": e.getMinutes(),
                "s+": e.getSeconds(),
                "q+": Math.floor((e.getMonth() + 3) / 3),
                S: e.getMilliseconds()
            };
            if (/(y+)/.test(t))
                t = t.replace(RegExp.$1, (e.getFullYear() + "").substr(4 - RegExp.$1.length));
            for (var r in n)
                if ((new RegExp("(" + r + ")")).test(t))
                    t = t.replace(RegExp.$1, RegExp.$1.length == 1 ? n[r] : ("00" + n[r]).substr(("" + n[r]).length));
            return t
        }
        ;
        u.fn.getPriceInfoBySel = function(e) {
            var t = [];
            var n = this.normalizeModel;
            e.goodsList = t;
            if (e.INS) {
                t.push("INS")
            }
            return n.getPriceInfoBySel(e)
        }
        ;
        i.on("dataready.datamodel", function(e, t) {
            var n = t.originData;
            switch (n.priceInfo.prdTag) {
            case "EVF":
                o.dataModel.productModel = new u(n);
                o.dataModel.productModel.productName = "EVF";
                break
            }
        }
        )
    }
    (t.exports, t, e);
    e.____MODULES["7ec4b0a2f018ea1c816204bab03f3e6d"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "d6eee72311b2147e7e39cb731b8765ec",
        filename: "Evf.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        var i = e.____MODULES["285adc5af3055e36addfeabe5289c690"];
        var s = e.____MODULES["312540359c661f626d6031b9f938e9a2"];
        var o = s.create();
        o.fn.initialize = function(e) {
            this.evfModel = e.productModel
        }
        ;
        n.exports = o
    }
    (t.exports, t, e);
    e.____MODULES["d6eee72311b2147e7e39cb731b8765ec"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "b01889629399c8acc4e0b85adc68f465",
        filename: "index.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        e.____MODULES["7ec4b0a2f018ea1c816204bab03f3e6d"];
        n.exports = e.____MODULES["d6eee72311b2147e7e39cb731b8765ec"]
    }
    (t.exports, t, e);
    e.____MODULES["b01889629399c8acc4e0b85adc68f465"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "af9c0b35e2b158a7ea3169d51161307e",
        filename: "defaultModel.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        var i = e.____MODULES["285adc5af3055e36addfeabe5289c690"];
        var s = e.____MODULES["312540359c661f626d6031b9f938e9a2"];
        var o = window.model;
        var u = s.create();
        u.fn.initialize = function(e) {
            this.originData = e;
            this.normalizeModel = o.dataModel.normalizeModel
        }
        ;
        u.fn.getPriceInfoBySel = function(e) {
            var t = [];
            var n = this.normalizeModel;
            var r = this.originData;
            e.goodsList = t;
            switch (r.priceInfo.prdTag) {
            case "FPC":
            case "PEC":
                t.push("CPA_RDD");
                break
            }
            if (e.INS) {
                t.push("INS")
            }
            return n.getPriceInfoBySel(e)
        }
        ;
        i.on("dataready.datamodel", function(e, t) {
            var n = t.originData;
            var r = n.priceInfo.prdTag;
            if (!o.dataModel.productModel) {
                o.dataModel.productModel = new u(n);
                o.dataModel.productModel.productName = r
            }
        }
        )
    }
    (t.exports, t, e);
    e.____MODULES["af9c0b35e2b158a7ea3169d51161307e"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "d41d8cd98f00b204e9800998ecf8427e",
        filename: "Default.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(e, t, n) {}
    (t.exports, t, e);
    e.____MODULES["d41d8cd98f00b204e9800998ecf8427e"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "fdec007c14ca9667867977ce2e1896db",
        filename: "index.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        e.____MODULES["af9c0b35e2b158a7ea3169d51161307e"];
        n.exports = e.____MODULES["d41d8cd98f00b204e9800998ecf8427e"]
    }
    (t.exports, t, e);
    e.____MODULES["fdec007c14ca9667867977ce2e1896db"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "694433edc928e06027b5838a647f5472",
        filename: "product.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        var i = e.____MODULES["285adc5af3055e36addfeabe5289c690"];
        var s = e.____MODULES["312540359c661f626d6031b9f938e9a2"];
        var o = e.____MODULES["d245e7e9f12e4073d146dc0e882f06e4"];
        var u = e.____MODULES["cc9ae53653c6cafec99da022b7438bea"];
        var a = e.____MODULES["665960f1facc7f2fc4bba4870aecfb70"];
        var f = e.____MODULES["a672c01a0dd44a2e380a1b0efb4c338d"];
        var l = e.____MODULES["75cdcdad37870e8cb01cf4645c220816"];
        var c = e.____MODULES["2461df866d519f416c81d282fe9f0094"];
        var c = e.____MODULES["b01889629399c8acc4e0b85adc68f465"];
        e.____MODULES["fdec007c14ca9667867977ce2e1896db"];
        var h = s.create();
        h.fn.initialize = function(e) {
            var t = e.originData;
            switch (t["priceInfo"]["prdTag"]) {
            case "UFF":
                new o(e);
                break;
            case "LPF":
                break;
            case "CPF":
                break;
            case "BTF":
                break
            }
        }
        ;
        n.exports = h
    }
    (t.exports, t, e);
    e.____MODULES["694433edc928e06027b5838a647f5472"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "6a3dab0cb951b473e4628f2f71eb875a",
        filename: "index.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        n.exports = e.____MODULES["694433edc928e06027b5838a647f5472"]
    }
    (t.exports, t, e);
    e.____MODULES["6a3dab0cb951b473e4628f2f71eb875a"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "f9a92d8beff09a7a11de8b098d487f35",
        filename: "BookingStatus.mustache",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(e, t, n) {
        if (typeof window.QTMPL === "undefined")
            window.QTMPL = {};
        window.QTMPL["BookingStatus"] = new window.Hogan.Template(function(e, t, n) {
            var r = this;
            r.b(n = n || "");
            r.b('<div class="inner">');
            r.b("\n" + n);
            r.b('    <p><img src="http://source.qunar.com/tts/images/demo/loader.gif" alt="" /></p>');
            r.b("\n" + n);
            r.b('    <p class="loading_tip">');
            r.b(r.t(r.f("text", e, t, 0)));
            r.b("</p>");
            r.b("\n" + n);
            r.b("</div>");
            return r.fl();
        }
        );
        if (typeof t !== "undefined")
            t.exports = window.QTMPL["BookingStatus"]
    }
    (t.exports, t, e);
    e.____MODULES["f9a92d8beff09a7a11de8b098d487f35"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "9045ea981c4c7a97147a66b15ac55f72",
        filename: "Status.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        var i = e.____MODULES["285adc5af3055e36addfeabe5289c690"];
        var s = e.____MODULES["312540359c661f626d6031b9f938e9a2"];
        e.____MODULES["f9a92d8beff09a7a11de8b098d487f35"];
        var o = s.create();
        o.fn.initialize = function(e) {
            this._name = "BM_Status";
            this.show(e)
        }
        ;
        o.fn.show = function(e) {
            var t = e.utype;
            var n = {
                text: ""
            };
            var r = e.ret;
            if (r === 0 && t === 3) {
                n.text = "你未支付的订单太多了，休息一下再下单吧，要续继下单请联系客服。"
            } else if (r === 2) {
                n.text = '对不起，您预订的航班已经售完，您可以到<a href="http://www.qunar.com" target="_blank">www.qunar.com</a>重新搜索预订!'
            } else if (r === 3) {
                location.href = "/busy?type=booking&ret=" + encodeURIComponent(location.href);
                return
            } else if (r === 4) {
                n.text = "代理商繁忙，稍后下单！"
            } else {
                n.text = "系统繁忙，请稍后再试！"
            }
            var i = QTMPL.BookingStatus.render(n);
            $("#js_bookingMdloading").html(i)
        }
        ;
        n.exports = o
    }
    (t.exports, t, e);
    e.____MODULES["9045ea981c4c7a97147a66b15ac55f72"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "adfadb2be855dffad11464ff93cc2119",
        filename: "index.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        var i = e.____MODULES["9045ea981c4c7a97147a66b15ac55f72"];
        n.exports = i
    }
    (t.exports, t, e);
    e.____MODULES["adfadb2be855dffad11464ff93cc2119"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "cc67ecd2f929668369dcd5b87983f8bd",
        filename: "voucherModel.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        var i = e.____MODULES["285adc5af3055e36addfeabe5289c690"];
        var s = e.____MODULES["312540359c661f626d6031b9f938e9a2"];
        var o = window.model;
        var u = s.create();
        u.fn.initialize = function(e) {
            var t = this;
            this.normalizeModel = o.dataModel.normalizeModel;
            i.on("normalizedData.normalizeData", function(e, n) {
                t._data = n;
                t._voucherInfo = n.voucherInfo || {};
                var r = t._voucherInfo
                  , i = n.urlInfo.ccn;
                r.ccn = i && parseInt(i) || 0;
                r.oldShowVoucher = !!r.ccn
            }
            );
            i.trigger("normalizedData.normalizeData", e);
            t.setDefVouDesc()
        }
        ;
        u.fn.isSaleVoucher = function() {
            return this._voucherInfo.showVoucher === true
        }
        ;
        u.fn.update = function(e) {
            return
        }
        ;
        u.fn.isFBind = function(e) {
            return this.normalizeModel.isFBind({
                good: e
            })
        }
        ;
        u.fn.getUrlVoucher = function() {
            return this._voucherInfo.ccn || 0
        }
        ;
        u.fn.getVoucherName = function() {
            return this._voucherInfo.nameText || ""
        }
        ;
        u.fn.getVoucherURL = function() {
            return this._voucherInfo.picUrl || ""
        }
        ;
        u.fn.getVoucherType = function() {
            return (this._voucherInfo.type || 0) + ""
        }
        ;
        u.fn.isJSJVoucher = function() {
            var e = this.getVoucherType();
            return e > 6 || e == 5
        }
        ;
        u.fn.getVoucherSaleType = function() {
            return (this._voucherInfo.voucherSaleType || 0) + ""
        }
        ;
        u.fn.getBuyforoneTips = function() {
            var e = "";
            e = '<p>赠<span class="pr oringe-tip">&yen;' + this.getVoucherPerPrice() + "</span>超值礼包</p>";
            return e
        }
        ;
        u.fn.getTwoForOneTips = function() {
            var e = this.getVoucherPerPrice();
            var t = this.getVoucherName();
            return ['<p class="tip_content">套餐包含', '<span class="pr oringe-tip">&yen;', e, "</span>", t, "</p>"].join("")
        }
        ;
        u.fn.getVoucherGiftTips = function() {
            var e = this.getVoucherType();
            var t = this.getVoucherPerPrice();
            var n = this.getVoucherName();
            var r = this.getVoucherSaleType();
            return ['<h3 class="h3w">买保险赠超值礼包</h3>', '<p>礼包含<span class="rmb">&yen;' + t + "</span>" + n + "</p>", '<p class="txt-right">', '<a href="http://flight.qunar.com/site/zhuanti/voucher_gift.htm?', "voucherType=" + e, "&voucherPrice=" + t, "&saleType=" + r, "&voucherName=" + encodeURIComponent(n), '" target="_blank">查看详情</a>', "</p>"].join("")
        }
        ;
        u.fn.setDefVouDesc = function() {
            var e = this.getVoucherSaleType();
            switch (e) {
            case "1":
                this.dtVouDesc = "<p>购买本产品可得接送机代金券或服务券，" + "详细使用规则请在购买机票后查看订单详情中的使用规则。</p>";
                break;
            case "2":
                this.dtVouDesc = "<p>1、购买机票+航意险，赠送保险礼包一份，" + "礼包包含接送机代金券，可使用联系人手机号码登录去哪儿客户端-车车-接送用车使用；</p>" + "<p>2、详细使用规则请登录去哪儿客户端-车车查看。</p>";
            default:
                this.dtVouDesc = ""
            }
        }
        ;
        u.fn.getDefVouDesc = function() {
            return this.dtVouDesc
        }
        ;
        u.fn.ajaxGetVouDesc = function(e) {
            var t = this;
            var n = t.isJSJVoucher();
            var r = t.getVoucherType();
            var i = t.getVoucherSaleType();
            var s = n && i == 1;
            var o = t.getDefVouDesc();
            var u = "3w";
            var a = u + "_" + r + "_" + i;
            if (s && t.ajaxGetVouDesc.fetching) {
                return
            } else if (!s || t.voucherDesc) {
                e(t.voucherDesc || "");
                return
            }
            t.ajaxGetVouDesc.fetching = true;
            $.ajax({
                url: "http://ws.qunar.com/voucher/feVoucherAgreement",
                data: {
                    agreementKey: a
                },
                timeout: 500,
                dataType: "jsonp",
                success: function(e) {
                    if (e.ret === 0) {
                        t.voucherDesc = e.data
                    } else {
                        t.voucherDesc = o
                    }
                },
                error: function() {
                    t.voucherDesc = o
                }
            }).always(function() {
                t.ajaxGetVouDesc.fetching = false;
                e(t.voucherDesc)
            }
            )
        }
        ;
        u.fn.getPackVoucherDesc = function() {
            var e = this.getVoucherType();
            return e == "11" ? "接送机代金券礼包1份" : "接送机代金券1张"
        }
        ;
        u.fn.getIfPackVoucherDesc = function() {
            var e = this.getVoucherType();
            return e == "11" ? "包" : ""
        }
        ;
        u.fn.getVoucherPackCount = function() {
            var e = this.getVoucherCount();
            var t = this.getVoucherType();
            if (t == 11) {
                e = 2
            }
            return e
        }
        ;
        u.fn.voucherTipMap = function() {
            var e = {};
            switch (this.getVoucherType()) {
            case "7":
                e = {
                    tpInsTip: "接"
                };
                return e;
            case "8":
                e = {
                    tpInsTip: "送"
                };
                return e;
            case "9":
            case "11":
                if (this.getVoucherSaleType() != 2) {
                    e = {
                        tpInsTip: "接送"
                    }
                }
                return e;
            default:
                return e
            }
        }
        ;
        u.fn.getVoucherPerPrice = function() {
            return this._voucherInfo.perPrice || 0
        }
        ;
        u.fn.getVoucherCount = function() {
            return this._voucherInfo.voucherAmount || 0
        }
        ;
        u.fn.getVoucherTotalCount = function(e) {
            var t = this.getVoucherPerPrice();
            var n = this.getVoucherCount();
            if (t) {
                return n * e / t
            }
            return 0
        }
        ;
        u.fn.getVoucherMoney = function(e) {
            var t = this.getVoucherPerPrice();
            var n = this.getVoucherCount();
            return t * n * e
        }
        ;
        u.fn.getVoucherCut = function() {
            return Math.abs(this._voucherInfo.cut) || 0
        }
        ;
        u.fn.getVouchesInfo = function() {
            var e = this._voucherInfo;
            var t = {
                urlCc: 0,
                nowCc: 0,
                nowCount: 0,
                nowPrice: 0,
                type: e.type,
                vname: this.getVoucherName()
            };
            if (e.oldShowVoucher === true) {
                t.urlCc = this.getUrlVoucher()
            }
            if (e.showVoucher === true) {
                t.nowCc = this.getVoucherMoney(1);
                t.nowCount = this.getVoucherCount();
                t.nowPrice = this.getVoucherPerPrice()
            }
            return t
        }
        ;
        o.autoRun.push(function(e) {
            o.dataModel.voucherModel = new u(e)
        }
        )
    }
    (t.exports, t, e);
    e.____MODULES["cc67ecd2f929668369dcd5b87983f8bd"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "b81526ff831f68e589f9b05d7ca82ebe",
        filename: "index.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        e.____MODULES["cc67ecd2f929668369dcd5b87983f8bd"]
    }
    (t.exports, t, e);
    e.____MODULES["b81526ff831f68e589f9b05d7ca82ebe"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "6b8e9e6af66e23cdae7189c2590a3835",
        filename: "mealsInfoModel.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        var i = e.____MODULES["285adc5af3055e36addfeabe5289c690"];
        var s = e.____MODULES["312540359c661f626d6031b9f938e9a2"];
        var o = window.model;
        var u = s.create();
        u.fn.initialize = function(e) {
            var t = (e.qdhInfo || {}).qdhFoodList;
            this.whtherOfferFood = true;
            this.qdhInfo = {
                qdhFoodList: t
            };
            if (!t || t instanceof Array && t.length === 0) {
                this.whtherOfferFood = false
            }
        }
        ;
        u.fn.getQdhInfo = function() {
            return this.qdhInfo
        }
        ;
        u.fn.getFoodInfo = function() {
            var e = [];
            var t = $(".js-mealsInfoContainer", "#module_foodInfo");
            if (!this.whtherOfferFood) {
                return
            }
            t.find("select").each(function(t, n) {
                var r = $(this).val();
                e.push("foodName=" + r)
            }
            );
            return e.join("&")
        }
        ;
        o.autoRun.push(function(e) {
            o.dataModel.mealsInfoModel = new u(e)
        }
        )
    }
    (t.exports, t, e);
    e.____MODULES["6b8e9e6af66e23cdae7189c2590a3835"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "34f04a5500dcac8f7d62f7050c443ff7",
        filename: "MealsInfo.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        var i = e.____MODULES["285adc5af3055e36addfeabe5289c690"];
        var s = e.____MODULES["312540359c661f626d6031b9f938e9a2"];
        var o = s.create();
        o.fn.initialize = function(e) {
            this.mealsInfoModel = e.mealsInfoModel;
            this.data = this.mealsInfoModel.getQdhInfo();
            if (this.mealsInfoModel.whtherOfferFood) {
                this.jObj = $("#module_foodInfo");
                this._render(this.data);
                this._initDOMSelector();
                this._initEvents();
                this._channelBind()
            }
        }
        ;
        o.fn._channelBind = function() {
            i.on("addfoodinfo.mealsinfo", function(e, t) {
                self.addFoodInfo(t.index, t.pName, t.flag)
            }
            )
        }
        ;
        o.fn._initDOMSelector = function() {
            this.DOM_HASH_ = {
                mealsInfoContainer: $(".js-mealsInfoContainer", this.JDOM())
            }
        }
        ;
        o.fn.addFoodInfo = function(e, t, n) {
            function p(e, t, n) {
                var r = null ;
                if (e === 0) {
                    if (f.find("dd").size() === 0) {
                        r = $(a).appendTo(f).find("select");
                        $("#module_foodInfo").show();
                        r.yselector({
                            onchange: function(e) {
                                var t = e.value;
                                r.val(t)
                            }
                        })
                    } else {
                        r = $(a).insertBefore(f.find("dd:eq(0)")).find("select");
                        r.yselector({
                            onchange: function(e) {
                                var t = e.value;
                                r.val(t)
                            }
                        })
                    }
                } else {
                    r = $(a).appendTo(f).find("select");
                    r.yselector({
                        onchange: function(e) {
                            var t = e.value;
                            r.val(t)
                        }
                    })
                }
            }
            var r = this;
            var i = r.mealsInfoModel;
            var s = [];
            var o = null ;
            var u = {
                pName: t
            };
            var a = null ;
            var f = null ;
            var l = null ;
            if (!i.whtherOfferFood) {
                return
            }
            o = this.data.qdhFoodList;
            f = this.DOM("mealsInfoContainer");
            l = f.find("dd").size();
            for (var c = 0, h = o.length; c < h; c++) {
                s.push({
                    foodName: o[c].foodName,
                    value: o[c].foodName
                })
            }
            u.foodList = s;
            a = QTMPL.BookingFoodSelect.render(u);
            if (n === -1) {
                f.find("dd").each(function(t, n) {
                    if (e === t) {
                        $(this).remove();
                        if (r.DOM("mealsInfoContainer").find("dd").size() === 0) {
                            $("#module_foodInfo").hide()
                        }
                    }
                }
                )
            } else if (n === 1) {
                p(e, t, n)
            } else if (n === 0) {
                if (e >= l) {
                    p(e, t, n)
                } else {
                    f.find("dd").each(function(n, r) {
                        if (e === n) {
                            $(this).find(".pName").text(t)
                        }
                    }
                    )
                }
            }
        }
        ;
        o.fn._render = function(e) {
            var t = this.data.qdhFoodList;
            var n = null ;
            n = QTMPL.BookingMealsInfo.render({
                qdhFoodList: this.data.qdhFoodList
            });
            this.jObj.html(n)
        }
        ;
        o.fn._initEvents = function() {
            this.jObj.find(".js-foodDescriptions").hover(function(e) {
                $(this).next().toggle()
            }
            )
        }
        ;
        o.fn.JDOM = function() {
            return this.jObj
        }
        ;
        o.fn.DOM = function(e) {
            return this.DOM_HASH_[e]
        }
        ;
        n.exports = o
    }
    (t.exports, t, e);
    e.____MODULES["34f04a5500dcac8f7d62f7050c443ff7"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "3578550f71897dcf6279362af4a4992c",
        filename: "index.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        e.____MODULES["6b8e9e6af66e23cdae7189c2590a3835"];
        var i = e.____MODULES["34f04a5500dcac8f7d62f7050c443ff7"];
        n.exports = i
    }
    (t.exports, t, e);
    e.____MODULES["3578550f71897dcf6279362af4a4992c"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "722548beb6d57de27d79bda2ba615856",
        filename: "BookingPriceInfo.mustache",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(e, t, n) {
        if (typeof window.QTMPL === "undefined")
            window.QTMPL = {};
        window.QTMPL["BookingPriceInfo"] = new window.Hogan.Template(function(e, t, n) {
            var r = this;
            r.b(n = n || "");
            r.b('<div class="module_tipbg order_basinfo">');
            r.b("\n" + n);
            r.b("            订单总额：");
            r.b("\n" + n);
            if (r.s(r.f("coupon", e, t, 1), e, t, 0, 74, 141, "{{ }}")) {
                r.rs(e, t, function(e, t, n) {
                    n.b('        <span class="pr clred">&yen;<b>');
                    n.b(n.v(n.f("o_total", e, t, 0)));
                    n.b("</b></span>");
                    n.b("\n")
                }
                );
                e.pop()
            }
            if (!r.s(r.f("coupon", e, t, 1), e, t, 1, 0, 0, "")) {
                r.b('        <span class="pr clred t_prc js-total ');
                if (r.s(r.f("sendFlyFund", e, t, 1), e, t, 0, 230, 239, "{{ }}")) {
                    r.rs(e, t, function(e, t, n) {
                        n.b("m-flyfund")
                    }
                    );
                    e.pop()
                }
                r.b('"><i class="rmb">¥</i>');
                r.b(r.t(r.f("total", e, t, 0)));
                r.b("\n" + n);
                r.b('            <div class="poptip ');
                if (!r.s(r.f("sendFlyFund", e, t, 1), e, t, 1, 0, 0, "")) {
                    r.b("hide")
                }
                r.b('">');
                r.b("\n" + n);
                r.b('                <span class="poptip-arrow poptip-arrow-top"><em>◆</em><i>◆</i></span>');
                r.b("\n" + n);
                r.b("                ");
                if (!r.s(r.f("isLogin", e, t, 1), e, t, 1, 0, 0, "")) {
                    r.b('<a href="javascript:;" class="j-login">登录</a>或<a href="javascript:;" class="j-login">注册</a>购买，')
                }
                r.b('实际乘坐后可获得<i class="rmb">');
                r.b(r.v(r.f("flyFundCount", e, t, 0)));
                r.b('</i>飞基金，下次购买指定产品可抵机票款<i class="rmb">¥');
                r.b(r.v(r.f("flyFundCount", e, t, 0)));
                r.b('</i><i class="i-close hide">x</i>');
                r.b("\n" + n);
                r.b("            </div>");
                r.b("\n" + n);
                r.b("        </span>");
                r.b("\n")
            }
            r.b("    共");
            r.b(r.v(r.f("bodies", e, t, 0)));
            r.b("人(含机票：");
            r.b("\n" + n);
            r.b('        <span class="pr">&yen;');
            r.b(r.v(r.f("ticketPrice", e, t, 0)));
            r.b("\n" + n);
            if (r.s(r.f("islcf", e, t, 1), e, t, 0, 846, 1166, "{{ }}")) {
                r.rs(e, t, function(e, t, r) {
                    r.b('                <div class="module_tipbg js_insure_blog_spec ">');
                    r.b("\n" + n);
                    r.b('                    <div class="right"></div>');
                    r.b("\n" + n);
                    r.b('                    <div class="left"></div>');
                    r.b("\n" + n);
                    r.b('                    <p>机票价<span class="pr oringe-tip">&yen;');
                    r.b(r.v(r.f("ticketCost", e, t, 0)));
                    r.b('</span>，贷<span class="rmb">&yen;');
                    r.b(r.v(r.f("ufdPrice", e, t, 0)));
                    r.b("</span></p>");
                    r.b("\n" + n);
                    r.b("                </div>");
                    r.b("\n")
                }
                );
                e.pop()
            }
            r.b("        </span>");
            r.b("\n" + n);
            if (r.s(r.f("jiJian", e, t, 1), e, t, 0, 1208, 1265, "{{ }}")) {
                r.rs(e, t, function(e, t, n) {
                    n.b('        ，机建：<span class="pr">&yen;');
                    n.b(n.v(n.f("jiJian", e, t, 0)));
                    n.b("</span>");
                    n.b("\n")
                }
                );
                e.pop()
            }
            if (r.s(r.f("ranYou", e, t, 1), e, t, 0, 1292, 1349, "{{ }}")) {
                r.rs(e, t, function(e, t, n) {
                    n.b('        ，燃油：<span class="pr">&yen;');
                    n.b(n.v(n.f("ranYou", e, t, 0)));
                    n.b("</span>");
                    n.b("\n")
                }
                );
                e.pop()
            }
            if (r.s(r.f("insure", e, t, 1), e, t, 0, 1376, 1434, "{{ }}")) {
                r.rs(e, t, function(e, t, n) {
                    n.b('        ，航意险：<span class="pr">&yen;');
                    n.b(n.v(n.f("insure", e, t, 0)));
                    n.b("</span>");
                    n.b("\n")
                }
                );
                e.pop()
            }
            if (r.s(r.f("showHYInsure", e, t, 1), e, t, 0, 1467, 1553, "{{ }}")) {
                r.rs(e, t, function(e, t, n) {
                    n.b("        ");
                    if (n.s(n.f("hyInsure", e, t, 1), e, t, 0, 1489, 1535, "{{ }}")) {
                        n.rs(e, t, function(e, t, n) {
                            n.b('，延误险：<span class="pr">&yen;');
                            n.b(n.v(n.f("hyInsure", e, t, 0)));
                            n.b("</span>")
                        }
                        );
                        e.pop()
                    }
                    n.b("\n")
                }
                );
                e.pop()
            }
            if (r.s(r.f("showCar", e, t, 1), e, t, 0, 1587, 1673, "{{ }}")) {
                r.rs(e, t, function(e, t, n) {
                    n.b("        ");
                    if (n.s(n.f("carPrice", e, t, 1), e, t, 0, 1609, 1655, "{{ }}")) {
                        n.rs(e, t, function(e, t, n) {
                            n.b('，接送机：<span class="pr">&yen;');
                            n.b(n.v(n.f("carPrice", e, t, 0)));
                            n.b("</span>")
                        }
                        );
                        e.pop()
                    }
                    n.b("\n")
                }
                );
                e.pop()
            }
            if (r.s(r.f("delivery", e, t, 1), e, t, 0, 1703, 1763, "{{ }}")) {
                r.rs(e, t, function(e, t, n) {
                    n.b('        ，快递费：<span class="pr">&yen;');
                    n.b(n.v(n.f("delivery", e, t, 0)));
                    n.b("</span>");
                    n.b("\n")
                }
                );
                e.pop()
            }
            if (r.s(r.f("vouchers", e, t, 1), e, t, 0, 1794, 1916, "{{ }}")) {
                r.rs(e, t, function(e, t, n) {
                    if (!n.s(n.f("buyforone", e, t, 1), e, t, 1, 0, 0, "")) {
                        n.b("            ，");
                        n.b(n.v(n.f("voucherName", e, t, 0)));
                        n.b('：<span class="pr">&yen;');
                        n.b(n.v(n.f("vouchers", e, t, 0)));
                        n.b("</span>");
                        n.b("\n")
                    }
                }
                );
                e.pop()
            }
            if (r.s(r.f("ajaxFlyFundComplete", e, t, 1), e, t, 0, 1958, 2147, "{{ }}")) {
                r.rs(e, t, function(e, t, n) {
                    if (n.s(n.f("isCheckFlyFund", e, t, 1), e, t, 0, 1986, 2123, "{{ }}")) {
                        n.rs(e, t, function(e, t, n) {
                            if (n.s(n.f("flyFundToUse", e, t, 1), e, t, 0, 2016, 2097, "{{ }}")) {
                                n.rs(e, t, function(e, t, n) {
                                    n.b('                ，飞基金：<span class="pr">-&yen;');
                                    n.b(n.v(n.f("flyFundToUse", e, t, 0)));
                                    n.b("</span>");
                                    n.b("\n")
                                }
                                );
                                e.pop()
                            }
                        }
                        );
                        e.pop()
                    }
                }
                );
                e.pop()
            }
            r.b("    )");
            r.b("\n" + n);
            r.b('        <span class="hyinsure_tip_container hide js-hyinsure-tip-container">提交订单后立减<span class="cff075b"><span class="rmb">&yen;</span><span class="hyinsure_yh js-hyinsure-yh"></span></span></span>');
            r.b("\n" + n);
            if (r.s(r.f("lifan", e, t, 1), e, t, 0, 2387, 2500, "{{ }}")) {
                r.rs(e, t, function(e, t, n) {
                    n.b('   <span class="c0069ca">支付后立返</span><span class="cff075b">');
                    n.b(n.v(n.f("lifan_price", e, t, 0)));
                    n.b('</span><span class="c0069ca">元</span>');
                    n.b("\n")
                }
                );
                e.pop()
            }
            if (r.s(r.f("exchangelifan", e, t, 1), e, t, 0, 2530, 2661, "{{ }}")) {
                r.rs(e, t, function(e, t, n) {
                    n.b('   <span class="c0069ca">由于航班价格变化，立返金额发生变化，支付后立返</span><span class="cff075b">');
                    n.b(n.v(n.f("lifan_price", e, t, 0)));
                    n.b('</span><span class="c0069ca">元</span>');
                    n.b("\n")
                }
                );
                e.pop()
            }
            if (r.s(r.f("return_money", e, t, 1), e, t, 0, 2701, 2915, "{{ }}")) {
                r.rs(e, t, function(e, t, r) {
                    if (r.s(r.f("showSpecialTips", e, t, 1), e, t, 0, 2721, 2895, "{{ }}")) {
                        r.rs(e, t, function(e, t, r) {
                            r.b('         <span class="orangejt_tips j-hoverElement">');
                            r.b("\n" + n);
                            r.b("            起飞后(");
                            r.b(r.v(r.f("fanxianDate", e, t, 0)));
                            r.b(')返现<span class="prc"><i class="rmb">&yen;</i>');
                            r.b(r.v(r.f("return_money", e, t, 0)));
                            r.b("</span>");
                            r.b("\n" + n);
                            r.b("        </span>");
                            r.b("\n")
                        }
                        );
                        e.pop()
                    }
                }
                );
                e.pop()
            }
            if (r.s(r.f("coupon", e, t, 1), e, t, 0, 2948, 3081, "{{ }}")) {
                r.rs(e, t, function(e, t, n) {
                    n.b('        <span class="pr clred"> - &yen;<b>');
                    n.b(n.v(n.f("coupon", e, t, 0)));
                    n.b('</b></span>(优惠券) = 应付总额：<span class="pr clred">&yen;<b>');
                    n.b(n.v(n.f("total", e, t, 0)));
                    n.b("</b></span>");
                    n.b("\n")
                }
                );
                e.pop()
            }
            if (r.s(r.f("isNotOta", e, t, 1), e, t, 0, 3110, 3327, "{{ }}")) {
                r.rs(e, t, function(e, t, n) {
                    if (!n.s(n.f("ticketTime", e, t, 1), e, t, 1, 0, 0, "")) {
                        if (n.s(n.f("put", e, t, 1), e, t, 0, 3138, 3297, "{{ }}")) {
                            n.rs(e, t, function(e, t, n) {
                                n.b("        <p class=\"sptips\">您所选购的机票属于特殊产品，本产品出票时间较慢请耐心等待。“<a target='_blank' href='http://flight.qunar.com/site/zhuanti/pei.htm'>担保通</a>”全程预订保障，去哪儿都放心。</p>");
                                n.b("\n")
                            }
                            );
                            e.pop()
                        }
                    }
                    n.b(" ");
                    n.b("\n")
                }
                );
                e.pop()
            }
            r.b("    <div ");
            if (!r.s(r.f("ajaxFlyFundComplete", e, t, 1), e, t, 1, 0, 0, "")) {
                r.b('class="hide"')
            }
            r.b(">");
            r.b("\n" + n);
            r.b('        <span class="');
            if (!r.s(r.f("flyFundToUse", e, t, 1), e, t, 1, 0, 0, "")) {
                r.b("hide")
            }
            r.b('"><input type="checkbox" id="useFlyFund" ');
            if (r.s(r.f("isCheckFlyFund", e, t, 1), e, t, 0, 3531, 3538, "{{ }}")) {
                r.rs(e, t, function(e, t, n) {
                    n.b("checked")
                }
                );
                e.pop()
            }
            r.b('/><label for="useFlyFund" class="light">使用');
            r.b(r.v(r.f("flyFundToUse", e, t, 0)));
            r.b('飞基金抵扣<span class="rmb">&yen</span>');
            r.b(r.v(r.f("flyFundToUse", e, t, 0)));
            r.b('</label>&nbsp;<a target="_blank" href="/node/activity/flyfund">什么是飞基金？</a></span>');
            r.b("\n" + n);
            r.b('        <span class="');
            if (r.s(r.f("flyFundToUse", e, t, 1), e, t, 0, 3785, 3789, "{{ }}")) {
                r.rs(e, t, function(e, t, n) {
                    n.b("hide")
                }
                );
                e.pop()
            }
            r.b('"><span class="light">您当前可用飞基金为0，本次无法享受优惠</span>&nbsp;<a target="_blank" href="/node/activity/flyfund">什么是飞基金？</a></span>');
            r.b("\n" + n);
            r.b("    </div>");
            r.b("\n" + n);
            r.b("    <div>");
            r.b("\n" + n);
            r.b("        ");
            if (r.s(r.f("ticketTime", e, t, 1), e, t, 0, 3972, 4023, "{{ }}")) {
                r.rs(e, t, function(e, t, n) {
                    n.b('<span class="another-sptips">');
                    n.b(n.t(n.f("ticketTime", e, t, 0)));
                    n.b("</span>")
                }
                );
                e.pop()
            }
            r.b("\n" + n);
            r.b('        <div class="orangejt_tips voucher-left m-hbaotips j-hoverElement">');
            r.b("\n" + n);
            r.b('            <span class="m-hbao">支付即送<i class="rmb">¥</i>300酒店红包</span>');
            r.b("\n" + n);
            r.b('            <div class="tips_contair j-tipElement">');
            r.b("\n" + n);
            r.b('                <div class="bot"></div>');
            r.b("\n" + n);
            r.b('                <div class="top"></div>');
            r.b("\n" + n);
            r.b('                <div class="tips_content">');
            r.b("\n" + n);
            r.b("                    <p>1、成功获得红包后，进入“我的”→“红包”可查询；</p>");
            r.b("\n" + n);
            r.b("                    <p>2、红包可适用20万家酒店，新用户首单享5折优惠，单次最高优惠200元；</p>");
            r.b("\n" + n);
            r.b("                    <p>3、同一用户（账号/设备/手机号）只能参加本活动一次 ；</p>");
            r.b("\n" + n);
            r.b("                </div>");
            r.b("\n" + n);
            r.b("            </div>            ");
            r.b("\n" + n);
            r.b("        </div>");
            r.b("\n" + n);
            if (r.s(r.f("voucherPack", e, t, 1), e, t, 0, 4627, 5158, "{{ }}")) {
                r.rs(e, t, function(e, t, r) {
                    r.b("            &nbsp;|&nbsp;");
                    r.b("\n" + n);
                    r.b('            <div class="orangejt_tips voucher-left m-jsjtips j-hoverElement">');
                    r.b("\n" + n);
                    r.b('                <span class="font-li">礼</span><span class="m-jsj-voucher"><span class="rmb">&yen;</span>');
                    r.b(r.v(r.f("voucherPrice", e, t, 0)));
                    r.b("接送机代金券");
                    r.b(r.v(r.f("adultCountBuyInsure", e, t, 0)));
                    r.b("张</span>");
                    r.b("\n" + n);
                    r.b('                <div class="tips_contair j-tipElement">');
                    r.b("\n" + n);
                    r.b('                    <div class="bot"></div>');
                    r.b("\n" + n);
                    r.b('                    <div class="top"></div>');
                    r.b("\n" + n);
                    r.b('                    <div class="tips_content">');
                    r.b("\n" + n);
                    r.b("                    </div>");
                    r.b("\n" + n);
                    r.b("                </div>");
                    r.b("\n" + n);
                    r.b("            </div>");
                    r.b("\n")
                }
                );
                e.pop()
            }
            if (r.s(r.f("twoforone", e, t, 1), e, t, 0, 5197, 6128, "{{ }}")) {
                r.rs(e, t, function(e, t, r) {
                    if (r.s(r.f("adultCountBuyInsure", e, t, 1), e, t, 0, 5234, 6095, "{{ }}")) {
                        r.rs(e, t, function(e, t, r) {
                            r.b("                &nbsp;|&nbsp;");
                            r.b("\n" + n);
                            r.b('                <div class="orangejt_tips m-jsjtips j-jsjTip">');
                            r.b("\n" + n);
                            r.b('                    <span class="m-jsj-voucher">订单共包含<span class="rmb">&yen;</span>');
                            r.b(r.v(r.f("totalVoucherPrice", e, t, 0)));
                            r.b(r.v(r.f("voucherName", e, t, 0)));
                            r.b("</span>");
                            r.b("\n" + n);
                            r.b('                    <div class="tips_contair j-tipElement">');
                            r.b("\n" + n);
                            r.b('                        <div class="bot"></div>');
                            r.b("\n" + n);
                            r.b('                        <div class="top"></div>');
                            r.b("\n" + n);
                            r.b('                        <div class="tips_content">');
                            r.b("\n" + n);
                            r.b("                            <div>");
                            r.b("\n" + n);
                            r.b("                                本订单共包含");
                            r.b(r.v(r.f("vCount", e, t, 0)));
                            r.b("份套餐：");
                            r.b("\n" + n);
                            r.b("                            </div>");
                            r.b("\n" + n);
                            r.b('                            <div class="js-content">');
                            r.b("\n" + n);
                            r.b('                                <p class="loading"><img src="http://source.qunar.com/tts/images/demo/ajax-loader.gif" alt=""></p>');
                            r.b("\n" + n);
                            r.b("                            </div>");
                            r.b("\n" + n);
                            r.b("                        </div>");
                            r.b("\n" + n);
                            r.b("                    </div>");
                            r.b("\n" + n);
                            r.b("                </div>");
                            r.b("\n")
                        }
                        );
                        e.pop()
                    }
                }
                );
                e.pop()
            }
            if (r.s(r.f("buyforone", e, t, 1), e, t, 0, 6165, 6799, "{{ }}")) {
                r.rs(e, t, function(e, t, r) {
                    if (r.s(r.f("adultCountBuyInsure", e, t, 1), e, t, 0, 6202, 6766, "{{ }}")) {
                        r.rs(e, t, function(e, t, r) {
                            r.b("                &nbsp;|&nbsp;");
                            r.b("\n" + n);
                            r.b('                <div class="orangejt_tips m-jsjtips j-hoverElement gitfpack_price_tips">');
                            r.b("\n" + n);
                            r.b('                    <span class="m-jsz-voucher"><span class="li-font">礼</span>买保险赠超值礼包</span>');
                            r.b("\n" + n);
                            r.b('                    <div class="tips_contair j-tipElement">');
                            r.b("\n" + n);
                            r.b('                        <div class="bot"></div>');
                            r.b("\n" + n);
                            r.b('                        <div class="top"></div>');
                            r.b("\n" + n);
                            r.b('                        <div class="tips_content">');
                            r.b("\n" + n);
                            r.b("                            ");
                            r.b(r.t(r.f("voucherGiftTips", e, t, 0)));
                            r.b("\n" + n);
                            r.b("                        </div>");
                            r.b("\n" + n);
                            r.b("                    </div>");
                            r.b("\n" + n);
                            r.b("                </div>");
                            r.b("\n")
                        }
                        );
                        e.pop()
                    }
                }
                );
                e.pop()
            }
            r.b("    </div>");
            r.b("\n" + n);
            r.b("\n" + n);
            r.b("</div>");
            r.b("\n");
            return r.fl();
        }
        );
        if (typeof t !== "undefined")
            t.exports = window.QTMPL["BookingPriceInfo"]
    }
    (t.exports, t, e);
    e.____MODULES["722548beb6d57de27d79bda2ba615856"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "f22c5fd34c77eec09e3e714d242d6ebd",
        filename: "priceInfoModel.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        var i = e.____MODULES["285adc5af3055e36addfeabe5289c690"];
        var s = e.____MODULES["312540359c661f626d6031b9f938e9a2"];
        var o = window.model;
        var u = s.create();
        u.fn.initialize = function(e) {
            this.info = {
                price: 0,
                insure: 0,
                insureCount: 0,
                delivery: 0,
                count: 0,
                vouchers: 0,
                isOta: false,
                fanxian: 0,
                policyInfo: {}
            };
            this._data = e;
            this._priceInfo = e.priceInfo;
            this.packingsuccess = e.packingSuccess;
            this._dealRawData()
        }
        ;
        u.fn.hasPreferentialPrice = function() {
            var e = this._priceInfo;
            return !(e.bpr === e.pr)
        }
        ;
        u.fn._dealRawData = function() {
            this._parseSepcialPrice();
            this._parseFot()
        }
        ;
        u.fn._transferPriceTag = function() {
            var e = this;
            var t = e._data;
            var n = e._priceInfo;
            if (!n) {
                return false
            }
            var r = n.priceTag;
            var i = {
                adult: null ,
                adulti: null 
            };
            $.each(r, function(e, t) {
                if (e != "C" && e != "CI" && e != "II" && e != "I") {
                    if (~e.indexOf("I")) {
                        i.adulti = {
                            tag: e,
                            price: t
                        }
                    } else {
                        i.adult = {
                            tag: e,
                            price: t
                        }
                    }
                }
            }
            );
            if (!i.adult && !i.adulti) {
                return false
            }
            if (r["A"] || r["AI"]) {
                n.isApp = true
            }
            if (r["S"] || r["SI"]) {
                n.isOta = true
            }
            if (r["TN"] || r["TNI"] || r["NC"] || r["NCI"]) {
                n.xth = true
            }
            if (r["L"] || r["LI"]) {
                n.xfx = true
            }
            if (r["S"] || r["SI"] || r["SC"] || r["SCI"] || r["TN"] || r["TNI"] || r["NC"] || r["NCI"]) {
                n.xjbw = true
            }
            tpr = 2e3;
            lpr = 1e3;
            var s = r["C"] || r["CI"];
            var o = r["I"] || r["II"];
            n.cpr = s || 0;
            n.ipr = o || 0;
            n.pr = tpr;
            n.bpr = lpr;
            if (!i.adulti) {
                n.pr = n.bpr
            }
            if (!r["C"] && !r["CI"]) {
                n.inventory.child = 0
            }
            if (!r["I"] && !r["II"]) {
                n.inventory.infant = 0
            }
            n.priceTagData = i;
            var u = t.urlInfo;
            var a = u["tag"];
            if (!u["prt"] && a && ~a.indexOf("I")) {
                u.prt = "1"
            }
            if (!i.adulti) {
                t.insurInfo.iq = 0
            }
            e._parseSepcialPrice()
        }
        ;
        u.fn.total = function() {
            var e = this.info;
            return e.price + e.insure + e.hyInsure + e.delivery + e.fot + e.acf - (e.couponPrice || 0)
        }
        ;
        u.fn.getTotalPriceByName = function(e) {
            return this.info[e]
        }
        ;
        u.fn._parseSepcialPrice = function() {
            var e = this._data;
            if (e.isLow == undefined) {
                e.isLow = -1
            }
            var t = e.isLow;
            var n = e.priceInfo;
            var r = n.diffPrice;
            n.specialPrice = {
                type: t,
                dpr: n.diffPrice
            };
            var i = n.xth;
            var s = n.xfx;
            if (t == 0) {
                if (i) {
                    $.extend(n.specialPrice, {
                        pr: n.pr,
                        bpr: n.bpr,
                        qpr: n.pr - n.diffPrice,
                        qbpr: n.bpr - n.diffPrice
                    })
                }
                if (s) {
                    $.extend(n.specialPrice, {
                        pr: n.pr,
                        bpr: n.bpr,
                        qpr: n.pr,
                        qbpr: n.bpr
                    })
                }
            }
            if (t == 1) {
                if (i) {
                    $.extend(n.specialPrice, {
                        pr: n.pr + n.diffPrice,
                        bpr: n.bpr + n.diffPrice,
                        qpr: n.pr,
                        qbpr: n.bpr
                    })
                }
                if (s) {
                    $.extend(n.specialPrice, {
                        pr: n.pr,
                        bpr: n.bpr,
                        qpr: n.pr,
                        qbpr: n.bpr
                    })
                }
            }
        }
        ;
        u.fn.getPriceOfNoInsurance = function() {
            var e = this._priceInfo;
            var t = e.bpr || e.pr;
            if (e.fx) {
                t -= e.fx
            }
            return t
        }
        ;
        u.fn._parseFot = function() {
            var e = this._data;
            var t = e.priceInfo;
            var n = e.flightInfo;
            $.extend(t, {
                acf: 0,
                fot: 0,
                cot: 0
            });
            $.each(n, function(e, n) {
                t.acf += n.acf;
                t.fot += n.fot;
                t.cot += n.cot
            }
            )
        }
        ;
        u.fn.setFlyFundUsed = function(e) {
            this.usedFlyFund = e
        }
        ;
        u.fn.getFlyFundUsed = function() {
            return this.usedFlyFund
        }
        ;
        u.fn.isCheckFlyFund = function() {
            return this.checkedFlyFund
        }
        ;
        u.fn.setCheckFlyFund = function(e) {
            this.checkedFlyFund = e
        }
        ;
        u.fn.getFlyFundByAjax = function() {
            var e = "/flightfund/i/user/queryFundUserAccount";
            var t = $.Deferred();
            $.ajax({
                url: e,
                type: "POST",
                cache: false,
                dataType: "json",
                success: function(e) {
                    var n = e.data || {};
                    if (e.status === 1) {
                        t.resolve(n.validBalance)
                    } else {
                        t.reject()
                    }
                },
                error: function() {
                    t.reject()
                }
            });
            return t
        }
        ;
        u.fn.diffPrice = function() {
            var e = this._priceInfo;
            return e.bpr - e.pr
        }
        ;
        u.fn.getPriceInfo = function() {
            return this._priceInfo
        }
        ;
        u.fn.getVoucherNum = function() {
            return this.voucherModel.getVoucherTotalCount(this.info.vouchers)
        }
        ;
        o.autoRun.push(function(e) {
            o.dataModel.priceModel = new u(e)
        }
        )
    }
    (t.exports, t, e);
    e.____MODULES["f22c5fd34c77eec09e3e714d242d6ebd"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "68dbabe649fafef8a9e5ddea3006746f",
        filename: "PriceInfo.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        var i = e.____MODULES["285adc5af3055e36addfeabe5289c690"];
        var s = e.____MODULES["312540359c661f626d6031b9f938e9a2"];
        var o = "#moduletip_wt";
        var u = s.create();
        u.fn.initialize = function(e) {
            var t = this;
            t.originData = e.originData;
            t.priceModel = e.priceModel;
            t.voucherModel = e.voucherModel;
            t.insureModel = e.agreementModel;
            t.checheModel = e.checheModel;
            t.ajaxFlyFundComplete = false;
            t.checkFlyFund = true;
            t.extendModel();
            t._channelBind();
            t._delegateEvents();
            t.getFlyFundByAjax()
        }
        ;
        u.fn.extendModel = function() {
            var e = this;
            var t = e.originData;
            var n = e.priceModel;
            n.voucherModel = e.voucherModel;
            e.info = n.info;
            e.priceInfo = t.priceInfo;
            e.policyInfo = t.policyInfo;
            e.info.isOta = t.priceInfo.isOta;
            e.info.jiJian = t.flightInfo[0].acf;
            e.info.ranYou = t.flightInfo[0].fot;
            e.info.ticketTime = t.ticketTime;
            e.extInfo = t.extInfo
        }
        ;
        u.fn._channelBind = function() {
            var e = this;
            i.on("update.priceinfo", function(t, n) {
                e.update(n)
            }
            );
            i.on("dataready.passanger", function() {
                if (e.originData.sendFlyFund) {
                    i.trigger("updatestatus.passengerinfo");
                    i.trigger("toggledisplay.agreement", [".j_flyfund_tip", UserStatus.isLogin()])
                }
                if (e.originData.useFlyFund) {
                    e.getFlyFundByAjax()
                }
            }
            )
        }
        ;
        u.fn.getFlyFundByAjax = function() {
            var e = this;
            if (e.originData.useFlyFund && UserStatus.isLogin()) {
                e.priceModel.getFlyFundByAjax().done(function(t) {
                    e.originData.flyFundToUse = t;
                    e.ajaxFlyFundComplete = true;
                    e.setCheckFlyFund(t > 0);
                    i.trigger("updatestatus.passengerinfo");
                    i.trigger("toggledisplay.agreement", [".j_flyfund_tip", e.isCheckFlyFund()])
                }
                )
            }
        }
        ;
        u.fn.update = function(e) {
            $.extend(this.info, e || {});
            this.freshUI();
            var t = new INIT_hover;
            t.live("xfx")
        }
        ;
        u.fn.freshUI = function() {
            var e = this
              , t = e.info
              , n = e.voucherModel
              , r = n.getVoucherSaleType()
              , i = t.couponPrice || 0
              , s = t.fanxian > 0 ? t.fanxian : 0
              , u = t.fanxianDate || ""
              , a = e.policyInfo
              , f = e.priceInfo
              , l = [2, 3, 4, 8]
              , c = ~$.inArray(a.put, l)
              , h = e.checheModel.isShowCar()
              , p = t.carPrice || 0
              , d = e.isCheckFlyFund() && t.flyFundToUse ? t.flyFundToUse : 0
              , v = t.passQuantity;
            voucherGiftTips = n.getVoucherGiftTips();
            t.vouchers = r == 1 ? n.getVoucherCut() * e.info.vCount : t.vouchers;
            var m = f.specialPrice;
            var g = m.type;
            var y = 0;
            var b = 0;
            var w = f.fx;
            var E = 0;
            var S = $(".js_prchild");
            for (var x = 0; x < S.length; x++) {
                if (S.eq(x).html() == "") {
                    E++
                }
            }
            if (e.extInfo == null ) {
                if (w > 0 && (f.priceTag.N || f.priceTag.NI)) {
                    y = 1;
                    s = 0
                } else {
                    y = 0
                }
            } else {
                var T = e.extInfo.fx;
                if (w > 0 && T > 0 && (f.priceTag.N || f.priceTag.NI)) {
                    if (w != T) {
                        y = 0;
                        b = 1
                    } else {
                        y = 1;
                        b = 0
                    }
                    s = 0
                } else {
                    y = 0;
                    b = 0
                }
            }
            var N = e.originData.priceInfo.prdTag == "LCF";
            var C = N ? model.dataModel.productModel.ufdPrice * t.adultNum : 0;
            var k = N ? t.price - C : 0;
            var L = e.voucherModel.isJSJVoucher();
            var A = t.price + t.insure + t.hyInsure + t.delivery + t.fot + t.acf + p - i - C;
            if (L && r != "2") {
                A = A + t.vouchers
            }
            if (A.toString().indexOf(".") > -1) {
                A = A.toFixed(2)
            }
            A = A - d;
            t.total = A;
            Price_html.config(9);
            var O = n.getPackVoucherDesc();
            var M = n.getVoucherPerPrice();
            var _ = QTMPL.BookingPriceInfo.render({
                bodies: t.count,
                o_total: t.price + t.insure + t.hyInsure + t.delivery + t.fot + t.acf - C,
                total: Price_html.getHTML(A),
                ticketPrice: N ? k : t.price,
                insure: t.insure,
                hyInsure: t.hyInsure,
                showHYInsure: e.insureModel.showHYInsure(),
                delivery: t.delivery,
                vouchers: t.vouchers,
                voucherPack: t.voucherPack > 0,
                put: c,
                isNotOta: !t.isOta,
                coupon: i,
                return_money: s,
                fanxianDate: u,
                voucherName: n.getVoucherName(),
                lijian: f.cutPrice * v.adult,
                packingsuccess: !e.priceModel.packingsuccess,
                jiJian: t.acf,
                ranYou: t.fot,
                ticketTime: t.ticketTime,
                showCar: h,
                carPrice: p.toString().indexOf(".") > -1 ? p.toFixed(2) : p,
                showSpecialTips: g != 0,
                lifan: y,
                exchangelifan: b,
                lifan_price: w * E,
                twoforone: r == 1,
                buyforone: r == 2,
                isLuxVoucher: n.getVoucherType() == 10,
                voucherType: n.getVoucherType(),
                voucherPrice: M,
                voucherGiftTips: voucherGiftTips,
                totalVoucherPrice: M * e.info.vCount,
                vCount: e.info.vCount,
                adultCountBuyInsure: t.adultCountBuyInsure,
                sendFlyFund: t.sendFlyFund,
                flyFundCount: t.flyFundCount,
                ajaxFlyFundComplete: e.ajaxFlyFundComplete,
                flyFundToUse: t.flyFundToUse,
                isCheckFlyFund: e.isCheckFlyFund(),
                isLogin: UserStatus.isLogin(),
                islcf: N,
                ticketCost: t.price,
                ufdPrice: C
            });
            $(o).html(_);
            this.priceModel.setFlyFundUsed(t.flyFundToUse)
        }
        ;
        u.fn.isCheckFlyFund = function() {
            if (this.ajaxFlyFundComplete && $("#useFlyFund").prop("checked")) {
                return true
            }
            return false
        }
        ;
        u.fn.setCheckFlyFund = function(e) {
            this.priceModel.setCheckFlyFund(e);
            $("#useFlyFund").prop("checked", e)
        }
        ;
        u.fn._delegateEvents = function() {
            var e = this;
            var t = {
                warning: '为确保您信息的安全，"去哪儿"需要您登录后才能把您的乘机人信息传输到您现在订票的网站。',
                ret: "index.jsp"
            };
            $(o).delegate("#useFlyFund", "click", function() {
                var t = $(this).prop("checked");
                e.setCheckFlyFund(t);
                i.trigger("updatestatus.passengerinfo");
                i.trigger("toggledisplay.agreement", [".j_flyfund_tip", e.isCheckFlyFund()])
            }
            ).delegate(".j-login", "click", function() {
                QNR.showLoginDia({
                    callback: function() {
                        i.trigger("monitor.behavior", ["login", {
                            from: "flyfundLogin"
                        }])
                    },
                    proxy: "/tts/proxy.htm",
                    twoWeek: true,
                    regFlag: true
                }, t)
            }
            ).delegate(".j-jsjTip", "mouseover", function() {
                var t = $(this);
                t.find(".j-tipElement").show();
                e.voucherModel.ajaxGetVouDesc(function(e) {
                    t.find(".js-content").html(e)
                }
                )
            }
            ).delegate(".j-jsjTip", "mouseout", function() {
                $(this).find(".j-tipElement").hide()
            }
            );
            pageVisibility.listen(function() {
                if (!pageVisibility.isHidden() && UserStatus.isLogin()) {
                    if (e.originData.useFlyFund && !e.ajaxFlyFundComplete) {
                        e.getFlyFundByAjax()
                    }
                    if (e.originData.sendFlyFund) {
                        i.trigger("updatestatus.passengerinfo")
                    }
                }
            }
            )
        }
        ;
        n.exports = u
    }
    (t.exports, t, e);
    e.____MODULES["68dbabe649fafef8a9e5ddea3006746f"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "5e81da89e129ae12b13783a31f469173",
        filename: "index.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        e.____MODULES["722548beb6d57de27d79bda2ba615856"];
        e.____MODULES["f22c5fd34c77eec09e3e714d242d6ebd"];
        var i = e.____MODULES["68dbabe649fafef8a9e5ddea3006746f"];
        n.exports = i
    }
    (t.exports, t, e);
    e.____MODULES["5e81da89e129ae12b13783a31f469173"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "0a0c401e9b242decab2ce2dbf68d1a08",
        filename: "flightInfoModel.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        var i = e.____MODULES["312540359c661f626d6031b9f938e9a2"];
        var s = window.model;
        var o = i.create();
        o.fn.initialize = function(e) {
            this._data = e;
            this._dealData()
        }
        ;
        o.fn._dealData = function() {
            var e = this._data;
            e.roundTrip = e.flightInfo.length > 1
        }
        ;
        s.autoRun.push(function(e) {
            s.dataModel.flightModel = new o(e)
        }
        )
    }
    (t.exports, t, e);
    e.____MODULES["0a0c401e9b242decab2ce2dbf68d1a08"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "0d3d1172af5ef104f17ee396b0ba6154",
        filename: "BookingNoXCD.mustache",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(e, t, n) {
        if (typeof window.QTMPL === "undefined")
            window.QTMPL = {};
        window.QTMPL["BookingNoXCD"] = new window.Hogan.Template(function(e, t, n) {
            var r = this;
            r.b(n = n || "");
            r.b("\n" + n);
            r.b("\n" + n);
            r.b('<div class="b_sep_pw module_tipbg">');
            r.b("\n" + n);
            r.b('    <div class="e_pw_lf">特殊票务说明：</div>');
            r.b("\n" + n);
            r.b('    <div class="e_pw_rt">');
            r.b("\n" + n);
            r.b("        ");
            r.b(r.t(r.f("msg", e, t, 0)));
            r.b("\n" + n);
            r.b("    </div>");
            r.b("\n" + n);
            r.b("    ");
            if (r.s(r.f("terms", e, t, 1), e, t, 0, 146, 263, "{{ }}")) {
                r.rs(e, t, function(e, t, n) {
                    n.b('<div class="tearm"><input id="js_chunqiuTerms" type="checkbox" /><label for="js_chunqiuTerms">');
                    n.b(n.v(n.f("terms", e, t, 0)));
                    n.b("</label></div>")
                }
                );
                e.pop()
            }
            r.b("\n" + n);
            r.b("</div>");
            return r.fl();
        }
        );
        if (typeof t !== "undefined")
            t.exports = window.QTMPL["BookingNoXCD"]
    }
    (t.exports, t, e);
    e.____MODULES["0d3d1172af5ef104f17ee396b0ba6154"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "d25124cec29cd46778f71fc08ce90291",
        filename: "BookingFlightInfo.mustache",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(e, t, n) {
        if (typeof window.QTMPL === "undefined")
            window.QTMPL = {};
        window.QTMPL["BookingFlightInfo"] = new window.Hogan.Template(function(e, t, n) {
            var r = this;
            r.b(n = n || "");
            r.b('<table border="0" cellpadding="0" class="tbl_flight');
            if (!r.s(r.f("prtips", e, t, 1), e, t, 1, 0, 0, "")) {
                r.b(" tbl_nofl")
            }
            r.b(" ");
            if (r.s(r.f("fanxian", e, t, 1), e, t, 0, 95, 109, "{{ }}")) {
                r.rs(e, t, function(e, t, n) {
                    n.b("tbl_flight_fan")
                }
                );
                e.pop()
            }
            r.b(" ");
            if (r.s(r.f("confusion", e, t, 1), e, t, 0, 136, 147, "{{ }}")) {
                r.rs(e, t, function(e, t, n) {
                    n.b("tbl_confuse")
                }
                );
                e.pop()
            }
            r.b(" ");
            if (r.s(r.f("roundTrip", e, t, 1), e, t, 0, 176, 184, "{{ }}")) {
                r.rs(e, t, function(e, t, n) {
                    n.b("tbl_trip")
                }
                );
                e.pop()
            }
            r.b('">');
            r.b("\n" + n);
            r.b("    <tr>");
            r.b("\n" + n);
            r.b('        <th class="ft1">行程</th>');
            r.b("\n" + n);
            if (r.s(r.f("confusion", e, t, 1), e, t, 0, 264, 345, "{{ }}")) {
                r.rs(e, t, function(e, t, r) {
                    r.b('            <th class="ft2">时间</th>');
                    r.b("\n" + n);
                    r.b('            <th class="ft3">经停</th>');
                    r.b("\n")
                }
                );
                e.pop()
            }
            if (!r.s(r.f("confusion", e, t, 1), e, t, 1, 0, 0, "")) {
                r.b('            <th class="ft2">起降时间/机场</th>');
                r.b("\n" + n);
                r.b('            <th class="ft3">经停</th>');
                r.b("\n" + n);
                r.b('            <th class="ft4">航空公司</th>');
                r.b("\n" + n);
                r.b("            ");
                if (r.s(r.f("roundTrip", e, t, 1), e, t, 0, 524, 547, "{{ }}")) {
                    r.rs(e, t, function(e, t, n) {
                        n.b('<th class="ft8">舱位</th>')
                    }
                    );
                    e.pop()
                }
                r.b("\n")
            }
            r.b('        <th class="ft5">');
            if (r.s(r.f("isFreeMan", e, t, 1), e, t, 0, 623, 626, "{{ }}")) {
                r.rs(e, t, function(e, t, n) {
                    n.b("套餐价")
                }
                );
                e.pop()
            }
            if (!r.s(r.f("isFreeMan", e, t, 1), e, t, 1, 0, 0, "")) {
                r.b("票价")
            }
            r.b("</th>");
            r.b("\n" + n);
            r.b('        <th class="ft6">机建/燃油</th>');
            r.b("\n" + n);
            r.b('        <th class="ft7">&nbsp;</th>');
            r.b("\n" + n);
            r.b("    </tr>");
            r.b("\n" + n);
            r.b("\n" + n);
            r.b("\n" + n);
            if (r.s(r.f("flightInfo", e, t, 1), e, t, 0, 855, 9291, "{{ }}")) {
                r.rs(e, t, function(e, t, r) {
                    r.b("    <tr>");
                    r.b("\n" + n);
                    r.b('        <td class="ft1">');
                    r.b("\n" + n);
                    r.b("            <p>");
                    r.b(r.v(r.f("dc", e, t, 0)));
                    r.b("-");
                    r.b(r.v(r.f("ac", e, t, 0)));
                    r.b("</p>");
                    r.b("\n" + n);
                    r.b("        </td>");
                    r.b("\n" + n);
                    if (r.s(r.f("confusion", e, t, 1), e, t, 0, 959, 1187, "{{ }}")) {
                        r.rs(e, t, function(e, t, r) {
                            r.b('            <td class="ft2">');
                            r.b("\n" + n);
                            r.b("                ");
                            r.b(r.v(r.f("dd", e, t, 0)));
                            r.b("&nbsp;起飞时段&nbsp;");
                            r.b(r.v(r.f("depDuration", e, t, 0)));
                            r.b("&nbsp;&nbsp;飞行时长约");
                            r.b(r.v(r.f("coufuseTimeStr", e, t, 0)));
                            r.b("\n" + n);
                            r.b("            </td>");
                            r.b("\n" + n);
                            r.b('            <td class="ft3">');
                            r.b("\n" + n);
                            r.b("                <p>");
                            r.b(r.t(r.f("spDesc", e, t, 0)));
                            r.b("</p>");
                            r.b("\n" + n);
                            r.b("            </td>");
                            r.b("\n")
                        }
                        );
                        e.pop()
                    }
                    if (!r.s(r.f("confusion", e, t, 1), e, t, 1, 0, 0, "")) {
                        r.b('            <td class="ft2">');
                        r.b("\n" + n);
                        r.b('                <p class="start"><em>');
                        r.b(r.v(r.f("dd", e, t, 0)));
                        r.b("&nbsp;&nbsp;");
                        r.b(r.v(r.f("dt", e, t, 0)));
                        r.b("</em>");
                        r.b(r.v(r.f("da", e, t, 0)));
                        r.b("</p>");
                        r.b("\n" + n);
                        r.b('                <p class="end"><em>');
                        r.b(r.v(r.f("ad", e, t, 0)));
                        r.b("&nbsp;&nbsp;");
                        r.b(r.v(r.f("at", e, t, 0)));
                        r.b("</em>");
                        r.b(r.v(r.f("aa", e, t, 0)));
                        r.b("</p>");
                        r.b("\n" + n);
                        r.b("            </td>");
                        r.b("\n" + n);
                        r.b('            <td class="ft3">');
                        r.b("\n" + n);
                        r.b("                <p>");
                        r.b(r.t(r.f("spDesc", e, t, 0)));
                        r.b("</p>");
                        r.b("\n" + n);
                        r.b("            </td>");
                        r.b("\n" + n);
                        r.b('            <td class="ft4">');
                        r.b("\n" + n);
                        r.b('                <p class="ft_air"><img width="16" height="16" class="flogo" src="http://simg1.qunarzz.com/site/images/airlines/small/');
                        r.b(r.v(r.f("fc", e, t, 0)));
                        r.b('.gif">');
                        r.b(r.v(r.f("an", e, t, 0)));
                        r.b("</p>");
                        r.b("\n" + n);
                        r.b('                <p class="ft_code">');
                        r.b(r.v(r.f("co", e, t, 0)));
                        if (r.s(r.f("cs", e, t, 1), e, t, 0, 1740, 1759, "{{ }}")) {
                            r.rs(e, t, function(e, t, n) {
                                n.b("<cite>(共享航班)</cite>")
                            }
                            );
                            e.pop()
                        }
                        r.b("</p>");
                        r.b("\n" + n);
                        r.b("            </td>");
                        r.b("\n" + n);
                        r.b("\n" + n);
                        if (r.s(r.f("roundTrip", e, t, 1), e, t, 0, 1816, 1908, "{{ }}")) {
                            r.rs(e, t, function(e, t, r) {
                                r.b('            <td class="ft8">');
                                r.b("\n" + n);
                                r.b("                <p>");
                                r.b(r.v(r.f("cbcn", e, t, 0)));
                                r.b("</p>");
                                r.b("\n" + n);
                                r.b("            </td>");
                                r.b("\n")
                            }
                            );
                            e.pop()
                        }
                    }
                    if (r.s(r.f("idx", e, t, 1), e, t, 0, 1962, 9267, "{{ }}")) {
                        r.rs(e, t, function(e, t, r) {
                            r.b('        <td class="ft5"');
                            if (r.s(r.f("roundTrip", e, t, 1), e, t, 0, 2e3, 2010, "{{ }}")) {
                                r.rs(e, t, function(e, t, n) {
                                    n.b(" rowspan=2")
                                }
                                );
                                e.pop()
                            }
                            r.b(">");
                            r.b("\n" + n);
                            r.b('            <div class="pr_info">');
                            r.b("\n" + n);
                            r.b('                <p class="slprice"><span class="pr t_prc js-price">&yen;');
                            r.b(r.v(r.f("afterFx", e, t, 0)));
                            r.b("</span>/成人</p>");
                            r.b("\n" + n);
                            r.b("                ");
                            if (!r.s(r.f("roundTrip", e, t, 1), e, t, 1, 0, 0, "")) {
                                r.b('<p class="clgray">');
                                r.b(r.v(r.f("cbcn", e, t, 0)));
                                r.b("</p>")
                            }
                            r.b("\n" + n);
                            r.b("            </div>");
                            r.b("\n" + n);
                            if (r.s(r.f("showPriceTip", e, t, 1), e, t, 0, 2281, 8955, "{{ }}")) {
                                r.rs(e, t, function(e, t, r) {
                                    r.b('                <div class="favo_tip');
                                    if (r.s(r.f("roundTrip", e, t, 1), e, t, 0, 2332, 2335, "{{ }}")) {
                                        r.rs(e, t, function(e, t, n) {
                                            n.b("_wf")
                                        }
                                        );
                                        e.pop()
                                    }
                                    if (!r.s(r.f("prtips", e, t, 1), e, t, 1, 0, 0, "")) {
                                        r.b(" hide")
                                    }
                                    r.b('"');
                                    r.b("\n" + n);
                                    r.b("                    ");
                                    if (r.s(r.f("is5Insure", e, t, 1), e, t, 0, 2412, 2430, "{{ }}")) {
                                        r.rs(e, t, function(e, t, n) {
                                            n.b(' id="js_is5Insure"')
                                        }
                                        );
                                        e.pop()
                                    }
                                    r.b("\n" + n);
                                    r.b("                    ");
                                    if (!r.s(r.f("is5Insure", e, t, 1), e, t, 1, 0, 0, "")) {
                                        r.b(' id="js_favInsurance"')
                                    }
                                    r.b(">");
                                    r.b("\n" + n);
                                    if (r.s(r.f("islcf", e, t, 1), e, t, 0, 2577, 3242, "{{ }}")) {
                                        r.rs(e, t, function(e, t, r) {
                                            r.b('                        <div class="module_tipbg js_insure_blog_spec ">');
                                            r.b("\n" + n);
                                            if (!r.s(r.f("roundTrip", e, t, 1), e, t, 1, 0, 0, "")) {
                                                r.b('                                <div class="right"></div>');
                                                r.b("\n" + n);
                                                r.b('                                <div class="left"></div>');
                                                r.b("\n")
                                            }
                                            if (r.s(r.f("roundTrip", e, t, 1), e, t, 0, 2893, 3036, "{{ }}")) {
                                                r.rs(e, t, function(e, t, r) {
                                                    r.b('                                <div class="t_in"></div>');
                                                    r.b("\n" + n);
                                                    r.b('                                <div class="t_ot"></div>');
                                                    r.b("\n")
                                                }
                                                );
                                                e.pop()
                                            }
                                            r.b('                            <p>贷<span class="pr oringe-tip">&yen;');
                                            r.b(r.v(r.f("ufdPrice", e, t, 0)));
                                            r.b('</span>，现付<span class="rmb">&yen;');
                                            r.b(r.v(r.f("payTicketPrice", e, t, 0)));
                                            r.b("</span></p>");
                                            r.b("\n" + n);
                                            r.b("                        </div>");
                                            r.b("\n")
                                        }
                                        );
                                        e.pop()
                                    }
                                    if (!r.s(r.f("islcf", e, t, 1), e, t, 1, 0, 0, "")) {
                                        if (!r.s(r.f("fanxian", e, t, 1), e, t, 1, 0, 0, "")) {
                                            if (!r.s(r.f("is5Insure", e, t, 1), e, t, 1, 0, 0, "")) {
                                                r.b('                                <div class="module_tipbg js_insure_blog ');
                                                if (r.s(r.f("isAdultInsure", e, t, 1), e, t, 0, 3454, 3458, "{{ }}")) {
                                                    r.rs(e, t, function(e, t, n) {
                                                        n.b("hide")
                                                    }
                                                    );
                                                    e.pop()
                                                }
                                                r.b('">');
                                                r.b("\n" + n);
                                                if (!r.s(r.f("roundTrip", e, t, 1), e, t, 1, 0, 0, "")) {
                                                    r.b('                                        <div class="right"></div>');
                                                    r.b("\n" + n);
                                                    r.b('                                        <div class="left"></div>');
                                                    r.b("\n")
                                                }
                                                if (r.s(r.f("roundTrip", e, t, 1), e, t, 0, 3762, 3929, "{{ }}")) {
                                                    r.rs(e, t, function(e, t, r) {
                                                        r.b('                                        <div class="t_in"></div>');
                                                        r.b("\n" + n);
                                                        r.b('                                        <div class="t_ot"></div>');
                                                        r.b("\n")
                                                    }
                                                    );
                                                    e.pop()
                                                }
                                                if (r.s(r.f("showVoucher", e, t, 1), e, t, 0, 3996, 4386, "{{ }}")) {
                                                    r.rs(e, t, function(e, t, r) {
                                                        r.b("                                        <p>买");
                                                        r.b(r.v(r.d("voucherTipMap.tpInsTip", e, t, 0)));
                                                        r.b('机+航意险，<br/>享优惠票价<span class="pr t_prc js-discount oringe-tip">&yen;');
                                                        r.b(r.v(r.d("priceInfo.pr", e, t, 0)));
                                                        r.b("</span>");
                                                        r.b("\n" + n);
                                                        r.b("                                            <!--");
                                                        if (r.s(r.f("twoforone", e, t, 1), e, t, 0, 4220, 4287, "{{ }}")) {
                                                            r.rs(e, t, function(e, t, n) {
                                                                n.b('，<br>再送<span class="pr oringe-tip">&yen;');
                                                                n.b(n.v(n.f("voucherPrice", e, t, 0)));
                                                                n.b("</span>接送机券")
                                                            }
                                                            );
                                                            e.pop()
                                                        }
                                                        r.b("-->");
                                                        r.b("\n" + n);
                                                        r.b("                                        </p>");
                                                        r.b("\n")
                                                    }
                                                    );
                                                    e.pop()
                                                }
                                                if (!r.s(r.f("showVoucher", e, t, 1), e, t, 1, 0, 0, "")) {
                                                    r.b('                                        <p>买航意险，享优惠<br/>票价<span class="pr t_prc js-discount oringe-tip">&yen;');
                                                    r.b(r.v(r.d("priceInfo.pr", e, t, 0)));
                                                    r.b("</span>");
                                                    r.b("\n" + n);
                                                    r.b("                                                <!--");
                                                    if (r.s(r.f("buyforone", e, t, 1), e, t, 0, 4655, 4824, "{{ }}")) {
                                                        r.rs(e, t, function(e, t, r) {
                                                            r.b("-->");
                                                            r.b("\n" + n);
                                                            r.b('                                                <!--，再送<span class="pr oringe-tip">&yen;88</span><br>接送机券-->');
                                                            r.b("\n" + n);
                                                            r.b("                                                    <!--")
                                                        }
                                                        );
                                                        e.pop()
                                                    }
                                                    r.b("-->");
                                                    r.b("\n" + n);
                                                    r.b("                                        </p>");
                                                    r.b("\n")
                                                }
                                                r.b("                                </div>");
                                                r.b("\n" + n);
                                                if (!r.s(r.f("default", e, t, 1), e, t, 1, 0, 0, "")) {
                                                    r.b('                                    <div class="module_tipbg insure_blog_spec js_insure_blog_spec ');
                                                    if (!r.s(r.f("isAdultInsure", e, t, 1), e, t, 1, 0, 0, "")) {
                                                        r.b("hide")
                                                    }
                                                    r.b('">');
                                                    r.b("\n" + n);
                                                    r.b("\n" + n);
                                                    if (!r.s(r.f("roundTrip", e, t, 1), e, t, 1, 0, 0, "")) {
                                                        r.b('                                            <div class="right"></div>');
                                                        r.b("\n" + n);
                                                        r.b('                                            <div class="left"></div>');
                                                        r.b("\n")
                                                    }
                                                    if (r.s(r.f("roundTrip", e, t, 1), e, t, 0, 5469, 5648, "{{ }}")) {
                                                        r.rs(e, t, function(e, t, r) {
                                                            r.b('                                            <div class="t_in"></div>');
                                                            r.b("\n" + n);
                                                            r.b('                                            <div class="t_ot"></div>');
                                                            r.b("\n")
                                                        }
                                                        );
                                                        e.pop()
                                                    }
                                                    if (r.s(r.f("twoforone", e, t, 1), e, t, 0, 5717, 5822, "{{ }}")) {
                                                        r.rs(e, t, function(e, t, n) {
                                                            n.b("                                            ");
                                                            n.b(n.t(n.f("twoForOneTips", e, t, 0)));
                                                            n.b("\n")
                                                        }
                                                        );
                                                        e.pop()
                                                    }
                                                    if (r.s(r.f("buyforone", e, t, 1), e, t, 0, 5891, 5996, "{{ }}")) {
                                                        r.rs(e, t, function(e, t, n) {
                                                            n.b("                                            ");
                                                            n.b(n.t(n.f("buyforoneTips", e, t, 0)));
                                                            n.b("\n")
                                                        }
                                                        );
                                                        e.pop()
                                                    }
                                                    r.b("                                    </div>");
                                                    r.b("\n")
                                                }
                                            }
                                            if (r.s(r.f("is5Insure", e, t, 1), e, t, 0, 6184, 6866, "{{ }}")) {
                                                r.rs(e, t, function(e, t, r) {
                                                    r.b('                                <div class="module_tipbg">');
                                                    r.b("\n" + n);
                                                    if (!r.s(r.f("roundTrip", e, t, 1), e, t, 1, 0, 0, "")) {
                                                        r.b('                                        <div class="right"></div>');
                                                        r.b("\n" + n);
                                                        r.b('                                        <div class="left"></div>');
                                                        r.b("\n")
                                                    }
                                                    if (r.s(r.f("roundTrip", e, t, 1), e, t, 0, 6527, 6694, "{{ }}")) {
                                                        r.rs(e, t, function(e, t, r) {
                                                            r.b('                                        <div class="t_in"></div>');
                                                            r.b("\n" + n);
                                                            r.b('                                        <div class="t_ot"></div>');
                                                            r.b("\n")
                                                        }
                                                        );
                                                        e.pop()
                                                    }
                                                    r.b('                                    <p>5元购航意险，<br/>保额<span class="pr">&yen;80</span>万</p>');
                                                    r.b("\n" + n);
                                                    r.b("                                </div>");
                                                    r.b("\n")
                                                }
                                                );
                                                e.pop()
                                            }
                                        }
                                        r.b("\n" + n);
                                        if (r.s(r.f("fanxian", e, t, 1), e, t, 0, 6955, 8876, "{{ }}")) {
                                            r.rs(e, t, function(e, t, r) {
                                                r.b('                            <div class="module_tipbg js_allBuyInsure hide">');
                                                r.b("\n" + n);
                                                if (!r.s(r.f("roundTrip", e, t, 1), e, t, 1, 0, 0, "")) {
                                                    r.b('                                    <div class="right"></div>');
                                                    r.b("\n" + n);
                                                    r.b('                                    <div class="left"></div>');
                                                    r.b("\n")
                                                }
                                                if (r.s(r.f("roundTrip", e, t, 1), e, t, 0, 7295, 7450, "{{ }}")) {
                                                    r.rs(e, t, function(e, t, r) {
                                                        r.b('                                    <div class="t_in"></div>');
                                                        r.b("\n" + n);
                                                        r.b('                                    <div class="t_ot"></div>');
                                                        r.b("\n")
                                                    }
                                                    );
                                                    e.pop()
                                                }
                                                r.b("\n" + n);
                                                r.b('                                <p>需支付<span class="pr js-discount t_prc oringe-tip">&yen;');
                                                r.b(r.v(r.d("priceInfo.pr", e, t, 0)));
                                                r.b('</span>，<br/>返现<span class="hl fb"> <i class="rmb">&yen;</i>');
                                                r.b(r.v(r.f("fanxian", e, t, 0)));
                                                r.b("</span>");
                                                r.b("\n" + n);
                                                r.b("                            </div>");
                                                r.b("\n" + n);
                                                r.b('                            <div class="module_tipbg js_noAllBuyInsure hide">');
                                                r.b("\n" + n);
                                                if (!r.s(r.f("roundTrip", e, t, 1), e, t, 1, 0, 0, "")) {
                                                    r.b('                                    <div class="right"></div>');
                                                    r.b("\n" + n);
                                                    r.b('                                    <div class="left"></div>');
                                                    r.b("\n")
                                                }
                                                if (r.s(r.f("roundTrip", e, t, 1), e, t, 0, 8026, 8181, "{{ }}")) {
                                                    r.rs(e, t, function(e, t, r) {
                                                        r.b('                                    <div class="t_in"></div>');
                                                        r.b("\n" + n);
                                                        r.b('                                    <div class="t_ot"></div>');
                                                        r.b("\n")
                                                    }
                                                    );
                                                    e.pop()
                                                }
                                                if (r.s(r.f("prCount", e, t, 1), e, t, 0, 8240, 8528, "{{ }}")) {
                                                    r.rs(e, t, function(e, t, n) {
                                                        n.b('                                <p>需支付<span class="pr js-price-bpr t_prc oringe-tip">&yen;');
                                                        n.b(n.v(n.d("priceInfo.bpr", e, t, 0)));
                                                        n.b('</span>，返现<span class="hl fb"> <i class="rmb">&yen;</i>');
                                                        n.b(n.v(n.f("fanxian", e, t, 0)));
                                                        n.b('</span><br/>买航意险，支付再减 <span class="pr"><i class="rmb">&yen;</i>');
                                                        n.b(n.v(n.f("prCount", e, t, 0)));
                                                        n.b("</span>");
                                                        n.b("\n")
                                                    }
                                                    );
                                                    e.pop()
                                                }
                                                if (!r.s(r.f("prCount", e, t, 1), e, t, 1, 0, 0, "")) {
                                                    r.b('                                <p>需支付<span class="pr js-price-bpr t_prc oringe-tip">&yen;');
                                                    r.b(r.v(r.d("priceInfo.bpr", e, t, 0)));
                                                    r.b('</span>，<br/>返现<span class="hl fb"> <i class="rmb">&yen;</i>');
                                                    r.b(r.v(r.f("fanxian", e, t, 0)));
                                                    r.b("</span>");
                                                    r.b("\n")
                                                }
                                                r.b("                            </div>");
                                                r.b("\n")
                                            }
                                            );
                                            e.pop()
                                        }
                                    }
                                    r.b("                </div>");
                                    r.b("\n")
                                }
                                );
                                e.pop()
                            }
                            r.b("        </td> ");
                            r.b("\n" + n);
                            r.b('        <td class="ft6"');
                            if (r.s(r.f("roundTrip", e, t, 1), e, t, 0, 9025, 9035, "{{ }}")) {
                                r.rs(e, t, function(e, t, n) {
                                    n.b(" rowspan=2")
                                }
                                );
                                e.pop()
                            }
                            r.b(">");
                            r.b("\n" + n);
                            r.b('            <p class="pr">&yen;');
                            r.b(r.v(r.d("priceInfo.acf", e, t, 0)));
                            r.b("/&yen;");
                            r.b(r.v(r.d("priceInfo.fot", e, t, 0)));
                            r.b("</p>");
                            r.b("\n" + n);
                            r.b("        </td>");
                            r.b("\n" + n);
                            r.b('        <td class="ft7"');
                            if (r.s(r.f("roundTrip", e, t, 1), e, t, 0, 9178, 9188, "{{ }}")) {
                                r.rs(e, t, function(e, t, n) {
                                    n.b(" rowspan=2")
                                }
                                );
                                e.pop()
                            }
                            r.b(">");
                            r.b("\n" + n);
                            r.b("            ");
                            if (r.s(r.f("nofl", e, t, 1), e, t, 0, 9225, 9235, "{{ }}")) {
                                r.rs(e, t, function(e, t, n) {
                                    n.b("<p>无积分</p>")
                                }
                                );
                                e.pop()
                            }
                            r.b("\n" + n);
                            r.b("        </td>");
                            r.b("\n")
                        }
                        );
                        e.pop()
                    }
                    r.b("\n" + n);
                    r.b("    </tr>");
                    r.b("\n")
                }
                );
                e.pop()
            }
            r.b("\n" + n);
            r.b("</table>");
            r.b("\n" + n);
            if (r.s(r.f("showTGQ", e, t, 1), e, t, 0, 9329, 12199, "{{ }}")) {
                r.rs(e, t, function(e, t, r) {
                    if (r.s(r.f("tgqAdult", e, t, 1), e, t, 0, 9347, 12185, "{{ }}")) {
                        r.rs(e, t, function(e, t, r) {
                            r.b('        <div class="b_tbl_mn">');
                            r.b("\n" + n);
                            r.b('            <div class="e_mn_lnk"  id="js_toggle_trigger"><a title="退改签费用标准" href="javascript:;">退改签费用标准<span id="js_toggle_icon" class="icon_exp"></span></a></div>');
                            r.b("\n" + n);
                            r.b('            <div class="b_mn_tbl" id="js_toggle_content">');
                            r.b("\n" + n);
                            r.b('                <table class="tab_mn ');
                            if (!r.s(r.f("hasTime", e, t, 1), e, t, 1, 0, 0, "")) {
                                r.b("tab_mn_sep")
                            }
                            r.b('">');
                            r.b("\n" + n);
                            if (r.s(r.f("adultTgq", e, t, 1), e, t, 0, 9745, 11246, "{{ }}")) {
                                r.rs(e, t, function(e, t, r) {
                                    r.b("                        <tr>");
                                    r.b("\n" + n);
                                    r.b('                            <th class="c1"></th>');
                                    r.b("\n" + n);
                                    r.b('                            <th class="c2">类型</th>');
                                    r.b("\n" + n);
                                    r.b('                            <th class="c3">');
                                    r.b(r.t(r.f("timePointText", e, t, 0)));
                                    r.b("</th>");
                                    r.b("\n" + n);
                                    r.b('                            <th class="c4">退票扣费</th>');
                                    r.b("\n" + n);
                                    r.b('                            <th class="c5">改期加收手续费</th>');
                                    r.b("\n" + n);
                                    r.b('                            <th class="c6">签转</th>');
                                    r.b("\n" + n);
                                    r.b("                        </tr>");
                                    r.b("\n" + n);
                                    r.b("                        <tr>");
                                    r.b("\n" + n);
                                    r.b('                            <td class="c1">&nbsp;</td>');
                                    r.b("\n" + n);
                                    r.b('                            <td class="c2">成人票</td>');
                                    r.b("\n" + n);
                                    r.b('                            <td colspan="3">');
                                    r.b("\n" + n);
                                    if (r.s(r.f("contentInfo", e, t, 1), e, t, 0, 10362, 10743, "{{ }}")) {
                                        r.rs(e, t, function(e, t, r) {
                                            r.b('                                    <ul class="ul_mn_col fix">');
                                            r.b("\n" + n);
                                            r.b('                                        <li class="mn_col1">');
                                            r.b(r.t(r.f("timePoint", e, t, 0)));
                                            r.b("</li>");
                                            r.b("\n" + n);
                                            r.b('                                        <li class="mn_col2">');
                                            r.b(r.t(r.f("returnFee", e, t, 0)));
                                            r.b("</li>");
                                            r.b("\n" + n);
                                            r.b('                                        <li class="mn_col3">');
                                            r.b(r.t(r.f("changeFee", e, t, 0)));
                                            r.b("</li>");
                                            r.b("\n" + n);
                                            r.b("                                    </ul>");
                                            r.b("\n")
                                        }
                                        );
                                        e.pop()
                                    }
                                    r.b("                            </td>");
                                    r.b("\n" + n);
                                    r.b('                            <td class="c6">');
                                    r.b(r.t(r.f("canSign", e, t, 0)));
                                    r.b("</td>");
                                    r.b("\n" + n);
                                    r.b("                        </tr>");
                                    r.b("\n" + n);
                                    if (r.s(r.f("childTgq", e, t, 1), e, t, 0, 10923, 11212, "{{ }}")) {
                                        r.rs(e, t, function(e, t, r) {
                                            r.b("                            <tr>");
                                            r.b("\n" + n);
                                            r.b('                                <td class="c1">&nbsp;</td>');
                                            r.b("\n" + n);
                                            r.b('                                <td class="c2">婴儿、儿童票</td>');
                                            r.b("\n" + n);
                                            r.b('                                <td class="c3_c" colspan="4">');
                                            r.b(r.v(r.f("childTgq", e, t, 0)));
                                            r.b("</td>");
                                            r.b("\n" + n);
                                            r.b("                            </tr>");
                                            r.b("\n")
                                        }
                                        );
                                        e.pop()
                                    }
                                }
                                );
                                e.pop()
                            }
                            if (!r.s(r.f("adultTgq", e, t, 1), e, t, 1, 0, 0, "")) {
                                if (r.s(r.f("oldTgqText", e, t, 1), e, t, 0, 11369, 12072, "{{ }}")) {
                                    r.rs(e, t, function(e, t, r) {
                                        r.b("                            <tr>");
                                        r.b("\n" + n);
                                        r.b('                                <th class="c1">&nbsp;</th>');
                                        r.b("\n" + n);
                                        r.b('                                <th class="c2">&nbsp;</th>');
                                        r.b("\n" + n);
                                        r.b("                            </tr>");
                                        r.b("\n" + n);
                                        r.b("                            <tr>");
                                        r.b("\n" + n);
                                        r.b('                                <td class="c1">成人退改签规则</td>');
                                        r.b("\n" + n);
                                        r.b('                                <td class="cm">');
                                        r.b(r.t(r.f("oldTgqText", e, t, 0)));
                                        r.b("</td>");
                                        r.b("\n" + n);
                                        r.b("                            </tr>");
                                        r.b("\n" + n);
                                        if (r.s(r.f("childTgq", e, t, 1), e, t, 0, 11792, 12034, "{{ }}")) {
                                            r.rs(e, t, function(e, t, r) {
                                                r.b("                                <tr>");
                                                r.b("\n" + n);
                                                r.b('                                    <td class="c1">婴儿、儿童退改签规则</td>');
                                                r.b("\n" + n);
                                                r.b('                                    <td class="cm">');
                                                r.b(r.t(r.f("childTgq", e, t, 0)));
                                                r.b("</td>");
                                                r.b("\n" + n);
                                                r.b("                                </tr>");
                                                r.b("\n")
                                            }
                                            );
                                            e.pop()
                                        }
                                    }
                                    );
                                    e.pop()
                                }
                            }
                            r.b("                </table>");
                            r.b("\n" + n);
                            r.b("            </div>");
                            r.b("\n" + n);
                            r.b("        </div>");
                            r.b("\n")
                        }
                        );
                        e.pop()
                    }
                }
                );
                e.pop()
            }
            r.b('<div id="js_b_sep_pw"></div>');
            return r.fl();
        }
        );
        if (typeof t !== "undefined")
            t.exports = window.QTMPL["BookingFlightInfo"]
    }
    (t.exports, t, e);
    e.____MODULES["d25124cec29cd46778f71fc08ce90291"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "45973723c52abe5e519a396c0184ffb4",
        filename: "toggle.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(e, t, n) {
        function r(e) {
            this.opt = $.extend({
                triggerID: "#js_toggle_trigger",
                contentID: "#js_toggle_content",
                iconID: "#js_toggle_icon",
                toggleClass: ["icon_exp", "col"]
            }, e);
            this._init()
        }
        r.prototype._init = function() {
            var e = this
              , t = $(this.opt.triggerID);
            if (t.length > 0) {
                t.bind("click", function(t) {
                    var n = e.opt.toggleClass;
                    $(e.opt.contentID).toggle();
                    $(e.opt.iconID).toggleClass(n[0]).toggleClass(n[1]);
                    return false
                }
                )
            }
        }
        ;
        t.exports = r
    }
    (t.exports, t, e);
    e.____MODULES["45973723c52abe5e519a396c0184ffb4"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "de4518e1da70f9df1cd8ca708e702414",
        filename: "view.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        var i = e.____MODULES["312540359c661f626d6031b9f938e9a2"];
        var s = $.browser.msie && $.browser.version == "6.0";
        var o = i.create();
        o.fn.initialize = function(e) {
            this.$node = e;
            this.bindDomEvent()
        }
        ;
        o.fn.bindDomEvent = function() {}
        ;
        o.fn.render = function() {
            throw "no render function"
        }
        ;
        o.fn.setTMPL = function(e) {
            this.tmpl = e
        }
        ;
        o.fn.Hogan = function(e, t, n) {
            if (typeof t === "string") {
                n = t;
                t = null 
            }
            n = n || e.tmpl;
            t = t || QTMPL;
            e.IE6 = s;
            var r = t[n].render(e, t);
            return r
        }
        ;
        t.extend = function() {
            return i.create(o)
        }
    }
    (t.exports, t, e);
    e.____MODULES["de4518e1da70f9df1cd8ca708e702414"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "76e2f0ccc975cea20bf23208ff52543b",
        filename: "flightInfoView.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        e.____MODULES["d25124cec29cd46778f71fc08ce90291"];
        var i = e.____MODULES["ad05b58af7a3e1c622124b2ca5f09d7a"];
        var s = e.____MODULES["45973723c52abe5e519a396c0184ffb4"];
        var o = e.____MODULES["de4518e1da70f9df1cd8ca708e702414"];
        var u = o.extend();
        var a = e.____MODULES["285adc5af3055e36addfeabe5289c690"];
        u.fn.render = function(e) {
            var t = e.renderData;
            var n = $(this.Hogan(t, "BookingFlightInfo"));
            this.data = t;
            i.config(7);
            n.find(".js-discount").html('<i class="rmb">&yen;</i>' + i.getHTML(t.priceInfo.pr)).end().find(".js-price-bpr").html('<i class="rmb">&yen;</i>' + i.getHTML(t.priceInfo.bpr)).end().find(".js-price").html('<i class="rmb">&yen;</i>' + i.getHTML(t.afterFx));
            this.$node.html(n).show();
            this.bind(e)
        }
        ;
        u.fn.bind = function(e) {
            var t = e.getQunarPriceTip();
            var n = e.renderData;
            var r = this;
            if (n.isQunarPrice != 1)
                new s;
            if (n.isQunarPrice != -1) {
                $("#js_fligtInfo").after(t);
                r._bindQunarPriceToggle(e)
            }
        }
        ;
        u.fn._bindQunarPriceToggle = function(e) {
            var t = this;
            var n = $("#js_toggle_qunar_price");
            n.bind("change", function() {
                var t = $(this).is(":checked");
                var n = e._urlParams();
                n.isLow = t ? 1 : 0;
                window.location = e.getURL(n)
            }
            )
        }
        ;
        u.fn.renderPrice = function(e, t) {
            var n = this.data;
            var r = n.priceInfo.specialPrice;
            var s = n.priceInfo.xfx;
            var o = r.pr;
            var u = r.dpr;
            var a = r.bpr;
            var f = r.qpr;
            var l = r.qbpr;
            if (s) {
                f = f - u;
                l = l - u
            }
            i.config(7);
            $(".js-price").html('<i class="rmb">¥</i>' + i.getHTML(e));
            if (r.type != -1) {
                if (t) {
                    $(".js-original-price").html(o);
                    $(".js-q-price").html(f)
                } else {
                    $(".js-original-price").html(a);
                    $(".js-q-price").html(l)
                }
            }
        }
        ;
        n.exports = u
    }
    (t.exports, t, e);
    e.____MODULES["76e2f0ccc975cea20bf23208ff52543b"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "c1c205b8990fe9a6f1d73e2e7ce448df",
        filename: "FlightInfo.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        var i = e.____MODULES["285adc5af3055e36addfeabe5289c690"];
        var s = e.____MODULES["312540359c661f626d6031b9f938e9a2"];
        var o = e.____MODULES["76e2f0ccc975cea20bf23208ff52543b"];
        var u = s.create();
        u.fn.initialize = function(e) {
            this.data = e.originData;
            this.voucherModel = e.voucherModel;
            this.view = new o($("#js_fligtInfo"));
            this.updateView();
            this._channelBind()
        }
        ;
        u.fn._channelBind = function() {
            var e = this;
            i.on("update.flightinfo", function(t, n) {
                e.update(n)
            }
            );
            i.on("updateview.broadcast", function(t) {
                e.updateView()
            }
            );
            i.on("showSpecialRuleMsg.flightInfo", function(t, n) {
                e.showSpecialRuleMsg(n)
            }
            )
        }
        ;
        u.fn.updateView = function() {
            this._parse();
            this.view.render(this)
        }
        ;
        u.fn._parse = function() {
            var e = this;
            var t = e.data;
            var n = {};
            var r = t.flightInfo;
            var i = t.priceInfo;
            var s = t.randcInfo;
            var o = t.policyInfo;
            var u = t.tgqAdult || {};
            var a = t.insurInfo || {};
            var f = false;
            var l = 0;
            var c = e._distinguishFreeMan(t);
            var h = this.data.isQunarPrice;
            var p = e.voucherModel;
            var d = p.getVoucherSaleType();
            if (t.urlInfo.prt !== "0") {
                l = 1
            }
            this.signFor9C(r);
            var v = model.dataModel.productModel.productName == "EVF";
            $.each(r, function(t, n) {
                n.spDesc = e.formatSP(n);
                if (t === 0) {
                    n.idx = t + 1
                }
                n.cs = !!n.gx;
                if (v) {
                    if (r) {
                        n.coufuseTimeStr = model.dataModel.productModel.flightDurationStr;
                        n.depDuration = model.dataModel.productModel.dptRange
                    }
                }
            }
            );
            var m = false;
            if (r.length > 1) {
                m = true
            }
            var g = t.priceInfo.prdTag == "LCF";
            var y = false;
            if (i.pr && i.bpr && i.bpr !== i.pr) {
                y = true
            }
            if (g) {
                y = true
            }
            if (a.iq && a.di === "i5") {
                y = true;
                f = true
            }
            var b = i.pr;
            var w = i.bpr;
            var E;
            var S = i.fx || 0;
            var x;
            var T = w - b;
            if (f && !S) {
                E = w ? w : b;
                x = E
            } else {
                if (l) {
                    E = b
                } else {
                    E = w
                }
                if (i.fx > 0 && (i.priceTag.N || i.priceTag.NI)) {
                    x = E
                } else {
                    x = S > 0 ? E - S : E
                }
            }
            var N = p.getVoucherName();
            var C = p.getBuyforoneTips();
            var k = p.getTwoForOneTips();
            var L = g ? model.dataModel.productModel.ufdPrice : 0;
            var A = g ? x - L : 0;
            n = {
                flightInfo: r,
                priceInfo: i,
                prtips: y,
                is5Insure: f,
                roundTrip: m,
                randcInfo: s,
                price: E,
                normalPolicy: o.prt === 1,
                nofl: o.fl === false,
                showTGQ: t.isLow != 1,
                showPriceTip: e.data.isLow == -1,
                tgqAdult: u,
                fanxian: S,
                afterFx: x,
                isQunarPrice: h,
                prCount: T,
                isAdultInsure: l,
                jsjVoucher: p.isJSJVoucher(),
                voucherTipMap: p.voucherTipMap(),
                twoforone: d == 1,
                buyforone: d == 2,
                buyforoneTips: C,
                twoForOneTips: k,
                showVoucher: p.isJSJVoucher() && d != 2,
                voucherName: N,
                "default": d == 0,
                voucherPrice: p.getVoucherPerPrice(),
                ifPackVoucherDesc: p.getIfPackVoucherDesc(),
                isFreeMan: c,
                islcf: g,
                ufdPrice: L,
                payTicketPrice: A,
                confusion: v,
                originData: t.originData
            };
            this.renderData = this._setTgqData(n)
        }
        ;
        u.fn.formatSP = function(e) {
            var t = e.sp;
            var n = '<span class="p_lacal_jt">有</span>';
            if (t == 0) {
                return "无"
            } else if (t == 1) {
                return e.stopCity && e.stopAirport ? ["<p class='p_lacal_jt'>", e.stopCity, "</p><p class='p_lacal_jt'>", e.stopAirport, "</p>"].join("") : n
            } else {
                return n
            }
        }
        ;
        u.fn.signFor9C = function(e) {
            var t = false;
            if (e[0]) {
                t = e[0].co && e[0].co.indexOf("9C") === 0
            }
            if (e[1]) {
                t = e[1].co && e[1].co.indexOf("9C") === 0
            }
            if (t) {
                window.is9C = true
            }
        }
        ;
        u.fn._distinguishFreeMan = function(e) {
            if (e.extInfo && e.extInfo.codeBase && e.extInfo.codeBase == "ttsgnd01204") {
                return 1
            }
            return 0
        }
        ;
        u.fn.getQunarPriceTip = function() {
            var e = this.data.priceInfo;
            var t = e.specialPrice;
            var n = t.type;
            if (n == -1)
                return "";
            var r = [], i, s, o;
            var u = this.data.urlInfo["tag"];
            if (u && !~u.indexOf("I")) {
                i = t.pr;
                s = t.dpr;
                o = t.qpr
            } else {
                i = t.bpr;
                s = t.dpr;
                o = t.qbpr
            }
            var a = e.xth;
            var f = e.xfx;
            r.push('<div class="module_low_price_tip">');
            r.push('<input type="checkbox" id="js_toggle_qunar_price" ' + (n == 1 ? 'checked="checked"' : "") + " />");
            if (a) {
                r.push('确认行程不做变更，不享受电话、退改等服务。享受原价<i class="rmb">&yen;</i><span class="js-original-price">' + i + '</span>，立减<i class="rmb">&yen;</i><span class="js-diff-price">' + s + '</span>，优惠价<span class="spec"><i class="rmb">&yen;</i><span class="js-q-price">' + o + "</span></span>/成人！")
            }
            if (f) {
                r.push('确认行程不做变更，不享受电话、退改等服务。享受原价<i class="rmb">&yen;</i><span class="js-original-price">' + i + '</span>，起飞后返现<i class="rmb">&yen;</i><span class="js-diff-price">' + s + '</span>，实际优惠价<span class="spec"><i class="rmb">&yen;</i><span class="js-q-price">' + (o - s) + "</span></span>/成人！")
            }
            r.push("</div>");
            return r.join("")
        }
        ;
        u.fn.showSpecialRuleMsg = function(e) {
            this.SPECIALRULE = $("#js_b_sep_pw");
            var t = this.data;
            var n = window.is9C;
            var r = t.policyInfo.specialRule;
            var i = t.policyInfo.put;
            var s = i == 17;
            if (r && (!n || n && s)) {
                r = r.split("|");
                var o = r.length;
                if (o < 2) {
                    r = r[0]
                } else {
                    for (var u = 0; u < r.length; u++) {
                        r[u] = "<p>" + (u + 1) + "、" + r[u] + "</p>"
                    }
                    r = r.join("")
                }
            }
            if (!r && e && !n) {
                r = "此机票票面价格和实际支付价格有差额，购买时请注意。"
            }
            var a = null ;
            if (n) {
                a = "我已阅读并同意以上《春秋航空行李额规定》"
            }
            if (r) {
                $(this.SPECIALRULE).html(QTMPL.BookingNoXCD.render({
                    msg: r,
                    terms: a
                })).show()
            } else {
                $(this.SPECIALRULE).hide()
            }
        }
        ;
        u.fn._setTgqData = function(e) {
            var t = 0
              , n = 0
              , r = e.tgqAdult
              , i = null 
              , s = null 
              , o = ""
              , u = ""
              , a = [];
            if (!$.isEmptyObject(r)) {
                if (e.priceInfo.cpr) {
                    r.childTgq = e.randcInfo.child
                }
                i = r.timePointCharges;
                i && (n = i.length);
                r.timePointText = r.hasTime ? "退改签时间点" : "&nbsp;";
                if (r.viewType === 1 && n > 0) {
                    for (; t < n; t++) {
                        s = i[t];
                        o = s.returnFee == -1 ? "只退机建和燃油" : '<span class="f_tohama"><i class="rmb">¥' + s.returnFee + "</i></span>/人";
                        u = s.changeFee == -1 ? "不可改期" : '<span class="f_tohama"><i class="rmb">¥' + s.changeFee + "</i></span>/人";
                        a.push({
                            timePoint: r.hasTime ? s.timeText : "&nbsp;",
                            returnFee: o,
                            changeFee: u
                        })
                    }
                    r.adultTgq = {
                        contentInfo: a
                    };
                    r.canSign = r.signText
                } else {
                    if (r.tgqText) {
                        r.oldTgqText = r.tgqText
                    }
                }
            }
            return e
        }
        ;
        u.fn.getURL = function(e) {
            var t = [];
            var n = window.location.href.split("?")[0];
            $.each(e, function(e, n) {
                if (t.length === 0) {
                    t.push("?")
                }
                t.push(e + "=" + n + "&")
            }
            );
            return n + t.join("").replace(/&$/, "")
        }
        ;
        u.fn._urlParams = function() {
            var e = {};
            var t = window.location.search.replace("?", "");
            var n = t.split("&");
            $.each(n, function(t, n) {
                var r = n.split("=");
                var i = r[0]
                  , s = r[1];
                e[i] = s || ""
            }
            );
            return e
        }
        ;
        u.fn.update = function(e) {
            var t = e.adultInsureCount;
            var n = this._isAdultInsure(t);
            var r;
            var i = this.data.priceInfo.fx || 0;
            var s = this.data.priceInfo;
            var o = s.specialPrice;
            var u = this.voucherModel;
            var a = u.getVoucherSaleType() == 0;
            if ($(".js_insure_blog").length) {
                if (n) {
                    r = this.data.priceInfo.pr;
                    $(".js_insure_blog").addClass("hide");
                    if (!a) {
                        $(".js_insure_blog_spec").removeClass("hide")
                    }
                } else {
                    r = this.data.priceInfo.bpr;
                    if (!a) {
                        $(".js_insure_blog_spec").addClass("hide")
                    }
                    $(".js_insure_blog").removeClass("hide")
                }
                this.view.renderPrice(r)
            }
            if (i > 0) {
                if (this.data.priceInfo.priceTag.N || this.data.priceInfo.priceTag.NI) {
                    if (n) {
                        r = this.data.priceInfo.pr;
                        $(".js_noAllBuyInsure").addClass("hide");
                        $(".js_allBuyInsure").removeClass("hide")
                    } else {
                        r = this.data.priceInfo.bpr;
                        $(".js_allBuyInsure").addClass("hide");
                        $(".js_noAllBuyInsure").removeClass("hide")
                    }
                } else {
                    if (n) {
                        r = this.data.priceInfo.pr - i;
                        $(".js_noAllBuyInsure").addClass("hide");
                        $(".js_allBuyInsure").removeClass("hide")
                    } else {
                        r = this.data.priceInfo.bpr - i;
                        $(".js_allBuyInsure").addClass("hide");
                        $(".js_noAllBuyInsure").removeClass("hide")
                    }
                }
                this.view.renderPrice(r)
            }
            if (o.type != -1) {
                if (n) {
                    r = o.pr
                } else {
                    r = o.bpr
                }
                this.view.renderPrice(r, n)
            }
        }
        ;
        u.fn._isAdultInsure = function(e) {
            if (e.length) {
                for (var t = 0; t < e.length; t++) {
                    if (e[t] === 0) {
                        return 0
                    }
                }
                return 1
            }
            return 0
        }
        ;
        n.exports = u
    }
    (t.exports, t, e);
    e.____MODULES["c1c205b8990fe9a6f1d73e2e7ce448df"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "05878ba784827f60182f01a29d9c2d40",
        filename: "index.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        e.____MODULES["0a0c401e9b242decab2ce2dbf68d1a08"];
        e.____MODULES["0d3d1172af5ef104f17ee396b0ba6154"];
        var i = e.____MODULES["c1c205b8990fe9a6f1d73e2e7ce448df"];
        n.exports = i
    }
    (t.exports, t, e);
    e.____MODULES["05878ba784827f60182f01a29d9c2d40"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "53c3364968d31d8bd29829dd6e1c89f6",
        filename: "AgreementModel.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        var i = e.____MODULES["285adc5af3055e36addfeabe5289c690"];
        var s = e.____MODULES["312540359c661f626d6031b9f938e9a2"];
        e.____MODULES["a22f37bb1b28023d69e4ac11871e89f1"];
        var o = ["t30", "b30", "s5"];
        var u = {
            i5: 1,
            s5: 1
        };
        var a = window.model;
        var f = s.create();
        f.fn.initialize = function(e) {
            this._data = e;
            this.insureType = "default";
            this.hyInsureChecked = true;
            this.info = {
                flightDelayErr: false
            };
            this._hyinsure = this._data.canBuyFlightDelay;
            this.insureTip = "";
            this.hyInsureTip = "";
            this._resetData();
            this._channelBind()
        }
        ;
        f.fn._channelBind = function() {
            var e = this;
            i.on("normalizedData.normalizeData", function(t, n) {
                e._resetData()
            }
            )
        }
        ;
        f.fn._resetData = function() {
            this.data = this._data.insurInfo;
            this._currInsureGroup = this.defaultInsuerGroup();
            this._currInsureTag = this.defaultInsureTag()
        }
        ;
        f.fn.isNoSpecialInsurance = function(e) {
            return $.inArray(e, o) > -1
        }
        ;
        f.fn.defaultInsureTag = function() {
            return this.data.di
        }
        ;
        f.fn.defaultInsuer = function(e) {
            return e[0]
        }
        ;
        f.fn.isNoFavorableInsurance = function() {
            return u[this._currInsureTag]
        }
        ;
        f.fn.defaultInsuerGroup = function() {
            var e = this.data.detail[this.defaultInsureTag()];
            if (!e) {
                i.trigger("LOG4J.error", "缺少保险信息")
            }
            return e || [{}]
        }
        ;
        f.fn.isForce = function() {
            var e = this
              , t = e._currInsureGroup
              , n = e.defaultInsuer(t);
            return n.min > 0
        }
        ;
        f.fn.hasIq = function() {
            var e = this
              , t = e._currInsureGroup
              , n = e.defaultInsuer(t);
            return e.data.iq && n ? true : false
        }
        ;
        f.fn.currentInsure = function() {
            var e = this;
            return e.defaultInsuer(e._currInsureGroup)
        }
        ;
        f.fn.getPnrInfo = function() {
            var e = this;
            var t = a.dataModel.productModel;
            var n = t.productName;
            var r = "";
            switch (n) {
            case "UFF":
                t.getCurSel() && (r = "xth=1&");
                break;
            case "LPF":
                r = "xth=1&";
                break;
            default:
                break
            }
            return r + "insureTag=" + e._currInsureTag
        }
        ;
        f.fn.getInsureTag = function() {
            return this._currInsureTag
        }
        ;
        f.fn.addInsureCount = function(e) {
            if (!this._defaultInsureCount)
                return;
            if (e) {
                this._defaultInsureCount.unshift(0)
            } else {
                this._defaultInsureCount.push(0)
            }
        }
        ;
        f.fn.removeInsure = function(e) {
            if (!this._defaultInsureCount)
                return;
            this._defaultInsureCount.splice(e, 1)
        }
        ;
        f.fn._diffPrice = function(e) {
            var t = this
              , n = t.defaultInsuer;
            insures = t.defaultInsuerGroup(),
            defaultInsurePrice = n(insures).price,
            targetPrice = n(e).price || 0;
            return targetPrice - defaultInsurePrice
        }
        ;
        f.fn._specialInsureGroup = function() {
            var e = this;
            try {
                return e.data.detail[e._getSpecialInsuranceTag()] || []
            } catch (t) {
                return []
            }
        }
        ;
        f.fn._getSpecialInsuranceTag = function() {
            return this.defaultInsureTag() === "i20" ? "i30" : "r30"
        }
        ;
        f.fn._recInsuranceGroup = function() {
            return this.data.detail[this._getRecInsuranceTag()] || []
        }
        ;
        f.fn._getRecInsuranceTag = function() {
            return "s5"
        }
        ;
        f.fn._insureCount = function() {
            var e = 0
              , t = this;
            $.each(t.info.insureCount, function(t, n) {
                e += n
            }
            );
            return e
        }
        ;
        f.fn.getHYInsure = function() {
            var e = this._data.flightDelayProduct;
            if (e) {
                e.hyInsureChecked = this.hyInsureChecked
            }
            return e
        }
        ;
        f.fn.getHYInsureCount = function() {
            var e = 0;
            $("input.js_delay_insure_val").each(function(t, n) {
                if (n.value === "0")
                    return true;
                e++
            }
            );
            return e
        }
        ;
        f.fn.showHYInsure = function(e) {
            if (e !== undefined) {
                this._hyinsure = e
            } else {
                return this._hyinsure
            }
        }
        ;
        f.fn.getInsureTip = function(e) {
            return this.insureTip
        }
        ;
        f.fn.getHYInsureTip = function(e) {
            return this.hyInsureTip
        }
        ;
        f.fn.getInsureCount = function() {
            return this.info.insureCount
        }
        ;
        a.autoRun.push(function(e) {
            a.dataModel.agreementModel = new f(e)
        }
        )
    }
    (t.exports, t, e);
    e.____MODULES["53c3364968d31d8bd29829dd6e1c89f6"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "1af9798192592afc3856c800d89450a4",
        filename: "BookingInsuranceTip.mustache",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(e, t, n) {
        if (typeof window.QTMPL === "undefined")
            window.QTMPL = {};
        window.QTMPL["BookingInsuranceTip"] = new window.Hogan.Template(function(e, t, n) {
            var r = this;
            r.b(n = n || "");
            if (r.s(r.f("insure", e, t, 1), e, t, 0, 11, 471, "{{ }}")) {
                r.rs(e, t, function(e, t, r) {
                    r.b(' <p class="title">保险信息：</p>');
                    r.b("\n" + n);
                    r.b(" <p>1、请您根据需求选择保险");
                    if (r.s(r.f("isMin", e, t, 1), e, t, 0, 66, 79, "{{ }}")) {
                        r.rs(e, t, function(e, t, n) {
                            n.b("，如不需要保险，请选择0份")
                        }
                        );
                        e.pop()
                    }
                    r.b("；如需指定保险受益人，请联系承保保险公司处理。</p>");
                    r.b("\n" + n);
                    r.b(' <p>2、如您选择投保，表示确认投保人、乘机人（即被保险人）同意购买且认可保险金额，并已阅读<a href="');
                    r.b(r.v(r.d("insure.url", e, t, 0)));
                    r.b('" target="_blank">《');
                    r.b(r.v(r.d("insure.insurance", e, t, 0)));
                    r.b("条款》</a>的全部内容，了解并接受条款中责任免除、退保等在内的重要事项。保险金额：");
                    r.b(r.v(r.d("insure.amount", e, t, 0)));
                    r.b("万元/份，保险费：");
                    r.b(r.v(r.d("insure.price", e, t, 0)));
                    r.b("元/份。</p>");
                    r.b("\n" + n);
                    r.b(" <p>3、在您提交订单并成功付款后，会由");
                    r.b(r.v(r.d("insure.name", e, t, 0)));
                    r.b("发送投保成功的短信至您的手机，请注意查收。</p>");
                    r.b("\n" + n);
                    if (r.s(r.f("isLD", e, t, 1), e, t, 0, 391, 461, "{{ }}")) {
                        r.rs(e, t, function(e, t, n) {
                            n.b("   <p>4、选择联动优势支付，保险将变更为");
                            n.b(n.v(n.d("insureLD.insurance", e, t, 0)));
                            n.b(" ");
                            n.b(n.v(n.d("insureLD.note", e, t, 0)));
                            n.b("。</p>");
                            n.b("\n")
                        }
                        );
                        e.pop()
                    }
                }
                );
                e.pop()
            }
            if (r.s(r.f("hyInsure", e, t, 1), e, t, 0, 496, 519, "{{ }}")) {
                r.rs(e, t, function(e, t, n) {
                    n.b(" ");
                    n.b(n.t(n.f("productDetails", e, t, 0)));
                    n.b("\n")
                }
                );
                e.pop()
            }
            return r.fl();
        }
        );
        if (typeof t !== "undefined")
            t.exports = window.QTMPL["BookingInsuranceTip"]
    }
    (t.exports, t, e);
    e.____MODULES["1af9798192592afc3856c800d89450a4"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "e8cebafa130d4e18925f5d10109a0571",
        filename: "BookingAgreementRecommendInsurance.mustache",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(e, t, n) {
        if (typeof window.QTMPL === "undefined")
            window.QTMPL = {};
        window.QTMPL["BookingAgreementRecommendInsurance"] = new window.Hogan.Template(function(e, t, n) {
            var r = this;
            r.b(n = n || "");
            r.b(r.v(r.f("insurance", e, t, 0)));
            r.b("，保额 ");
            r.b(r.v(r.f("amount", e, t, 0)));
            r.b('万！<div><p style="float:left;">保费 ');
            r.b(r.v(r.f("price", e, t, 0)));
            r.b('元/份</p><div class="hv_insdtl js_insureDetail_handler"><a onclick="return false;" href="#" class="ws_np">详情</a><div class="orangejt_tips js_insureTipsContainer" style="display:none;">');
            r.b(r.t(r.f("insureTips", e, t, 0)));
            r.b('</div></div><a target="_blank" href="');
            r.b(r.v(r.f("nurl", e, t, 0)));
            r.b('">《保险说明》</a></div>');
            return r.fl();
        }
        );
        if (typeof t !== "undefined")
            t.exports = window.QTMPL["BookingAgreementRecommendInsurance"]
    }
    (t.exports, t, e);
    e.____MODULES["e8cebafa130d4e18925f5d10109a0571"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "a2b6be14aa6043ec01ed911d16153135",
        filename: "BookingAgreement.mustache",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(e, t, n) {
        if (typeof window.QTMPL === "undefined")
            window.QTMPL = {};
        window.QTMPL["BookingAgreement"] = new window.Hogan.Template(function(e, t, n) {
            var r = this;
            r.b(n = n || "");
            r.b('<div class="inner">');
            r.b("\n" + n);
            r.b('    <input id="agreement_this" type="checkbox" class="checkbox" checked="checked">');
            r.b("\n" + n);
            r.b('    <label for="agreement_this">我已阅读并同意');
            r.b("\n" + n);
            r.b('        <a target="_blank" href="');
            r.b(r.v(r.f("agreementHOST", e, t, 0)));
            r.b('/declarations/agreement" class="hide" id="js-network">《网络电子客票协议》</a>');
            r.b("\n" + n);
            r.b('   <a target="_blank" href="/declarations/agreement-jzhk" class="hide" id="js-bookingknow">《预订须知》</a>');
            r.b("\n" + n);
            if (r.s(r.f("isIQ", e, t, 1), e, t, 0, 380, 526, "{{ }}")) {
                r.rs(e, t, function(e, t, r) {
                    r.b('            <span id="js_insure_rules" class="hide">');
                    r.b("\n" + n);
                    r.b('                <a target="_blank" href="');
                    r.b(r.v(r.f("nurl1", e, t, 0)));
                    r.b('">《航意险说明》</a>');
                    r.b("\n" + n);
                    r.b("            </span>");
                    r.b("\n")
                }
                );
                e.pop()
            }
            if (r.s(r.f("favourPrice", e, t, 1), e, t, 0, 560, 1198, "{{ }}")) {
                r.rs(e, t, function(e, t, r) {
                    r.b('            <span id="js_insure_dis" class="b_wt_tips orangejt_tips js_orangejt_tips hide">《航意险优惠说明》');
                    r.b("\n" + n);
                    r.b('                <div class="tips_contair js_xth_tips hide">');
                    r.b("\n" + n);
                    r.b("                    <!-- 箭头 -->");
                    r.b("\n" + n);
                    r.b('                    <i class="bot"></i>');
                    r.b("\n" + n);
                    r.b('                    <i class="top"></i>');
                    r.b("\n" + n);
                    r.b('                    <div class="tips_content">');
                    r.b("\n" + n);
                    r.b('                        <p>1. 购买航意险套餐，享受优惠票价<span class="rmb">&yen;');
                    r.b(r.v(r.f("niPrice", e, t, 0)));
                    r.b('</span>/成人，原价<span class="rmb">&yen;');
                    r.b(r.v(r.f("nPrice", e, t, 0)));
                    r.b("</span>/成人；</p>");
                    r.b("\n" + n);
                    r.b('                        <p>2. 如发生退款，去哪儿网将收回优惠<span class="rmb">&yen;');
                    r.b(r.v(r.f("favourPrice", e, t, 0)));
                    r.b("</span>/成人。</p>");
                    r.b("\n" + n);
                    r.b("                    </div>");
                    r.b("\n" + n);
                    r.b("                </div>");
                    r.b("\n" + n);
                    r.b("            </span>");
                    r.b("\n")
                }
                );
                e.pop()
            }
            r.b("   ");
            r.b("\n" + n);
            if (r.s(r.f("showHYInsure", e, t, 1), e, t, 0, 1243, 1465, "{{ }}")) {
                r.rs(e, t, function(e, t, r) {
                    r.b('        <span id="js_hy_insure_rules" class="hide">');
                    r.b("\n" + n);
                    r.b('             <!--<a target="_blank" href="');
                    r.b(r.v(r.d("hyInsure.detailUrl", e, t, 0)));
                    r.b('">《保险经纪委托协议》</a>--><a target="_blank" href="');
                    r.b(r.v(r.d("hyInsure.detailUrl2", e, t, 0)));
                    r.b('">《延误险说明》</a>');
                    r.b("\n" + n);
                    r.b("        </span>");
                    r.b("\n")
                }
                );
                e.pop()
            }
            r.b('        <a target="_blank" href="/node/activity/flyfund" class="j_flyfund_tip hide">《飞基金活动说明》</a>');
            r.b("\n" + n);
            r.b('         <span id="js_voucherpack_jsj" class="hide"><a target="_blank" href="http://qnf.trade.qunar.com/voucher/agreement?type=9">《接送机代金券说明》</a></span>');
            r.b("\n" + n);
            r.b('        <span id="js_vouchers_rules" class="hide"><a target="_blank" href="/voucher/agreement?type=');
            r.b(r.v(r.f("voucherType", e, t, 0)));
            r.b('">《');
            r.b(r.v(r.f("voucherName", e, t, 0)));
            r.b("说明》</a></span>");
            r.b("\n" + n);
            if (r.s(r.f("showSpecialTips", e, t, 1), e, t, 0, 1908, 3372, "{{ }}")) {
                r.rs(e, t, function(e, t, r) {
                    if (r.s(r.f("xth", e, t, 1), e, t, 0, 1925, 2591, "{{ }}")) {
                        r.rs(e, t, function(e, t, r) {
                            r.b('            <span class="b_wt_tips orangejt_tips js_orangejt_tips">《低价特惠活动说明》');
                            r.b("\n" + n);
                            r.b('                <div class="tips_contair js_xth_tips hide">');
                            r.b("\n" + n);
                            r.b("                    <!-- 箭头 -->");
                            r.b("\n" + n);
                            r.b('                    <i class="bot"></i>');
                            r.b("\n" + n);
                            r.b('                    <i class="top"></i>');
                            r.b("\n" + n);
                            r.b('                    <div class="tips_content">');
                            r.b("\n" + n);
                            r.b("                        <p>1. 产品参与低价特惠促销活动，退票或改签适用低价特惠促销退改签规则；</p>");
                            r.b("\n" + n);
                            r.b("                        <p>2. 如低价特惠促销退改签规则不能满足您的需求，请选购非低价特惠产品或放弃低价特惠促销优惠");
                            r.b("\n" + n);
                            r.b("                            ");
                            if (r.s(r.f("lijian", e, t, 1), e, t, 0, 2402, 2446, "{{ }}")) {
                                r.rs(e, t, function(e, t, n) {
                                    n.b('(<span class="rmb">&yen;');
                                    n.b(n.v(n.f("lijian", e, t, 0)));
                                    n.b("</span>/人)")
                                }
                                );
                                e.pop()
                            }
                            r.b("；</p>");
                            r.b("\n" + n);
                            r.b("                        <p>3. 儿童票不参与低价特惠促销活动。</p>");
                            r.b("\n" + n);
                            r.b("                    </div>");
                            r.b("\n" + n);
                            r.b("                </div>");
                            r.b("\n" + n);
                            r.b("            </span>");
                            r.b("\n")
                        }
                        );
                        e.pop()
                    }
                    if (r.s(r.f("isRD", e, t, 1), e, t, 0, 2617, 2776, "{{ }}")) {
                        r.rs(e, t, function(e, t, n) {
                            n.b('            <span class="b_wt_tips orangejt_tips"><a target="_blank" href="http://qcx.trade.qunar.com/tts/ufee/core/explanation">《优飞币活动说明》</a></span>');
                            n.b("\n")
                        }
                        );
                        e.pop()
                    }
                    if (r.s(r.f("xfx", e, t, 1), e, t, 0, 2802, 3346, "{{ }}")) {
                        r.rs(e, t, function(e, t, r) {
                            r.b('        <span class="b_wt_tips orangejt_tips js_orangejt_tips">《返现活动说明》');
                            r.b("\n" + n);
                            r.b('            <div class="tips_contair js_xth_tips hide">');
                            r.b("\n" + n);
                            r.b("                <!-- 箭头 -->");
                            r.b("\n" + n);
                            r.b('                <i class="bot"></i>');
                            r.b("\n" + n);
                            r.b('                <i class="top"></i>');
                            r.b("\n" + n);
                            r.b('                <div class="tips_content">');
                            r.b("\n" + n);
                            r.b("                    <p>1. 起飞后24小时内即返现到原支付账户；</p>");
                            r.b("\n" + n);
                            r.b("                    <p>2. 此产品参与返现促销活动，退票或改签适用返现促销退改签规则；</p>");
                            r.b("\n" + n);
                            r.b("                    <p>3. 如提出退票/改签等服务要求，将收回返现优惠；</p>");
                            r.b("\n" + n);
                            r.b("                    <p>4. 儿童票不参与返现促销活动。</p>");
                            r.b("\n" + n);
                            r.b("                </div>");
                            r.b("\n" + n);
                            r.b("            </div>");
                            r.b("\n" + n);
                            r.b("        </span>");
                            r.b("\n")
                        }
                        );
                        e.pop()
                    }
                }
                );
                e.pop()
            }
            if (r.s(r.f("islcf", e, t, 1), e, t, 0, 3411, 3510, "{{ }}")) {
                r.rs(e, t, function(e, t, n) {
                    n.b('            <a target="_blank" href="/node/activity/fcdAct" id="js-network">《非常贷活动说明》</a>');
                    n.b("\n")
                }
                );
                e.pop()
            }
            if (r.s(r.f("showCar", e, t, 1), e, t, 0, 3541, 3723, "{{ }}")) {
                r.rs(e, t, function(e, t, r) {
                    r.b('            <span class="js_car_rules hide">');
                    r.b("\n" + n);
                    r.b('             <a target="_blank" href="http://car.qunar.com/pc/qbest/shuttle_description.html">《接送机服务说明》</a>');
                    r.b("\n" + n);
                    r.b("            </span>");
                    r.b("\n")
                }
                );
                e.pop()
            }
            if (r.s(r.f("scTip", e, t, 1), e, t, 0, 3754, 3990, "{{ }}")) {
                r.rs(e, t, function(e, t, r) {
                    r.b('            <a target="_blank" href="http://218.56.48.139:8083/linshi/index/lidianchi.html">《关于民航旅客行李中携带锂电池规定的公告》</a>');
                    r.b("\n" + n);
                    r.b('            <a target="_blank" href="http://218.56.48.139:8083/linshi/index/wxpzh.html">《关于禁止携带危险品乘机的公告》</a>');
                    r.b("\n")
                }
                );
                e.pop()
            }
            r.b('   <span id="js_agree_txt">, 了解并接受包括免责条款、费用扣除、退保等在内的重要事项。</span>');
            r.b("\n" + n);
            r.b("    </label>");
            r.b("\n" + n);
            r.b("</div>  ");
            return r.fl();
        }
        );
        if (typeof t !== "undefined")
            t.exports = window.QTMPL["BookingAgreement"]
    }
    (t.exports, t, e);
    e.____MODULES["a2b6be14aa6043ec01ed911d16153135"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "c960e14b5b658a5425957d1636e48fe2",
        filename: "AgreementView.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        function a() {
            this.$dom = $(s)
        }
        e.____MODULES["1af9798192592afc3856c800d89450a4"];
        e.____MODULES["e8cebafa130d4e18925f5d10109a0571"];
        var i = "#js_hy_insure_rules";
        var s = "#module_agreement";
        var o = "#js_insure_rules";
        var u = "#js_voucherpack_jsj";
        a.fn = a.prototype;
        a.fn.rend = function(t, n) {
            var r = e.____MODULES["a2b6be14aa6043ec01ed911d16153135"];
            var i = r.render(t);
            this.$dom.html(i);
            this.checkNoName(n);
            this.bind()
        }
        ;
        a.fn.checkNoName = function(e) {
            if (e.venderInfo.ttsType === 3) {
                $("#js-bookingknow").removeClass("hide");
                $("#js-network").addClass("hide")
            } else {
                $("#js-network").removeClass("hide");
                $("#js-bookingknow").addClass("hide")
            }
        }
        ;
        a.fn.bind = function() {
            var e = this.$dom;
            e.delegate(".js_orangejt_tips", "mouseover", function(e) {
                $(this).find(".js_xth_tips").removeClass("hide")
            }
            ).delegate(".js_orangejt_tips", "mouseout", function(e) {
                $(this).find(".js_xth_tips").addClass("hide")
            }
            )
        }
        ;
        a.fn.disableVoucher = function(e) {
            var t = $(u);
            if (!e) {
                t.addClass("hide")
            } else {
                t.removeClass("hide")
            }
        }
        ;
        a.fn.toggleDisplay = function(e, t, n) {
            n = n || s;
            var r = $(n).find(e);
            if (t) {
                r.removeClass("hide")
            } else {
                r.addClass("hide")
            }
        }
        ;
        a.fn.disableInsure = function(e) {
            var t = $(o);
            var n = $("#js_insure_dis");
            if (!e) {
                t.addClass("hide");
                n.addClass("hide")
            } else {
                t.removeClass("hide");
                n.removeClass("hide")
            }
        }
        ;
        a.fn.disableHYInsure = function(e) {
            var t = $(i);
            if (e) {
                t.removeClass("hide")
            } else {
                t.addClass("hide")
            }
        }
        ;
        a.fn._toggleInsuranceTip = function() {
            $("body").delegate(".poplayer_box .js_insureDetail_handler", "mouseover", function(e) {
                var t = e.currentTarget;
                var n = $(t).find(".js_insureTipsContainer");
                n.css("display", "inline")
            }
            ).delegate(".poplayer_box .js_insureDetail_handler", "mouseout", function(e) {
                var t = e.currentTarget;
                var n = $(t).find(".js_insureTipsContainer");
                n.css("display", "none")
            }
            )
        }
        ;
        n.exports = a
    }
    (t.exports, t, e);
    e.____MODULES["c960e14b5b658a5425957d1636e48fe2"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "f1056c3f474bb7b033c299bbf321190c",
        filename: "Agreement.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        var i = e.____MODULES["285adc5af3055e36addfeabe5289c690"];
        var s = e.____MODULES["312540359c661f626d6031b9f938e9a2"];
        var o = "#insurance_placeholder";
        var u = "#js_vouchers_rules";
        var a = "#js_is5Insure";
        var f = "#js_favInsurance";
        var l = s.create();
        var c = e.____MODULES["c960e14b5b658a5425957d1636e48fe2"];
        l.fn.initialize = function(e) {
            this.originData = e.originData;
            this.agreementModel = e.agreementModel;
            this.roundTrip = e.originData.roundTrip;
            this.checheModel = e.checheModel;
            this.voucherModel = e.voucherModel;
            this.priceModel = e.priceModel;
            this.productModel = e.productModel;
            this.view = new c;
            this._channelBind();
            this.updateView();
            this.showrule()
        }
        ;
        l.fn.updateView = function() {
            this._draw()
        }
        ;
        l.fn._channelBind = function() {
            var e = this;
            i.on("updateview.broadcast", function() {
                e.updateView()
            }
            );
            i.on("update.agreement", function(t, n) {
                e.update(n)
            }
            );
            i.on("toggledisplay.agreement", function(t, n, r, i) {
                e.view.toggleDisplay(n, r, i)
            }
            );
            i.on("disablevoucher.agreement", function(t, n) {
                e.view.disableVoucher(n)
            }
            );
            i.on("disableinsure.agreement", function(t, n) {
                e.view.disableInsure(n)
            }
            );
            i.on("disablehyinsure.agreement", function(t, n) {
                e.view.disableHYInsure(n)
            }
            );
            i.on("selectallinsure.agreement", function(t) {
                e.selectAllInsure()
            }
            );
            i.on("selectallhyinsure.agreement", function(t) {
                e.selectAllHYInsure()
            }
            );
            i.on("disablevouchers.agreement", function(t, n) {
                e.disableVouchers(n)
            }
            );
            i.on("showspecialtips.agreement", function(t, n) {
                e.showSpecialTips(n)
            }
            );
            i.on("showrecinsurancetips.agreement", function(t, n) {
                e.showRecInsuranceTips(n)
            }
            );
            i.on("clearhyinsure.agreement", function() {
                e.clearHYInsure()
            }
            );
            i.on("recoverinsure.agreement", function() {
                e.recoverInsure()
            }
            )
        }
        ;
        l.fn.selectAllInsure = function() {
            $('[name="count"]').each(function(e, t) {
                $(t).data("YSELECTOR").index(1)
            }
            )
        }
        ;
        l.fn.selectAllHYInsure = function() {
            $('[name="ywcount"]').each(function(e, t) {
                $(t).data("YSELECTOR").index(1)
            }
            )
        }
        ;
        l.fn._draw = function(e) {
            var t = this
              , n = t.agreementModel
              , r = n.defaultInsuerGroup()
              , i = r[0]
              , s = r.length > 1
              , o = t.originData.priceInfo.prdTag == "UFF" ? t.productModel.getCurSel() : false
              , u = n.showHYInsure()
              , a = n.getHYInsure()
              , f = t.voucherModel
              , l = t.checheModel.isShowCar();
            var c = t._getInsureHtml(r);
            if (i) {
                n.insureTip = c
            }
            if (u) {
                n.hyInsureTip = t._getHYInsureHtml(a)
            }
            var h = t.voucherModel.isJSJVoucher();
            var p = t.originData.priceInfo.bpr;
            var d = t.originData.priceInfo.pr;
            var v = n._data.priceInfo.specialPrice;
            var m = v.type;
            var g = t.getSCTip();
            var y = t.originData.priceInfo.prdTag == "LCF";
            this.view.rend({
                isRD: o,
                isIQ: !!n.hasIq(),
                isLD: s,
                nurl1: i && i.nurl,
                voucherType: f.getVoucherType(),
                voucherName: f.getVoucherName(),
                showHYInsure: u,
                hyInsure: a,
                nPrice: p,
                niPrice: d,
                xth: t.productModel.productName === "LPF",
                xfx: n._data.priceInfo.xfx,
                lijian: n._data.priceInfo.cutPrice,
                islcf: y,
                showSpecialTips: m != 0,
                showCar: l,
                sendFlyFund: this.originData.sendFlyFund,
                favourPrice: t.originData.insurInfo.profitsFee,
                useFlyFund: t.originData.useFlyFund,
                agreeUseFlyFund: t.priceModel.isCheckFlyFund(),
                isLogin: UserStatus.isLogin(),
                agreementHOST: n._data.priceInfo.xjbw || y ? "http://qnf.trade.qunar.com" : "",
                scTip: g
            }, n._data);
            this.disFlyFund()
        }
        ;
        l.fn.disFlyFund = function() {
            var e = this.originData;
            if (e.sendFlyFund && UserStatus.isLogin()) {
                this.view.toggleDisplay(".j_flyfund_tip", true)
            }
        }
        ;
        l.fn.getSCTip = function() {
            var e = this.originData.flightInfo;
            var t = false;
            var n = {};
            var r = "";
            var i = "";
            for (var s = 0, o = e.length; s < o; s++) {
                n = e[s];
                r = n["co"].substring(0, 2).toUpperCase();
                i = n["gx"].substring(0, 2).toUpperCase();
                if (r === "SC" || i === "SC") {
                    t = true;
                    break
                }
            }
            return t
        }
        ;
        l.fn.update = function(e) {
            $.extend(this.agreementModel.info, e || {})
        }
        ;
        l.fn.showrule = function() {
            var e = this.agreementModel._data;
            if (e.packingSuccess) {
                $(".js_orangejt_tips").addClass("hide")
            } else {
                $(".js_orangejt_tips").removeClass("hide")
            }
        }
        ;
        l.fn.disableVouchers = function(e) {
            var t = $(u);
            if (!e) {
                t.addClass("hide")
            } else {
                t.removeClass("hide")
            }
        }
        ;
        l.fn._getInsureHtml = function(e) {
            var t = this.agreementModel.defaultInsuer(e)
              , n = this.voucherModel;
            if (!t) {
                return ""
            }
            var r = t.min
              , i = e.length > 1;
            var s = n.isJSJVoucher();
            var o = n.getVoucherSaleType();
            var u = n.voucherTipMap();
            var a = QTMPL.BookingInsuranceTip.render({
                jsjVoucher: s,
                voucherTipMap: u,
                isMin: r === 0 ? true : false,
                insure: t,
                isLD: i,
                showVoucher: s && o != "2",
                insureLD: e[1]
            });
            return a
        }
        ;
        l.fn.showRecInsuranceTips = function(e) {
            var t = this;
            var n = t.agreementModel;
            var r = n._recInsuranceGroup()[0];
            var i = QTMPL.BookingAgreementRecommendInsurance.render({
                insurance: r.insurance,
                amount: r.amount,
                price: r.price,
                nurl: r && r.nurl,
                insureTips: t._getInsureHtml(n._recInsuranceGroup())
            });
            var s = $.ui.confirm(i, {
                ok_txt: "购买",
                ok_cls: "btn_blue",
                cancel_txt: "不需要",
                ok_call: function() {
                    t._toRecommendedInsurance(e)
                },
                cancel_call: function() {
                    typeof e === "function" && e()
                },
                callback: function() {
                    t.view._toggleInsuranceTip()
                }
            })
        }
        ;
        l.fn.showSpecialTips = function(e) {
            var t = this
              , n = t.info
              , r = t.agreementModel
              , i = r._specialInsureGroup()
              , s = r.defaultInsuer(i)
              , o = "";
            var u = false;
            if (r.isNoSpecialInsurance(r.defaultInsureTag())) {
                u = true
            }
            if (!r.hasIq()) {
                u = true
            }
            if (i.length < 1) {
                u = true
            }
            if (r.defaultInsureTag() !== r._currInsureTag) {
                u = true
            }
            if (u) {
                typeof e === "function" && e();
                return
            }
            var a = t.priceModel.diffPrice();
            var f = r._diffPrice(i);
            if (r._insureCount() > 0 && f > 0) {
                o = "每份保险+" + f + "元，保额可达" + s.amount + "万/份，" + s.insurance + "！"
            }
            if (r._insureCount() === 0) {
                o = "出行购买航意险" + s.price + "元/份，保额高达" + s.amount + "万/份保险，<br />" + s.insurance;
                if (a > 0) {
                    o += "，更享票价优惠" + a + "元/张"
                }
                o += "！"
            }
            if (o !== "") {
                t._showTips(o, e);
                return true
            }
        }
        ;
        l.fn.recoverInsure = function() {
            var e = this;
            var t = e.agreementModel;
            e._switchInsure(t.defaultInsuerGroup(), t.defaultInsureTag());
            e._recoverInsureCount();
            $(a).show()
        }
        ;
        l.fn._showTips = function(e, t) {
            var n = this;
            $.ui.confirm(e, {
                ok_txt: "购买",
                ok_cls: "btn_blue",
                cancel_txt: "不需要",
                ok_call: function() {
                    n._toSpecial();
                    typeof t === "function" && t()
                },
                cancel_call: function() {
                    typeof t === "function" && t()
                }
            })
        }
        ;
        l.fn._toSpecial = function() {
            var e = this
              , t = e.agreementModel
              , n = e.roundTrip ? 2 : 1;
            e._switchInsure(t._specialInsureGroup(), t._getSpecialInsuranceTag());
            if (t._insureCount() === 0) {
                i.trigger("selectinsure.passengerinfo", 1 * n)
            }
            t._defaultInsureCount = t.info.insureCount;
            e._createRecover();
            $(a).hide()
        }
        ;
        l.fn._toRecommendedInsurance = function(e) {
            var t = this
              , n = t.agreementModel
              , r = t.roundTrip ? 2 : 1;
            t._switchInsure(n._recInsuranceGroup(), n._getRecInsuranceTag());
            if (n._insureCount() === 0) {
                i.trigger("selectinsure.passengerinfo", 1 * r)
            }
            n._defaultInsureCount = n.info.insureCount;
            i.trigger("hideinsurerecover.passengerinfo");
            $(f).hide();
            typeof e === "function" && e()
        }
        ;
        l.fn._switchInsure = function(e, t) {
            var n = this
              , r = n.agreementModel
              , s = r.defaultInsuer(e)
              , o = r._insureCount() * s.price;
            i.trigger("updateinsureprice.passengerinfo", s.price);
            i.trigger("update.priceinfo", {
                insure: o
            });
            i.trigger("update.installment", {
                insure: o
            });
            n._draw(e);
            n.view.disableInsure(o);
            r._currInsureGroup = e;
            r._currInsureTag = t;
            i.trigger("resetinsureselect.passengerinfo", s)
        }
        ;
        l.fn._createRecover = function() {
            var e = this;
            var t = e.agreementModel;
            var n = e.voucherModel;
            var r = function() {
                var e = n.isJSJVoucher();
                if (e) {
                    switch (n.getVoucherType()) {
                    case "7":
                        return "无接机、";
                    case "8":
                        return "无送机、";
                    case "9":
                        return "无接送机、"
                    }
                }
                return ""
            }
            ();
            if (t._insureCount() > 0) {
                i.trigger("showinsurerecover.passengerinfo", "恢复" + e.defaultInsuerGroup()[0].price + "元保险")
            } else {
                var s = e.priceModel.diffPrice();
                var o = (s === 0 ? "" : "不享票价优惠" + s + "元 ") + "恢复" + r + "无保险";
                i.trigger("showinsurerecover.passengerinfo", o)
            }
        }
        ;
        l.fn._recoverInsureCount = function() {
            var e = this;
            i.trigger("selectinsure.passengerinfo", e._defaultInsureCount)
        }
        ;
        l.fn._getHYInsureHtml = function(e) {
            var t = QTMPL.BookingInsuranceTip.render({
                hyInsure: e
            });
            return t
        }
        ;
        l.fn.clearHYInsure = function() {
            var e = this;
            e.agreementModel.showHYInsure(false);
            i.trigger("clearhyinsure.passengerinfo")
        }
        ;
        n.exports = l
    }
    (t.exports, t, e);
    e.____MODULES["f1056c3f474bb7b033c299bbf321190c"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "14ec9688ebbf8542a34e7ca7b2c280ed",
        filename: "index.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        e.____MODULES["53c3364968d31d8bd29829dd6e1c89f6"];
        var i = e.____MODULES["f1056c3f474bb7b033c299bbf321190c"];
        n.exports = i
    }
    (t.exports, t, e);
    e.____MODULES["14ec9688ebbf8542a34e7ca7b2c280ed"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "586f4e14418d53da54c9d201e25a8836",
        filename: "contactorModel.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        var i = e.____MODULES["285adc5af3055e36addfeabe5289c690"];
        var s = e.____MODULES["312540359c661f626d6031b9f938e9a2"];
        var o = "save_contact_to_user";
        var u = window.model;
        var a = s.create();
        a.fn.initialize = function(e) {
            this.contactData = null 
        }
        ;
        a.fn.getPnrInfo = function() {
            var e = [];
            var t = this;
            var n = encodeURIComponent;
            var r = t.DOM("email").val() === t.DOM("email").data("placeholder") ? "" : t.DOM("email").val();
            e.push("contact=" + n(t.DOM("name").val()));
            e.push("contactMob=" + n(t.DOM("mobile").val()));
            e.push("contactEmail=" + n(r));
            e.push("contactPreNum=" + n(t.DOM("mobile_prenum").val()));
            return e.join("&")
        }
        ;
        a.fn.getContactInfo = function() {
            if (!$("#" + o).is(":checked")) {
                return {}
            }
            var e = this;
            var t = e.DOM("email");
            if (t[0].isPlaceHolderEmpty && t[0].isPlaceHolderEmpty()) {
                t = ""
            } else {
                t = $.trim(t.val())
            }
            var n = {
                id: e.DOM("id").val(),
                usersource: "flight",
                email: t,
                mobile: e.DOM("mobile").val(),
                prenum: e.DOM("mobile_prenum").val(),
                name: e.DOM("name").val()
            };
            return n
        }
        ;
        a.fn.DOM = function(e) {
            var t = "#module_contact";
            var n = {
                name: $("[name=contact_name]", t),
                id: $("[name=contact_id]", t),
                mobile: $("[name=contact_phone]", t),
                email: $("[name=contact_email]", t),
                mobile_prenum: $("[name=contact_mobile_prenum]", t),
                btn_show_prenum: $(".btn_show_prenum_field", t)
            };
            return n[e]
        }
        ;
        a.fn.getPassengerDataById = function(e) {
            if (!e) {
                return null 
            }
            var t = this
              , n = t.contactData;
            for (var r = 0, i = n.length; r < i; r++) {
                if (n[r].id === e) {
                    return n[r]
                }
            }
            return null 
        }
        ;
        u.autoRun.push(function(e) {
            u.dataModel.contactorModel = new a(e)
        }
        )
    }
    (t.exports, t, e);
    e.____MODULES["586f4e14418d53da54c9d201e25a8836"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "cc27d129a8215096860877dc1dfbd5a4",
        filename: "BookingContactItem.mustache",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(e, t, n) {
        if (typeof window.QTMPL === "undefined")
            window.QTMPL = {};
        window.QTMPL["BookingContactItem"] = new window.Hogan.Template(function(e, t, n) {
            var r = this;
            r.b(n = n || "");
            r.b('<div class="title_main">');
            r.b("\n" + n);
            r.b("    <span>联系人信息</span>");
            r.b("\n" + n);
            r.b('    <button type="button" class="btn_qnhelp');
            if (r.s(r.f("isLogin", e, t, 1), e, t, 0, 103, 108, "{{ }}")) {
                r.rs(e, t, function(e, t, n) {
                    n.b(" hide")
                }
                );
                e.pop()
            }
            r.b('"></button>');
            r.b("\n" + n);
            r.b("    <!-- <em>（请准确填写联系人信息，以便我们与您联系）</em> -->");
            r.b("\n" + n);
            r.b("</div>");
            r.b("\n" + n);
            r.b("<!--已经登录，并且已经有常用联系人star-->");
            r.b("\n" + n);
            r.b('<div class="user_containfo" id="user_containfo"></div>');
            r.b("\n" + n);
            r.b("<!--已经登录，并且已经有常用联系人end-->");
            r.b("\n" + n);
            r.b('<ul class="contact_form">');
            r.b("\n" + n);
            r.b('    <input type="hidden" value="" name="contact_id" />');
            r.b("\n" + n);
            r.b('    <li class="ct1">');
            r.b("\n" + n);
            r.b("        <span>姓名</span>");
            r.b("\n" + n);
            r.b('        <span class="req"></span>');
            r.b("\n" + n);
            r.b('        <label style="display:inline-block;">');
            r.b("\n" + n);
            r.b('            <span class="textbox_b">');
            r.b("\n" + n);
            r.b('                <input data-placeholder="中文/英文" autocomplete="off" name="contact_name" data-jvalid-ruler="empty toolong" type="text" class="input_ctname" />');
            r.b("\n" + n);
            r.b("            </span>");
            r.b("\n" + n);
            r.b("        </label>");
            r.b("\n" + n);
            r.b("       </li>");
            r.b("\n" + n);
            r.b('    <li class="ct2">');
            r.b("\n" + n);
            r.b("        <span>手机</span>");
            r.b("\n" + n);
            r.b('        <span class="req"></span>');
            r.b("\n" + n);
            r.b('        <label style="display:none">');
            r.b("\n" + n);
            r.b('            <span class="textbox_b e_correct">');
            r.b("\n" + n);
            r.b('                <input autocomplete="off" name="contact_mobile_prenum" value="86" data-jvalid-ruler="mobile_prenum" type="text" class="input_ctphone_prenum js-phoneDefer" maxlength="5"/>');
            r.b("\n" + n);
            r.b("            </span>");
            r.b("\n" + n);
            r.b('            <span class="dash-line">&nbsp;-&nbsp;</span>');
            r.b("\n" + n);
            r.b("        </label>");
            r.b("\n" + n);
            r.b('        <label style="display:inline-block;">');
            r.b("\n" + n);
            r.b('            <span class="textbox_b">');
            r.b("\n" + n);
            r.b('                <input style="width: " data-placeholder="通知出票状态和航班短信" autocomplete="off" name="contact_phone" data-jvalid-ruler="empty international_mobile" type="text" maxlength="11" class="input_ctphone js-phoneDefer" />');
            r.b("\n" + n);
            r.b("            </span>");
            r.b("\n" + n);
            r.b("        </label>");
            r.b("\n" + n);
            r.b('        <a href="javascript:;" class="btn_show_prenum_field">使用境外手机号</a>');
            r.b("\n" + n);
            r.b("    </li>");
            r.b("\n" + n);
            r.b('    <li class="ct3">');
            r.b("\n" + n);
            r.b("        <span>电子邮箱</span>");
            r.b("\n" + n);
            r.b('        <span class="req"></span>');
            r.b("\n" + n);
            r.b('        <label style="display:inline-block;">');
            r.b("\n" + n);
            r.b('            <span class="textbox_b">');
            r.b("\n" + n);
            r.b('                <input data-placeholder="选填：(格式：a@b.c)" autocomplete="off" name="contact_email" data-jvalid-ruler="allow_empty email" type="text" class="input_email" />');
            r.b("\n" + n);
            r.b("            </span>");
            r.b("\n" + n);
            r.b("        </label>");
            r.b("\n" + n);
            r.b("    </li>");
            r.b("\n" + n);
            r.b('    <li class="ct4 ');
            if (!r.s(r.f("isLogin", e, t, 1), e, t, 1, 0, 0, "")) {
                r.b(" hide")
            }
            r.b('">');
            r.b("\n" + n);
            r.b('        <input type="checkbox" ');
            if (r.s(r.f("isLogin", e, t, 1), e, t, 0, 2085, 2103, "{{ }}")) {
                r.rs(e, t, function(e, t, n) {
                    n.b(' checked="checked"')
                }
                );
                e.pop()
            }
            r.b(' id="save_contact_to_user" class="checkbox" >');
            r.b("\n" + n);
            r.b("        <label>保存至常用联系人</label>");
            r.b("\n" + n);
            r.b("    </li>");
            r.b("\n" + n);
            r.b("</ul>");
            return r.fl();
        }
        );
        if (typeof t !== "undefined")
            t.exports = window.QTMPL["BookingContactItem"]
    }
    (t.exports, t, e);
    e.____MODULES["cc27d129a8215096860877dc1dfbd5a4"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "248e94b4df37e10086ba73704c14d757",
        filename: "contactorView.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        e.____MODULES["cc27d129a8215096860877dc1dfbd5a4"];
        var i = e.____MODULES["285adc5af3055e36addfeabe5289c690"];
        var s = e.____MODULES["de4518e1da70f9df1cd8ca708e702414"];
        var o = s.extend();
        var u = null ;
        o.fn.init = function(e) {
            this.controller = e;
            return this
        }
        ;
        o.fn.render = function() {
            this.drawStruct();
            this.initDOMSelector();
            this.bindEvent()
        }
        ;
        o.fn.bindEvent = function() {
            var e = this;
            var t = e.controller;
            var n = t.JContainer;
            n.delegate(".btn_qnhelp", "click", function() {
                QNR.showLoginDia({
                    proxy: "/tts/proxy.htm",
                    twoWeek: true
                })
            }
            ).delegate(".btn_show_prenum_field", "click", function() {
                var e = $(this);
                e.addClass("hide").parent().find("label").css("display", "inline-block")
            }
            ).delegate(".J-yh2_radio", "click", function() {
                t.DOM("name").blur();
                t.DOM("email").blur();
                t.DOM("mobile").blur()
            }
            )
        }
        ;
        o.fn.drawStruct = function() {
            var e = this;
            var t = e.controller;
            var n = "#module_contact";
            var r = QTMPL.BookingContactItem.render({
                isLogin: UserStatus.isLogin()
            });
            var i = $(n);
            i.html(r);
            t.JContainer = i;
            $("[data-placeholder]", i).placeholder()
        }
        ;
        o.fn.initDOMSelector = function() {
            var e = this;
            var t = e.controller;
            var n = t.JContainer;
            t.DOM_HASH_ = {
                name: $("[name=contact_name]", n),
                id: $("[name=contact_id]", n),
                mobile: $("[name=contact_phone]", n),
                email: $("[name=contact_email]", n),
                mobile_prenum: $("[name=contact_mobile_prenum]", n),
                btn_show_prenum: $(".btn_show_prenum_field", n)
            }
        }
        ;
        u = new o;
        i.on("ready.contactor", function(e, t) {
            u.init(t).render()
        }
        )
    }
    (t.exports, t, e);
    e.____MODULES["248e94b4df37e10086ba73704c14d757"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "6ab22e2c5234d0e7769dda095d7d4363",
        filename: "BookingClickBoard.mustache",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(e, t, n) {
        if (typeof window.QTMPL === "undefined")
            window.QTMPL = {};
        window.QTMPL["BookingClickBoard"] = new window.Hogan.Template(function(e, t, n) {
            var r = this;
            r.b(n = n || "");
            r.b('<div class="ps_title">');
            r.b("\n" + n);
            r.b('    <div class="sel_btn"><span>');
            r.b(r.v(r.f("title", e, t, 0)));
            r.b("<em>(");
            r.b(r.v(r.f("num", e, t, 0)));
            r.b(")</em></span></div>");
            r.b("\n" + n);
            r.b("</div>");
            r.b("\n" + n);
            r.b('<div class="user_passinfoct sel_content_fold">');
            r.b("\n" + n);
            r.b('     <a class="sel_fold');
            if (r.s(r.f("hide", e, t, 1), e, t, 0, 181, 186, "{{ }}")) {
                r.rs(e, t, function(e, t, n) {
                    n.b(" hide")
                }
                );
                e.pop()
            }
            r.b('" href="javascript:;">更多</a>');
            r.b("\n" + n);
            r.b('     <table cellspacing="0" cellpadding="0">');
            r.b("\n" + n);
            r.b("        <tbody>");
            r.b("\n" + n);
            if (r.s(r.f("empty", e, t, 1), e, t, 0, 307, 736, "{{ }}")) {
                r.rs(e, t, function(e, t, n) {
                    if (n.s(n.f("type", e, t, 1), e, t, 0, 333, 505, "{{ }}")) {
                        n.rs(e, t, function(e, t, n) {
                            n.b('                <tr><td>您的常用联系人列表为空，可在“<a href="http://user.qunar.com/userinfo/index.jsp#address" target="_blank">常用地址</a>”中添加，以后就可以自动为您填写常用联系人了</td></tr>');
                            n.b("\n")
                        }
                        );
                        e.pop()
                    }
                    if (!n.s(n.f("type", e, t, 1), e, t, 1, 0, 0, "")) {
                        n.b('                <tr><td>您的常用乘机人列表为空，可在“<a href="http://user.qunar.com/userinfo/index.jsp#contact" target="_blank">常用旅客信息</a>”中添加，以后就可以自动为您填写常用乘机人了</td></tr>');
                        n.b("\n")
                    }
                }
                );
                e.pop()
            }
            if (!r.s(r.f("empty", e, t, 1), e, t, 1, 0, 0, "")) {
                r.b("                ");
                r.b(r.t(r.f("htmlList", e, t, 0)));
                r.b("\n")
            }
            r.b("        </tbody>");
            r.b("\n" + n);
            r.b("    </table>  ");
            r.b("\n" + n);
            r.b("</div>");
            return r.fl();
        }
        );
        if (typeof t !== "undefined")
            t.exports = window.QTMPL["BookingClickBoard"]
    }
    (t.exports, t, e);
    e.____MODULES["6ab22e2c5234d0e7769dda095d7d4363"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "85b1eefad6009002fbf49372b9912109",
        filename: "BookingClickItem.mustache",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(e, t, n) {
        if (typeof window.QTMPL === "undefined")
            window.QTMPL = {};
        window.QTMPL["BookingClickItem"] = new window.Hogan.Template(function(e, t, n) {
            var r = this;
            r.b(n = n || "");
            r.b("<td>");
            r.b("\n" + n);
            r.b('    <input class="js-logDefer J-yh2_');
            r.b(r.v(r.f("type", e, t, 0)));
            r.b('" data-id="');
            r.b(r.v(r.f("uid", e, t, 0)));
            r.b('" id="');
            r.b(r.v(r.f("id", e, t, 0)));
            r.b('" name="');
            r.b(r.v(r.f("name", e, t, 0)));
            r.b('" type="');
            r.b(r.v(r.f("type", e, t, 0)));
            r.b('" value="" />');
            r.b("\n" + n);
            r.b('    <label for="');
            r.b(r.v(r.f("id", e, t, 0)));
            r.b('" title="');
            r.b(r.v(r.f("namefull", e, t, 0)));
            r.b('">');
            r.b(r.v(r.f("name12", e, t, 0)));
            r.b("</label>");
            r.b("\n" + n);
            r.b("</td>");
            return r.fl();
        }
        );
        if (typeof t !== "undefined")
            t.exports = window.QTMPL["BookingClickItem"]
    }
    (t.exports, t, e);
    e.____MODULES["85b1eefad6009002fbf49372b9912109"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "786d335883e95bb7ac63e35fe4b602cf",
        filename: "Clickboard.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        e.____MODULES["6ab22e2c5234d0e7769dda095d7d4363"];
        e.____MODULES["85b1eefad6009002fbf49372b9912109"];
        var i = e.____MODULES["285adc5af3055e36addfeabe5289c690"];
        var s = e.____MODULES["312540359c661f626d6031b9f938e9a2"];
        var o = "ontouchstart" in window || window.DocumentTouch && document instanceof DocumentTouch;
        var u = s.create();
        u.fn.initialize = function(e) {
            this.init(e)
        }
        ;
        u._index_ = 0;
        u.fn.init = function(e) {
            var t = this;
            if (!e.data) {
                e.data = []
            }
            var n = {
                title: e.title,
                num: e.data.length,
                type: e.type === "single",
                empty: e.data.length === 0,
                hide: e.data.length <= 5,
                htmlList: function() {
                    var n = e.data, r, i = ["<tr>"], s = Math.ceil(n.length / 5) * 5, o = u._index_++;
                    for (var a = 0; a < s; a++) {
                        r = n[a];
                        if (a % 5 === 0 && a !== 0 && a !== s - 1) {
                            i.push("<tr></tr>")
                        }
                        if (r) {
                            i.push(t._renderBoardItem(r, e.type, o))
                        } else {
                            i.push("<td></td>")
                        }
                    }
                    i.push("</tr>");
                    return i.join("\n")
                }
            };
            var r = QTMPL.BookingClickBoard.render(n);
            t._container = e.container;
            t._oncheck = e.oncheck || $.noop;
            t._onuncheck = e.onuncheck || $.noop;
            $(e.container).html(r).removeClass("hide");
            t._bindEvents()
        }
        ;
        u.fn.uncheck = function(e) {
            var t = this.getInputById(e);
            if (t) {
                t.checked = false
            }
        }
        ;
        u.fn.getInputById = function(e) {
            var t = this, n = $("input", $(t._container)), r;
            e += "";
            for (var i = 0, s = n.length; i < s; i++) {
                r = n[i];
                if (r.getAttribute("data-id") === e) {
                    return r
                }
            }
            return null 
        }
        ;
        u.fn._renderBoardItem = function(e, t, n) {
            var r = t === "single" ? "radio" : "checkbox"
              , i = r + e.id + n
              , s = r + t + n;
            return QTMPL.BookingClickItem.render({
                type: r,
                id: i,
                name: s,
                uid: e.id,
                namefull: e.name,
                name12: Utils.shorterString(e.name, 12)
            })
        }
        ;
        u.fn._bindEvents = function() {
            var e = this;
            var t = o ? "touchStart" : "mousedown"
              , n = false;
            var r = 0
              , i = 0;
            $(e._container).delegate(".sel_fold", "click", function(e) {
                var t = $(this)
                  , n = t.parent();
                if (!r) {
                    r = t.next("table").outerHeight()
                }
                if (n.hasClass("sel_content_fold")) {
                    if (!i) {
                        i = n.height()
                    }
                    n.transit({
                        height: r
                    }, 300, function() {
                        n.removeClass("sel_content_fold");
                        t.text("收起")
                    }
                    )
                } else {
                    n.transit({
                        height: i
                    }, 300, function() {
                        n.addClass("sel_content_fold");
                        t.text("更多")
                    }
                    )
                }
            }
            ).delegate("input:checkbox", "click", function(t) {
                if (this.checked) {
                    e._oncheck(this)
                } else {
                    e._onuncheck(this)
                }
            }
            ).delegate("input:radio", "click", function(t) {
                if (n) {
                    this.checked = false;
                    e._onuncheck(this);
                    n = false
                } else {
                    e._oncheck(this)
                }
            }
            ).delegate("label,input:radio", t, function(e) {
                n = $(this).parent().find("input:first").is(":checked")
            }
            )
        }
        ;
        n.exports = u
    }
    (t.exports, t, e);
    e.____MODULES["786d335883e95bb7ac63e35fe4b602cf"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "8d5168dbb4341c76a4be945117498c25",
        filename: "index.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        var i = e.____MODULES["786d335883e95bb7ac63e35fe4b602cf"];
        n.exports = i
    }
    (t.exports, t, e);
    e.____MODULES["8d5168dbb4341c76a4be945117498c25"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "d660749ffc8dfbcc1cd72a320e67de37",
        filename: "Contactor.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        var i = e.____MODULES["285adc5af3055e36addfeabe5289c690"];
        var s = e.____MODULES["312540359c661f626d6031b9f938e9a2"];
        var o = e.____MODULES["8d5168dbb4341c76a4be945117498c25"];
        var u = s.create();
        u.fn.initialize = function(e) {
            this.contactorModel = e.contactorModel;
            this._bind()
        }
        ;
        u.fn._bind = function() {
            var e = this;
            i.trigger("ready.contactor", [e]);
            i.on("dataready.contactor", function(t, n) {
                e.initClickBoard(n)
            }
            );
            i.on("loaderror.contactor", function() {
                e.showHelper()
            }
            )
        }
        ;
        u.fn.intro = function() {
            return {
                name: this.DOM("name").val(),
                mobile: this.DOM("mobile").val()
            }
        }
        ;
        u.fn.DOM = function(e) {
            return this.DOM_HASH_[e]
        }
        ;
        u.fn.initClickBoard = function(e) {
            function n(e) {
                var n = parseInt($(e).data("id"), 10)
                  , r = contactorModel.getPassengerDataById(n);
                if (r) {
                    if (r.prenum != 86) {
                        t.DOM("mobile_prenum").parents("label").css("display", "inline-block");
                        t.DOM("btn_show_prenum").addClass("hide")
                    } else {
                        t.DOM("mobile_prenum").parents("label").hide();
                        t.DOM("btn_show_prenum").removeClass("hide")
                    }
                    t.setValue(r)
                }
            }
            function r(e) {
                t.DOM("mobile_prenum").parents("label").hide();
                t.DOM("btn_show_prenum").removeClass("hide");
                t.reset()
            }
            var t = this;
            contactorModel = t.contactorModel;
            t._clickBoard = new o({
                type: "single",
                oncheck: n,
                onuncheck: r,
                container: "#user_containfo",
                data: e,
                title: "常用联系人"
            });
            contactorModel.contactData = e;
            $("button.btn_qnhelp", t.JContainer).hide();
            t.JContainer.find(".J-yh2_radio").eq(0).trigger("click");
            $("#save_contact_to_user").attr("checked", true).parent().removeClass("hide")
        }
        ;
        u.fn.setValue = function(e) {
            var t = this;
            t.DOM("id").val(e.id);
            t.DOM("mobile_prenum").val(e.prenum).jvalidTip("correct");
            t.DOM("mobile").val(e.mobile).jvalidTip("correct");
            t.DOM("name").val(e.name).jvalidTip("correct");
            t.DOM("email").val(e.email).jvalidTip("correct");
            i.trigger("setmobile.cheche")
        }
        ;
        u.fn.reset = function() {
            var e = this;
            e.DOM("id").val("");
            e.DOM("name").val("").jvalidTip("reset");
            e.DOM("mobile").val("").jvalidTip("reset");
            e.DOM("email").val("").jvalidTip("reset");
            e.DOM("mobile_prenum").val("86").jvalidTip("correct")
        }
        ;
        u.fn.showHelper = function() {
            this.JContainer.find(".btn_qnhelp").removeClass("hide")
        }
        ;
        n.exports = u
    }
    (t.exports, t, e);
    e.____MODULES["d660749ffc8dfbcc1cd72a320e67de37"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "32fb017c1b235daa5f8fbcfa867a9e2f",
        filename: "index.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        e.____MODULES["586f4e14418d53da54c9d201e25a8836"];
        e.____MODULES["248e94b4df37e10086ba73704c14d757"];
        var i = e.____MODULES["d660749ffc8dfbcc1cd72a320e67de37"];
        n.exports = i
    }
    (t.exports, t, e);
    e.____MODULES["32fb017c1b235daa5f8fbcfa867a9e2f"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "b1adcbbeb3da980f9bd03e2c4d81ebd1",
        filename: "passengerInfoModel.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        var i = e.____MODULES["285adc5af3055e36addfeabe5289c690"];
        var s = e.____MODULES["312540359c661f626d6031b9f938e9a2"];
        var o = "save_passenger_to_user";
        var u = window.model;
        var a = s.create();
        a.fn.initialize = function(e) {
            var t = this;
            t.originData = e;
            t.priceInfo = e.priceInfo;
            t.normalizeModel = u.dataModel.normalizeModel;
            t.contactorModel = u.dataModel.contactorModel;
            t.current = [];
            t._quantity = null 
        }
        ;
        a.fn.getQuantity = function() {
            return this._quantity
        }
        ;
        a.fn.setQuantity = function(e) {
            return this._quantity = e
        }
        ;
        a.fn.caculateTickets = function() {
            var e = this;
            var t = e.priceInfo.inventory
              , n = parseInt(t.adult || 0, 10)
              , r = parseInt(t.child || 0, 10)
              , i = parseInt(t.infant || 0, 10)
              , s = parseInt(t.all || 0, 10);
            if (!isNaN(n)) {
                if (isNaN(r)) {
                    r = n * 2
                } else {
                    r = Math.min(n * 2, r)
                }
                if (isNaN(i)) {
                    i = n
                } else {
                    i = Math.min(n, i)
                }
            }
            return {
                adult: isNaN(n) ? Number.MAX_VALUE : n,
                child: isNaN(r) ? Number.MAX_VALUE : r,
                infant: isNaN(i) ? Number.MAX_VALUE : i,
                all: isNaN(s) ? Number.MAX_VALUE : s
            }
        }
        ;
        a.fn.isArrivalAliCity = function() {
            var e = this.originData.flightInfo;
            var t = this._isSomeChineseID();
            if (t && (e[0] && e[0].ac === "阿里" || e[1] && e[1].ac === "阿里")) {
                return true
            }
            return false
        }
        ;
        a.fn._isSomeChineseID = function() {
            var e = 0;
            $.each(this.current, function(t, n) {
                if (n.isChineseID()) {
                    e += 1
                }
            }
            );
            if (e > 0) {
                return true
            } else {
                return false
            }
        }
        ;
        a.fn.hasSameID = function() {
            var e = this
              , t = {}
              , n = false;
            $.each(e.current, function(e, r) {
                var i = r.idNumber();
                if (t[i]) {
                    n = true;
                    return false
                } else {
                    t[i] = 1
                }
            }
            );
            return n
        }
        ;
        a.fn.getAllPassenger = function() {
            return this.current
        }
        ;
        a.fn.getPassengerInfo = function() {
            if (!$("#" + o).is(":checked")) {
                return []
            }
            var e = [];
            $.each(this.current, function(t, n) {
                e.push(n.getPassengerInfo())
            }
            );
            return e
        }
        ;
        a.fn.getPnrInfo = function() {
            var e = [];
            $.each(this.current, function(t, n) {
                e.push(n.getPnrInfo())
            }
            );
            return e.join("&")
        }
        ;
        a.fn.getIdInfo = function() {
            var e = [];
            $.each(this.current, function(t, n) {
                e.push(n.getIdInfo())
            }
            );
            return e
        }
        ;
        a.fn.isOneAdultNoInsure = function() {
            var e = 1;
            $.each(this.current, function(t, n) {
                if (n.insures() === 0) {
                    e = 0;
                    return e
                }
            }
            );
            return e
        }
        ;
        a.fn.getBookingRefactorErrorTimeLog = function() {
            var e = this;
            var t = {
                passengerNameErrorTime: 0,
                idNumberErrorTime: 0,
                phoneNumberErrorTime: e.contactorModel.DOM("mobile").data("errorTime") || 0,
                emailErrorTime: e.contactorModel.DOM("email").data("errorTime") || 0
            };
            $.each(this.current, function(e, n) {
                var r = n._getBookingRefactorErrorTimeLog();
                t.passengerNameErrorTime += r.passengerNameErrorTime;
                t.idNumberErrorTime += r.idNumberErrorTime
            }
            );
            return t
        }
        ;
        a.fn.getBookingRefactorLog = function(e) {
            var t = {
                hychange: false,
                ywchange: false,
                hychangeAndBuy: false,
                ywchangeAndBuy: false
            };
            $.each(this.current, function(e, n) {
                var r = n._getBookingRefactorLog();
                if (r.hychange)
                    t.hychange = true;
                if (r.ywchange)
                    t.ywchange = true;
                if (r.hychangeAndBuy)
                    t.hychangeAndBuy = true;
                if (r.ywchangeAndBuy)
                    t.ywchangeAndBuy = true
            }
            );
            return t
        }
        ;
        u.autoRun.push(function(e) {
            u.dataModel.passengerInfoModel = new a(e)
        }
        )
    }
    (t.exports, t, e);
    e.____MODULES["b1adcbbeb3da980f9bd03e2c4d81ebd1"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "fb6e625af4aebf77cdcda3f9e71509e2",
        filename: "BookingPassengerContainer.mustache",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(e, t, n) {
        if (typeof window.QTMPL === "undefined")
            window.QTMPL = {};
        window.QTMPL["BookingPassengerContainer"] = new window.Hogan.Template(function(e, t, n) {
            var r = this;
            r.b(n = n || "");
            r.b('<div class="title_main">');
            r.b("\n" + n);
            r.b("    <span>乘机人信息</span>");
            r.b("\n" + n);
            r.b('    <button type="button" class="btn_qnhelp');
            if (r.s(r.f("isLogin", e, t, 1), e, t, 0, 103, 108, "{{ }}")) {
                r.rs(e, t, function(e, t, n) {
                    n.b(" hide")
                }
                );
                e.pop()
            }
            r.b('"></button>');
            r.b("\n" + n);
            r.b("</div>");
            r.b("\n" + n);
            r.b("<!--已经登录，并且已经有常用乘机人star-->");
            r.b("\n" + n);
            r.b('<div class="user_passinfo hide" id="user_passinfo"></div>');
            r.b("\n" + n);
            r.b("<!--已经登录，并且已经有常用乘机人end-->");
            r.b("\n" + n);
            r.b('<div class="module_tipbg rest_ticket');
            if (!r.s(r.f("showAdult", e, t, 1), e, t, 1, 0, 0, "")) {
                if (!r.s(r.f("showChild", e, t, 1), e, t, 1, 0, 0, "")) {
                    r.b(" hide")
                }
            }
            r.b('">');
            r.b("\n" + n);
            r.b("    当前价格");
            if (r.s(r.f("showAdult", e, t, 1), e, t, 0, 416, 442, "{{ }}")) {
                r.rs(e, t, function(e, t, n) {
                    n.b("成人剩余票量<em>");
                    n.b(n.v(n.f("adult", e, t, 0)));
                    n.b("</em>张，")
                }
                );
                e.pop()
            }
            if (r.s(r.f("showChild", e, t, 1), e, t, 0, 470, 496, "{{ }}")) {
                r.rs(e, t, function(e, t, n) {
                    n.b("儿童剩余票量<em>");
                    n.b(n.v(n.f("child", e, t, 0)));
                    n.b("</em>张，")
                }
                );
                e.pop()
            }
            r.b("机票价格随时变化，此信息仅供参考。");
            r.b("\n" + n);
            r.b("</div>");
            r.b("\n" + n);
            r.b('<div class="hide orangejt_tips insur_tip ');
            if (r.s(r.f("voucherGift", e, t, 1), e, t, 0, 592, 608, "{{ }}")) {
                r.rs(e, t, function(e, t, n) {
                    n.b("m-insur-tip-gift")
                }
                );
                e.pop()
            }
            r.b(" ");
            if (r.s(r.f("jsjVoucher", e, t, 1), e, t, 0, 640, 653, "{{ }}")) {
                r.rs(e, t, function(e, t, n) {
                    n.b("insur_tip_jsj")
                }
                );
                e.pop()
            }
            r.b('" id="');
            r.b(r.v(r.f("insureTipper", e, t, 0)));
            r.b('">');
            r.b("\n" + n);
            if (r.s(r.f("showTips", e, t, 1), e, t, 0, 710, 749, "{{ }}")) {
                r.rs(e, t, function(e, t, n) {
                    n.b("        ");
                    n.b(n.t(n.f("noInsuranceTipsHtml", e, t, 0)));
                    n.b("\n")
                }
                );
                e.pop()
            }
            r.b("</div>");
            r.b("\n" + n);
            r.b('<div class="passform" id="passenger_list"></div>');
            r.b("\n" + n);
            r.b("\n" + n);
            r.b('<div class="add_contet">');
            r.b("\n" + n);
            r.b('    <a onfocus="this.blur()" href="javascript:;" class="bt_add" title="新增乘机人">新增乘机人</a>');
            r.b("\n" + n);
            r.b('    <a class="btn_gray js_defaultinsure hide" href="javascript:;" style="float:left; margin-left:10px;"><b><b class="js_defaultinsuretext" style="color:#555"></b></b></a>');
            r.b("\n" + n);
            r.b('    <span id="exc_tip" class="exc_tip hide">同一订单仅支持9位乘客</span>');
            r.b("\n" + n);
            r.b('    <div class="save_passct ');
            if (!r.s(r.f("isLogin", e, t, 1), e, t, 1, 0, 0, "")) {
                r.b(" hide")
            }
            r.b('"><input id="');
            r.b(r.v(r.f("saveID", e, t, 0)));
            r.b('" type="checkbox" ');
            if (r.s(r.f("isLogin", e, t, 1), e, t, 0, 1277, 1295, "{{ }}")) {
                r.rs(e, t, function(e, t, n) {
                    n.b(' checked="checked"')
                }
                );
                e.pop()
            }
            r.b(' class="checkbox"><label for="');
            r.b(r.v(r.f("saveID", e, t, 0)));
            r.b('">保存至常用乘机人</label></div>');
            r.b("\n" + n);
            r.b('    <div class="hyinsure_tip_container hide js-hyinsure-tip-container">提交订单可享受订单价格立减<span class="rmb">&yen;<span class="hyinsure_yh js-hyinsure-yh"></span></span>!</div>');
            r.b("\n" + n);
            r.b("</div>");
            r.b("\n" + n);
            r.b("\n" + n);
            r.b('<div id="insurance_placeholder"></div>');
            r.b("\n" + n);
            r.b('<div id="safe_tiper" class="module_tipbg safe_tip hide">为了保护您的身份证信息安全，我们对您的常用登记人身份证信息进行了加密。您可以通过提交订单后的核对信息核对身份证信息。</div>');
            return r.fl();
        }
        );
        if (typeof t !== "undefined")
            t.exports = window.QTMPL["BookingPassengerContainer"]
    }
    (t.exports, t, e);
    e.____MODULES["fb6e625af4aebf77cdcda3f9e71509e2"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "ae662099fd1345385f778cc2d90de07e",
        filename: "BookingPassengerItem.mustache",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(e, t, n) {
        if (typeof window.QTMPL === "undefined")
            window.QTMPL = {};
        window.QTMPL["BookingPassengerItem"] = new window.Hogan.Template(function(e, t, n) {
            var r = this;
            r.b(n = n || "");
            r.b('<ul class="passfomlist ');
            if (r.s(r.f("jsjVoucher", e, t, 1), e, t, 0, 38, 45, "{{ }}")) {
                r.rs(e, t, function(e, t, n) {
                    n.b("j_j_v_l")
                }
                );
                e.pop()
            }
            r.b('">');
            r.b("\n" + n);
            r.b('    <li class="c1">');
            r.b("\n" + n);
            r.b('        <div class="m_col1">');
            r.b("\n" + n);
            r.b('            <input type="hidden" name="passenger_id" value="" />');
            r.b("\n" + n);
            r.b('            <div class="pas_name">');
            r.b("\n" + n);
            r.b('                姓名<span class="req"></span>');
            r.b("\n" + n);
            r.b("            </div>");
            r.b("\n" + n);
            r.b('            <div class="pas_inpt">');
            r.b("\n" + n);
            r.b('                <label><span class="textbox_b"><input data-placeholder="与证件名一致" autocomplete="off" type="text" value="" data-jvalid-ruler="empty name_character name_character2 ch_name1 ch_name en_name1 en_name2 tooslow toolong cardname strangeword" class="input_name js-logDefer" name="passenger_name" /></span></label>');
            r.b("\n" + n);
            r.b("            </div>");
            r.b("\n" + n);
            r.b('            <div class="csparest wt_chiren">');
            r.b("\n" + n);
            r.b('                <select class="selectbox hide" name="passenger_type">');
            r.b("\n" + n);
            r.b('                    <option value="1">成人(&gt;12岁)</option>');
            r.b("\n" + n);
            r.b("                    ");
            if (r.s(r.f("supportChildTicket", e, t, 1), e, t, 0, 866, 902, "{{ }}")) {
                r.rs(e, t, function(e, t, n) {
                    n.b('<option value="2">儿童(2-12岁)</option>')
                }
                );
                e.pop()
            }
            r.b("\n" + n);
            r.b("                    ");
            if (r.s(r.f("supportInfantTicket", e, t, 1), e, t, 0, 970, 1007, "{{ }}")) {
                r.rs(e, t, function(e, t, n) {
                    n.b('<option value="3">婴儿(14天-2岁)</option>')
                }
                );
                e.pop()
            }
            r.b("\n" + n);
            r.b("                </select>");
            r.b("\n" + n);
            r.b("            </div>");
            r.b("\n" + n);
            r.b("        </div>");
            r.b("\n" + n);
            r.b('        <div class="m_col2 m_ch hide">');
            r.b("\n" + n);
            if (r.s(r.f("supportInfantTicket", e, t, 1), e, t, 0, 1167, 2e3, "{{ }}")) {
                r.rs(e, t, function(e, t, r) {
                    r.b('                <div class="infant_info js_infant_info">');
                    r.b("\n" + n);
                    r.b('                    <a href="#" onclick="return false;" class="f_xian">购票说明</a>');
                    r.b("\n" + n);
                    r.b('                    <div class="orangejt_tips js_infant_tip" style="display:none;">');
                    r.b("\n" + n);
                    r.b('                        <div class="tips_contair">');
                    r.b("\n" + n);
                    r.b('                            <div class="bot"></div>');
                    r.b("\n" + n);
                    r.b('                            <div class="top"></div>');
                    r.b("\n" + n);
                    r.b('                            <div class="tips_content">');
                    r.b("\n" + n);
                    r.b("                                <p>婴儿票须知：</p>");
                    r.b("\n" + n);
                    r.b("                                <p>1、使用婴儿票的乘客：登机当天应为足月出生满14天且未满2周岁，未满14天婴儿不能乘机。</p>");
                    r.b("\n" + n);
                    r.b("                                <p>2、购买婴儿票可使用：身份证、护照、户口簿或出生证明等其他有效证件类型。</p>");
                    r.b("\n" + n);
                    r.b("                                <p>3、乘机时出示的证件号码，应与订票时所填证件号码一致。</p>");
                    r.b("\n" + n);
                    r.b("                            </div>");
                    r.b("\n" + n);
                    r.b("                        </div>");
                    r.b("\n" + n);
                    r.b("                    </div>");
                    r.b("\n" + n);
                    r.b("                </div>");
                    r.b("\n")
                }
                );
                e.pop()
            }
            r.b('            <span class="js_prchild"></span>');
            r.b("\n" + n);
            r.b("        </div>");
            r.b("\n" + n);
            r.b("    </li>");
            r.b("\n" + n);
            r.b('    <li class="c2">');
            r.b("\n" + n);
            r.b('        <div class="m_col1">');
            r.b("\n" + n);
            r.b('            <div class="pasg_cername">');
            r.b("\n" + n);
            r.b('                证件号码<span class="req"></span>');
            r.b("\n" + n);
            r.b("            </div>");
            r.b("\n" + n);
            r.b('            <div class="csparest wt_cercode">');
            r.b("\n" + n);
            r.b('                <input name="passenger_credential_id" type="hidden" value="" />');
            r.b("\n" + n);
            r.b('                <input name="passengerPriceTag" type="hidden" value="N" />');
            r.b("\n" + n);
            r.b('                <select class="selectbox idtype hide" name="passenger_credential_type">');
            r.b("\n" + n);
            r.b('                    <option value="1">身份证</option>');
            r.b("\n" + n);
            r.b('                    <option value="2">护照</option>');
            r.b("\n" + n);
            r.b('                    <option value="12">其它</option>');
            r.b("\n" + n);
            r.b("                </select>");
            r.b("\n" + n);
            r.b("            </div>");
            r.b("\n" + n);
            r.b('            <div class="pasg_cer_code">');
            r.b("\n" + n);
            r.b('                <label class="e_label">');
            r.b("\n" + n);
            r.b('                    <span class="textbox_b">');
            r.b("\n" + n);
            r.b('                      <input autocomplete="off" data-placeholder="在js里写的" type="text" data-jvalid-ruler="empty" class="input_cerd js-logDefer" name="passenger_credential_no"/>');
            r.b("\n" + n);
            r.b("                    </span>");
            r.b("\n" + n);
            r.b("                </label>");
            r.b("\n" + n);
            r.b('                <a class="modify_row hide" href="javascript:;" style="">修改</a>');
            r.b("\n" + n);
            r.b("            </div>");
            r.b("\n" + n);
            r.b("        </div>");
            r.b("\n" + n);
            r.b('        <div class="m_col2 m_birth js_sex_ct hide">');
            r.b("\n" + n);
            r.b('            <div class="pasg_cername">');
            r.b("\n" + n);
            r.b('                性<cite>别</cite><span class="req"></span>');
            r.b("\n" + n);
            r.b("            </div>");
            r.b("\n" + n);
            r.b('            <div class="csparest wt_cercode">');
            r.b("\n" + n);
            r.b('                <select class="selectbox idtype hide" name="passenger_gender">');
            r.b("\n" + n);
            r.b('                    <option value="1">男</option>');
            r.b("\n" + n);
            r.b('                    <option value="2">女</option>');
            r.b("\n" + n);
            r.b("                </select>");
            r.b("\n" + n);
            r.b("            </div>");
            r.b("\n" + n);
            r.b('            <div class="sex_day">');
            r.b("\n" + n);
            r.b("                出生日期");
            r.b("\n" + n);
            r.b("            </div>");
            r.b("\n" + n);
            r.b('            <div class="sel_dayipt born-date">');
            r.b("\n" + n);
            r.b('                <label class="e_label">');
            r.b("\n" + n);
            r.b('                    <div class="textbox_b birth"><input autocomplete="off" type="text" data-jvalid-ruler="empty date" data-placeholder="yyyy-mm-dd" name="date" class="input_day" value=""/></div>');
            r.b("\n" + n);
            r.b("                </label>");
            r.b("\n" + n);
            r.b("            </div>");
            r.b("\n" + n);
            r.b("        </div>");
            r.b("\n" + n);
            r.b("    </li>");
            r.b("\n" + n);
            r.b('    <li class="c3">');
            r.b("\n" + n);
            r.b('        <div class="m_col1 js_insure hide">');
            r.b("\n" + n);
            r.b('            <div class="pasg_num">');
            r.b("\n" + n);
            r.b('                <div class="d_xian  js_ins_sum_tips ">');
            r.b("\n" + n);
            if (r.s(r.f("showGiftPack", e, t, 1), e, t, 0, 4252, 4895, "{{ }}")) {
                r.rs(e, t, function(e, t, r) {
                    r.b('                        <div class="js_gitfpack_Detail_handler gitfpack_Detail_handler">');
                    r.b("\n" + n);
                    r.b('                            <span class="li-font">礼</span>');
                    r.b("\n" + n);
                    r.b('                            <div class="orangejt_tips js_insureTipsContainer hide">');
                    r.b("\n" + n);
                    r.b('                                <div class="tips_contair">');
                    r.b("\n" + n);
                    r.b('                                    <div class="bot"></div>');
                    r.b("\n" + n);
                    r.b('                                    <div class="top"></div>');
                    r.b("\n" + n);
                    r.b('                                    <div class="tips_content">');
                    r.b("\n" + n);
                    r.b("                                    </div>");
                    r.b("\n" + n);
                    r.b("                                </div>");
                    r.b("\n" + n);
                    r.b("                            </div>");
                    r.b("\n" + n);
                    r.b("                        </div>");
                    r.b("\n")
                }
                );
                e.pop()
            }
            r.b('                    <div class="js_insureDetail_handler ');
            if (r.s(r.f("showGiftPack", e, t, 1), e, t, 0, 4986, 5015, "{{ }}")) {
                r.rs(e, t, function(e, t, n) {
                    n.b("gitfpack_insureDetail_handler")
                }
                );
                e.pop()
            }
            r.b('">');
            r.b("\n" + n);
            r.b('                        <a href="#" onclick="return false;" class="f_xian ins_title">');
            if (r.s(r.f("showVoucher", e, t, 1), e, t, 0, 5136, 5147, "{{ }}")) {
                r.rs(e, t, function(e, t, n) {
                    n.b("<i>代金券/</i>")
                }
                );
                e.pop()
            }
            r.b("航意险</a>");
            r.b("\n" + n);
            r.b('                        <div class="orangejt_tips js_insureTipsContainer hide">');
            r.b("\n" + n);
            r.b('                            <div class="tips_contair">');
            r.b("\n" + n);
            r.b('                                <div class="bot"></div>');
            r.b("\n" + n);
            r.b('                                <div class="top"></div>');
            r.b("\n" + n);
            r.b('                                <div class="tips_content">');
            r.b("\n" + n);
            r.b('                                    <p class="loading"><img src="http://source.qunar.com/tts/images/demo/ajax-loader.gif" alt=""></p>');
            r.b("\n" + n);
            r.b("                                </div>");
            r.b("\n" + n);
            r.b("                            </div>");
            r.b("\n" + n);
            r.b("                        </div>");
            r.b("\n" + n);
            r.b("                    </div>");
            r.b("\n" + n);
            r.b("                </div>");
            r.b("\n" + n);
            r.b("            </div>");
            r.b("\n" + n);
            r.b('            <div class="csparest wt_insure">');
            r.b("\n" + n);
            r.b("                ");
            r.b(r.t(r.f("insureSelect", e, t, 0)));
            r.b("\n" + n);
            r.b("            </div>");
            r.b("\n" + n);
            r.b("        </div>");
            r.b("\n" + n);
            if (r.s(r.f("showHY", e, t, 1), e, t, 0, 6267, 7371, "{{ }}")) {
                r.rs(e, t, function(e, t, r) {
                    r.b('            <div class="m_col2 m_hyx js_hy_insure">');
                    r.b("\n" + n);
                    r.b('                <div class="pasg_num">');
                    r.b("\n" + n);
                    r.b("                    ");
                    if (r.s(r.f("hy_checked", e, t, 1), e, t, 0, 6394, 6467, "{{ }}")) {
                        r.rs(e, t, function(e, t, n) {
                            n.b('<input type="hidden" class="js_delay_insure_val" value="');
                            n.b(n.v(n.f("hy_copies", e, t, 0)));
                            n.b('" />')
                        }
                        );
                        e.pop()
                    }
                    r.b("\n" + n);
                    r.b("                    ");
                    if (!r.s(r.f("hy_checked", e, t, 1), e, t, 1, 0, 0, "")) {
                        r.b('<input type="hidden" class="js_delay_insure_val" value="0" />')
                    }
                    r.b("\n" + n);
                    r.b('                    <div class="d_xian js_insure_hy_Detail_handler">');
                    r.b("\n" + n);
                    r.b('                        <a href="#" onclick="return false;" class="fb f_xian">延误险</a>');
                    r.b("\n" + n);
                    r.b('                        <div class="orangejt_tips orangejt_tips_ywins js_insureTipsContainer hide">');
                    r.b("\n" + n);
                    r.b('                            <div class="tips_contair">');
                    r.b("\n" + n);
                    r.b('                                <div class="bot"></div>');
                    r.b("\n" + n);
                    r.b('                                <div class="top"></div>');
                    r.b("\n" + n);
                    r.b('                                <div class="tips_content">');
                    r.b("\n" + n);
                    r.b("                                </div>");
                    r.b("\n" + n);
                    r.b("                            </div>");
                    r.b("\n" + n);
                    r.b("                        </div>");
                    r.b("\n" + n);
                    r.b("                    </div>");
                    r.b("\n" + n);
                    r.b("                </div>");
                    r.b("\n" + n);
                    r.b('                <div class="csparest wt_insure">');
                    r.b("\n" + n);
                    r.b("                    ");
                    r.b(r.t(r.f("ywInsureSelect", e, t, 0)));
                    r.b("\n" + n);
                    r.b("                </div>");
                    r.b("\n" + n);
                    r.b("            </div>");
                    r.b("\n")
                }
                );
                e.pop()
            }
            r.b("    </li>");
            r.b("\n" + n);
            r.b('    <li class="c4"><button type="button" class="del" title="删除"></button></li>');
            r.b("\n" + n);
            r.b("</ul>");
            return r.fl();
        }
        );
        if (typeof t !== "undefined")
            t.exports = window.QTMPL["BookingPassengerItem"]
    }
    (t.exports, t, e);
    e.____MODULES["ae662099fd1345385f778cc2d90de07e"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "61dede7f27e4f3c8c73c7685c0c8391a",
        filename: "PassengerItem.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        var i = e.____MODULES["285adc5af3055e36addfeabe5289c690"];
        var s = e.____MODULES["312540359c661f626d6031b9f938e9a2"];
        var o = "#passenger_list";
        var u = ".js_ins_sum_tips";
        var a = "disabled";
        var f = {
            "1_1_0": "empty ID ID2013 idgt15 yt70 minAndMaxAge",
            "1_2_0": "empty passport",
            "1_12_0": "empty otherID",
            "1_1_1": "empty ID ID2013 yt70",
            "1_2_1": "empty passport",
            "1_12_1": "empty otherID",
            "2_1_0": "empty ID ID2013 id2-12",
            "2_2_0": "empty passport",
            "2_12_0": "empty otherID",
            "2_1_1": "empty ID ID2013",
            "2_2_1": "empty passport",
            "2_12_1": "empty otherID",
            "3_1_0": "empty ID ID2013 id14d-2y",
            "3_1_1": "empty ID ID2013",
            "3_2_1": "empty passport",
            "3_12_1": "empty otherID"
        };
        var l = {
            1: "identity",
            2: "passport",
            12: "other"
        };
        var c = {
            "拉萨": 1,
            "林芝": 1,
            "邦达": 1,
            "阿里": 1,
            "日喀则": 1
        };
        var h = false
          , p = false
          , d = false
          , v = false;
        var m = false;
        var g = s.create();
        g.fn.initialize = function() {}
        ;
        g.fn.init = function(e) {
            function s() {
                var n = t._roundtrip ? 2 : 1;
                var r = ['<select name="count" class="selectbox qnum hide">'];
                for (var i = e.insureMin || 0, s = e.insureMax; i <= s; i++) {
                    if (i === 0) {
                        r.push('<option value="0">未购买航意险</option>')
                    } else {
                        r.push('<option value="' + i * n + '">&yen;' + e.insurePerPrice + "/份×" + i * n + " 保额" + e.insureModel._currInsureGroup[0].amount + "万/份</option>")
                    }
                }
                r.push("</select>");
                return r.join("")
            }
            function o() {
                var n = t._roundtrip ? 2 : 1;
                var r = t.voucherModel.getVoucherSaleType();
                var i = (r == 1 ? t.voucherModel.getVoucherCut() : t.voucherModel.getVoucherPerPrice()) * t.voucherModel.getVoucherCount();
                var s = ['<select name="count" class="selectbox qnum hide">'];
                for (var o = e.insureMin || 0, u = e.insureMax; o <= u; o++) {
                    if (o === 0) {
                        s.push('<option value="0">未购买套餐</option>')
                    } else {
                        s.push('<option value="' + o * n + '">&yen;' + (e.insurePerPrice + i) + "/份×" + o * n + " 代金券+保险套餐</option>")
                    }
                }
                s.push("</select>");
                return s.join("")
            }
            var t = this;
            m = false;
            var n = e.childOil;
            if (e.roundtrip) {
                t._roundtrip = e.roundtrip
            }
            t.config = e;
            t.dataModel = e.dataModel;
            t.productModel = e.dataModel.productModel;
            t._manager = e.manager;
            t.normalizeModel = t._manager.passengerInfoModel.normalizeModel;
            t._childPrice = e.childPrice + n;
            t._childPriceDesc = "票价：&yen;" + e.childPrice + "\n燃油税：&yen;" + n;
            t._infantPrice = e.infantPrice + e.infantServerFee;
            t._infantPriceDesc = "票价：&yen;" + e.infantPrice + "\n服务费：&yen;" + e.infantServerFee;
            t._forceInsure = e.forceInsure;
            t._supportChildTicket = e.supportChildTicket;
            t._supportInfantTicket = e.supportInfantTicket;
            t._priceInfo = e.priceInfo;
            t._urlInfo = e.urlInfo;
            t.serverData = e.originData;
            t.insureModel = e.insureModel;
            t.HYInsure = e.insureModel.getHYInsure();
            t.YWInsure = {
                showHY: t.insureModel.showHYInsure(),
                hy_amount: t.HYInsure ? t.HYInsure.maxClaimPrice : 0,
                hy_price: t.HYInsure ? t.HYInsure.price : 0,
                hy_checked: t.HYInsure ? t.HYInsure.hyInsureChecked : false,
                hy_copies: t.HYInsure ? t.HYInsure.copies : 0
            };
            t.YWInsureYH = e.YWInsureYH;
            t.voucherModel = e.voucherModel;
            var r = t.jsjVoucher = t.voucherModel.isJSJVoucher();
            var i = t.voucherSaleType = t.voucherModel.getVoucherSaleType();
            t.jObj = $(QTMPL.BookingPassengerItem.render({
                insureSelect: r && i != "2" ? o : s,
                ywInsureSelect: function() {
                    var e = ['<select name="ywcount" class="selectbox qnum hide">'];
                    e.push('<option value="0">未购买延误险</option>');
                    e.push('<option value="1">&yen;' + t.YWInsure.hy_price + "/份×" + t.YWInsure.hy_copies + " 保额最高" + t.YWInsure.hy_amount + "元</option>");
                    e.push("</select>");
                    return e.join("")
                },
                insureChecked: t._forceInsure,
                price: e.price,
                iq: e.iq,
                insurePerPrice: e.insurePerPrice,
                insureAmount: e.insureModel._currInsureGroup[0].amount,
                supportChildTicket: t._supportChildTicket,
                supportInfantTicket: t._supportInfantTicket,
                showHY: t.insureModel.showHYInsure(),
                hy_checked: t.HYInsure ? t.HYInsure.hyInsureChecked : false,
                hy_copies: t.HYInsure ? t.HYInsure.copies : 0,
                jsjVoucher: r,
                showVoucher: r && i != "2",
                showGiftPack: i == "2"
            }));
            if (!t._supportInfantTicket) {
                f["1_1_0"] = f["1_1_0"].replace("idgt15", "idgt15_2")
            }
            if (e.iq && e.insureMax >= e.insureMin) {
                t.jObj.find(".js_insure").removeClass("hide")
            }
            t.jObj.data("passengerItem", t);
            t._initDOMSelector();
            $("[data-placeholder]", t.jObj).placeholder();
            t._initSelect();
            t._setPassengerPriceTag();
            t._delegateEvents();
            this._initDatePicker()
        }
        ;
        g.fn.JDOM = function() {
            return this.jObj
        }
        ;
        g.fn.updateInsureSelect = function() {
            this.drawInsureSelect();
            this.DOM("insure").yselector()
        }
        ;
        g.fn.drawInsureSelect = function() {
            function o() {
                var e = t.roundTrip ? 2 : 1;
                var n = ['<select name="count" class="selectbox qnum hide">'];
                for (var o = i || 0, u = r; o <= u; o++) {
                    if (o === 0) {
                        n.push('<option value="0">未购买航意险</option>')
                    } else {
                        n.push('<option value="' + o * e + '">&yen;' + s.price + "/份×" + o * e + " 保额" + s.amount + "万/份</option>")
                    }
                }
                n.push("</select>");
                return n.join("")
            }
            var e = this;
            var t = e.serverData;
            var n = e.insureModel;
            var r = 0;
            var i = 0;
            var s;
            if (n.hasIq() && (s = n.currentInsure())) {
                r = s.max;
                i = s.min
            }
            e.DOM("insure_select_con").html(o())
        }
        ;
        g.fn.DOM = function(e) {
            return this.DOM_HASH_[e]
        }
        ;
        g.fn.isEmpty = function() {
            var e = $.trim(this.DOM("name").val());
            var t = this.DOM("name")[0].isPlaceHolderEmpty && this.DOM("name")[0].isPlaceHolderEmpty();
            return !e || t
        }
        ;
        g.fn.isChineseID = function() {
            var e = this.DOM("identity").data("YSELECTOR");
            return e && e.val() === "1"
        }
        ;
        g.fn.hasInsure = function() {
            var e = this.DOM("insure").data("YSELECTOR");
            return e && e.val() > 0
        }
        ;
        g.fn.chooseInsure = function() {
            this.DOM("insure").data("YSELECTOR").val(1)
        }
        ;
        g.fn.hasHyInsures = function() {
            var e = this.DOM("hy_insure_val");
            return e && e.val() > 0
        }
        ;
        g.fn.insures = function() {
            var e = this.DOM("insure").data("YSELECTOR");
            return e ? parseInt(e.val(), 10) : 0
        }
        ;
        g.fn.hyInsures = function() {
            var e = this.DOM("hy_insure_val");
            return e[0] ? parseInt(e.val(), 10) : 0
        }
        ;
        g.fn.idNumber = function() {
            return this.DOM("identityno").data("raw_data") || this.DOM("identityno").val()
        }
        ;
        g.fn.isChild = function() {
            var e = this.DOM("type").data("YSELECTOR");
            return e && e.val() === "2"
        }
        ;
        g.fn.isInfant = function() {
            var e = this.DOM("type").data("YSELECTOR");
            return e && e.val() === "3"
        }
        ;
        g.fn._delSpaceStr = function(e) {
            var t = e.split("/");
            if (t.length == 2) {
                e = (t[0] || "").replace(/\s/, "") + "/" + (t[1] || "").replace(/^\s*(.*)\s*$/, "$1").replace(/\s+/g, " ")
            }
            return e
        }
        ;
        g.fn.getUserName = function() {
            return this._delSpaceStr(this.DOM("name").val())
        }
        ;
        g.fn.getUserCardNo = function() {
            return this.DOM("identityno").data("raw_data") || this.DOM("identityno").val()
        }
        ;
        g.fn.getIdentityType = function() {
            return this.DOM("identity").data("YSELECTOR").val()
        }
        ;
        g.fn._isSex = function() {
            return !this.DOM("insureinfo").hasClass("hide")
        }
        ;
        g.fn._initDatePicker = function() {
            var e = this;
            setTimeout(function() {
                e.DOM("birth").datepicker({
                    defaultDate: new Date("1980/01/01"),
                    minDate: new Date("1900/01/01"),
                    maxDate: new Date
                })
            }
            , 100);
            return this
        }
        ;
        g.fn.getPassengerData = function() {
            var e = this;
            var t = {
                name: this.getUserName(),
                cardNo: this.getUserCardNo(),
                cardType: e.DOM("identity").data("YSELECTOR").val()
            };
            var n = this._isSex();
            if (n) {
                var r = e.DOM("birth");
                var i = r[0].isPlaceHolderEmpty() ? "" : r.val();
                t.birth = i;
                t.sex = e.DOM("gender").data("YSELECTOR").val()
            }
            return t
        }
        ;
        g.fn.getIdInfo = function() {
            var e = {};
            cardNo = this.getUserCardNo();
            e.idNum = encodeURIComponent(cardNo);
            return e
        }
        ;
        g.fn.getPnrInfo = function() {
            var e = [];
            var t = this;
            var n = encodeURIComponent;
            e.push("agetype=" + t.DOM("type").data("YSELECTOR").val());
            e.push("name=" + n(t._delSpaceStr(t.DOM("name").val())));
            var r = t.DOM("identity").data("YSELECTOR").val()
              , i = t.DOM("identityno").data("raw_data") || t.DOM("identityno").val();
            e.push("cardtype=" + r);
            e.push("cardno=" + n(i));
            e.push("productPackageCode=" + t.DOM("passengerPriceTag").val());
            var s = t.DOM("birth");
            var o = s[0].isPlaceHolderEmpty() ? "" : s.val();
            if (!o && r == 1) {
                var u = Utils.resolveIdentityCard(i);
                if (u)
                    o = u.birth
            }
            e.push("birthday=" + n(o));
            e.push("sex=" + t.DOM("gender").data("YSELECTOR").val());
            e.push("bx=" + t.DOM("insure").data("YSELECTOR").val());
            if (t.insureModel.showHYInsure() && t.DOM("hy_insure_val").val() >= 0) {
                if (t.DOM("hy_insure_val").val() > 0) {
                    e.push("flightDelayCode=" + t.HYInsure.insProductNo);
                    e.push("flightDelayType=" + t.HYInsure.productType)
                }
                e.push("flightDelayBx=" + t.DOM("hy_insure_val").val())
            }
            if (t._manager.canNotUseYWYH) {
                e.push("yanwulj=")
            } else {
                e.push("yanwulj=" + (t.DOM("hy_insure_val").val() > 0 ? t.YWInsureYH : ""))
            }
            return e.join("&")
        }
        ;
        g.fn.setPostGender = function(e) {
            var t = this;
            var n = t.DOM("gender").data("YSELECTOR").val()
              , r = e.credentialses[0];
            if (r.credentialstype == "1") {
                if (e.contactid) {
                    var i = this._getCardById("1");
                    if (i && i.credentialsNo !== r.credentialsno) {
                        n = /[02468][\dx]$/i.test(r.credentialsno) ? 2 : 1
                    } else {
                        n = 0
                    }
                } else {
                    n = /[02468][\dx]$/i.test(r.credentialsno) ? 2 : 1
                }
            }
            n && (e.gender = n)
        }
        ;
        g.fn.getPassengerInfo = function() {
            var e = this;
            var t = {
                id: e.DOM("id").val(),
                name: e.DOM("name").val(),
                usersource: "flight",
                ticketType: e.DOM("type").data("YSELECTOR").val(),
                credentialses: [{
                    contactId: e.DOM("id").val(),
                    credentialsId: e.DOM("identityid").val(),
                    credentialsType: e.DOM("identity").data("YSELECTOR").val(),
                    credentialsNo: e.DOM("identityno").data("raw_data") || e.DOM("identityno").val()
                }]
            };
            this.setPostGender(t);
            var n = e.DOM("birth");
            t.birthday = n[0].isPlaceHolderEmpty() ? "" : n.val();
            return t
        }
        ;
        g.fn.setData = function(e) {
            this._data = e
        }
        ;
        g.fn.getID = function() {
            return this._data ? this._data.id : null 
        }
        ;
        g.fn.setValue = function(e) {
            var t = this, n;
            t.setData(e);
            t.DOM("id").val(e.id);
            t.DOM("name").val(e.name).blur();
            t.DOM("type").data("YSELECTOR").val(e.ticketType);
            t.DOM("gender").data("YSELECTOR").val(e.gender);
            t.DOM("birth").val(e.birthday).placeholder();
            t.DOM("other_card").placeholder();
            if (e.credentialses && (n = e.credentialses[0])) {
                if (l[n.credentialsType] === "identity" || !t._isOnlyChineseID()) {
                    t.DOM("identity").data("YSELECTOR").val(n.credentialsType, true)
                }
            }
        }
        ;
        g.fn.setRule = function(e) {
            var t = this
              , n = t.DOM(e)
              , r = f;
            if (!n) {
                return
            }
            var i = t.DOM("type").data("YSELECTOR");
            var s = t.DOM("identity").data("YSELECTOR");
            var o = Number(t.DOM("insureinfo").is(":visible"));
            if (!i || !s) {
                return
            }
            var u = [i.val(), s.val(), o].join("_");
            var a = r[u] + " cardname";
            n.data("jvalid-ruler", a)
        }
        ;
        g.fn.removeThis = function() {
            this._manager.removeItem(this)
        }
        ;
        g.fn.priceInfo = function(e) {
            return {
                1: "",
                2: '儿童票价：<span class="pr hl"><i class="rmb">&yen;</i>' + this._childPrice + '</span>(<span class="f_bl" title="' + this._childPriceDesc + '">含税费</span>)',
                3: '婴儿服务包: <span class="pr hl"><i class="rmb">&yen;</i>' + this._infantPrice + "</span>"
            }[e]
        }
        ;
        g.fn._getCardById = function(e) {
            var t = this;
            var n = t._data && t._data.credentialses instanceof Array ? t._data.credentialses : [], r;
            for (var i = 0, s = n.length; i < s; i++) {
                r = n[i];
                if (Number(e) === r.credentialsType) {
                    return r
                }
            }
            return null 
        }
        ;
        g.fn._initDOMSelector = function() {
            var e = this;
            e.DOM_HASH_ = {
                id: $("[name=passenger_id]", e.jObj),
                name: $("[name=passenger_name]", e.jObj),
                passengerPriceTag: $("[name=passengerPriceTag]", e.jObj),
                type: $("[name=passenger_type]", e.jObj),
                identityid: $("[name=passenger_credential_id]", e.jObj),
                identity: $("[name=passenger_credential_type]", e.jObj),
                identityno: $("[name=passenger_credential_no]", e.jObj),
                insure: $("[name=count]", e.jObj),
                ywinsure: $("[name=ywcount]", e.jObj),
                hy_insure_val: $("input.js_delay_insure_val", e.jObj),
                gender: $("[name=passenger_gender]", e.jObj),
                birth: $("[name=date]", e.jObj),
                insureinfo: $(".js_sex_ct", e.jObj),
                modify: $(".modify_row", e.jObj),
                price: $(".js_prchild", e.jObj),
                infant_info: $(".js_infant_info", e.jObj),
                other_card: $("[name=passenger_credential_no]", e.jObj),
                insure_select_con: $("#js_insure_select", e.jObj)
            }
        }
        ;
        g.fn._setIDPlaceholder = function() {
            var e = this;
            var t = e.DOM("identityno");
            var n = e.DOM("identity").val();
            var r = "请准确填写以保证登机";
            var i = e.isChineseID() && (e.isChild() || e.isInfant()) ? "请填写户口本上的身份证号" : n == 1 ? r : "请准确填写以保证登机";
            if (t[0].isPlaceHolderEmpty && t[0].isPlaceHolderEmpty()) {
                t.val("")
            }
            t.data("placeholder", i);
            t.placeholder()
        }
        ;
        g.fn._setInsureinfoStatus = function() {
            var e = this;
            var t = e._urlInfo.prt === "1";
            var n;
            if (!t) {
                n = !e.isChineseID()
            } else {
                var r = e._manager.getAgeLimit();
                n = !e.isChineseID() && (e.hasInsure() || e.hasHyInsures() || e.isChild() || e.isInfant() || r.min || r.max)
            }
            if (n) {
                e.DOM("insureinfo").removeClass("hide")
            } else {
                e.DOM("insureinfo").addClass("hide")
            }
        }
        ;
        g.fn._setBirthRule = function() {
            var e = "";
            if (this.isChild()) {
                e = "empty date 2-12"
            } else if (this.isInfant()) {
                e = "empty date 14d-2y"
            } else {
                e = this._supportInfantTicket ? "empty date gt15 yt70b minAndMaxAge" : "empty date gt15_2 yt70b minAndMaxAge"
            }
            this.DOM("birth").data("jvalid-ruler", e)
        }
        ;
        g.fn._checkBirth = function() {
            if (!this._isSex())
                return true;
            var e = true
              , t = this.DOM("birth");
            var n = t.val();
            if (n && n != "yyyy-mm-dd") {
                t.jvalid({
                    reader: function() {
                        return n
                    },
                    onchecked: function(n, r) {
                        e = n;
                        t.jvalidTip(n ? "correct" : r)
                    }
                })
            } else {
                t.jvalidTip("reset")
            }
            return e
        }
        ;
        g.fn._isHidden = function() {
            var e = this.getIdentityType();
            var t = this._getCardById(e);
            if (t) {
                var n = Utils.treatSensitiveInfo(l[e], t.credentialsNo);
                var r = ~n.indexOf("*");
                return r
            }
        }
        ;
        g.fn._isACTibet = function() {
            var e = this._manager.flight;
            if (e[0] && c[e[0].ac] || e[1] && c[e[1].ac]) {
                return true
            }
            return false
        }
        ;
        g.fn._showHintForTibet = function() {
            $.ui.alert("根据民航总局指示，凡购买到达或者途经中转西藏拉萨、林芝、邦达、阿里、日喀则客票的旅客，非中国公民身份证持有者需持《进藏批准函》前往航空公司直属售票处验证购票。如因旅客违反此规定造成无法乘机等损失，将由旅客自行承担。感谢您的配合。")
        }
        ;
        g.fn._isAdult = function() {
            return this.DOM("type").data("YSELECTOR").val() === "1"
        }
        ;
        g.fn._isOnlyChineseID = function() {
            var e = this._manager.policyInfo;
            if (e && e.cardType === 1 && this._isAdult()) {
                return true
            }
            return false
        }
        ;
        g.fn._disJSJInsTip = function(e) {
            var t = this;
            if (t.jsjVoucher) {
                if (e) {
                    $("#insure_tipper").addClass("insur_tip_jsj").removeClass("insur_tip_jsj_fix");
                    t.jObj.find(".ins_title i").show();
                    t.jObj.removeClass("j_j_v_l_fix")
                } else {
                    $("#insure_tipper").removeClass("insur_tip_jsj").addClass("insur_tip_jsj_fix");
                    t.jObj.find(".ins_title i").hide();
                    t.jObj.addClass("j_j_v_l_fix")
                }
            }
        }
        ;
        g.fn._initSelect = function() {
            var e = this;
            e.DOM("type").yselector({
                onchange: function(t) {
                    e._isDisableIdentity();
                    e._setInsureinfoStatus();
                    e._setBirthRule();
                    e.DOM("price").html(e.priceInfo(t.value));
                    e.setRule("identityno");
                    e._setIDPlaceholder();
                    e._manager.updateStatus();
                    if (m)
                        e._setPassengerPriceTag();
                    var n = e.DOM("identityno")[0].isPlaceHolderEmpty && e.DOM("identityno")[0].isPlaceHolderEmpty();
                    if (e.DOM("identityno").val() && !n) {
                        e.DOM("identityno").jvalid()
                    }
                    if (t.value == 1) {
                        e.DOM("price").parent().addClass("hide")
                    } else {
                        e.DOM("price").parent().removeClass("hide")
                    }
                    if (t.value == 3) {
                        e.DOM("infant_info").removeClass("hide")
                    } else {
                        e.DOM("infant_info").addClass("hide")
                    }
                    e._checkBirth();
                    e.DOM("type").val(t.value).change();
                    var r = e.voucherModel.getVoucherSaleType();
                    if (e.jsjVoucher && r != "2") {
                        e.resetInsureSelect(e.insureModel._currInsureGroup[0]);
                        if (t.value == 1) {
                            e._disJSJInsTip(true)
                        } else {
                            e._disJSJInsTip(false)
                        }
                    }
                    if (r == "2") {
                        if (t.value == 1) {
                            e.jObj.find(".js_gitfpack_Detail_handler").removeClass("hide")
                        } else {
                            e.jObj.find(".js_gitfpack_Detail_handler").addClass("hide")
                        }
                    }
                }
            });
            e.DOM("identity").yselector({
                onchange: function(t) {
                    if (e._isACTibet() && l[t.value] !== "identity") {
                        e._showHintForTibet()
                    }
                    e._setInsureinfoStatus();
                    e.setRule("identityno");
                    e._setIDPlaceholder();
                    var n = e._getCardById(t.value);
                    var r = true;
                    if (n) {
                        e._clearDisable();
                        e.DOM("identityid").val(n.credentialsId);
                        e.DOM("identityno").jvalid({
                            reader: function() {
                                return n.credentialsNo
                            },
                            onchecked: function(e, t) {
                                var n = this;
                                if (e) {
                                    n.jvalidTip("correct")
                                } else {
                                    n.jvalidTip(t);
                                    r = false
                                }
                            }
                        });
                        e.DOM("name").jvalid({
                            reader: function() {
                                return e.DOM("name").val()
                            },
                            onchecked: function(t, n) {
                                var i = this;
                                if (t) {
                                    i.jvalidTip("correct")
                                } else {
                                    i.jvalidTip(n);
                                    e._clearDisable();
                                    r = false
                                }
                            }
                        });
                        if (e._checkBirth() === false) {
                            r = false
                        }
                        if (!r) {
                            e.DOM("identityno").val(n.credentialsNo).removeData("raw_data");
                            e.notBack = true;
                            return
                        }
                        var s = Utils.treatSensitiveInfo(l[t.value], n.credentialsNo)
                          , o = ~s.indexOf("*");
                        var u = e._checkChanged();
                        if (u || e.notBack || !o) {
                            e.DOM("identityno").val(n.credentialsNo).removeData("raw_data");
                            e._clearDisable();
                            e.notBack = true
                        } else {
                            e.DOM("identityno").val(s).attr("style", "").data("raw_data", n.credentialsNo);
                            e._setDisable();
                            e._manager.showHiddenNotice()
                        }
                    } else {
                        e.DOM("identityid").val("");
                        e.DOM("identityno").val("").removeData("raw_data");
                        e._clearDisable();
                        e._checkBirth()
                    }
                    i.trigger("addcheck.userinfocheck", [e])
                }
            });
            e.DOM("gender").yselector({
                onchange: function(e) {}
            });
            e.DOM("insure").yselector({
                index: e._forceInsure ? 1 : 0,
                onchange: function(t) {
                    e._manager.currPassItem = e;
                    e._setInsureinfoStatus();
                    e.setRule("identityno");
                    e._manager.updateStatus("insure", e._isAdult());
                    e._manager.checkLXFP();
                    if (t.index === 0) {
                        e._manager.showHYInsureFreTipper();
                        e._manager.showInsureTipper(e._manager.getItemIndex(e), e.isChild(), e.isInfant());
                        h = true
                    } else {
                        if (e._manager.isInsureCheckedAll()) {
                            e._manager.hideInsureTipper()
                        }
                        if (h) {
                            d = true
                        }
                    }
                    e._setPassengerPriceTag();
                    e._clearDisable();
                    var n = true;
                    if (e._checkBirth() === false) {
                        n = false;
                        e.notBack = true
                    }
                    if (n && e._isHidden()) {
                        e._setDisable()
                    }
                }
            });
            e.DOM("ywinsure").yselector({
                index: e.YWInsure.hy_checked && e.YWInsure.hy_copies || 0,
                onchange: function(t) {
                    if (t.index === 0) {
                        e.DOM("hy_insure_val").val(0);
                        if ($(".js_service_chk", "#module_car").filter(":checked").length === 0) {
                            e._manager.showYWInsureFreTipper()
                        }
                        p = true
                    } else {
                        e.DOM("hy_insure_val").val(e.HYInsure.copies);
                        if (p) {
                            v = true
                        }
                    }
                    e._manager.checkLXFP();
                    e._setInsureinfoStatus();
                    e._manager.updateStatus()
                }
            });
            e._isDisableIdentity();
            m = true
        }
        ;
        g.fn._getBookingRefactorLog = function() {
            return {
                hychange: h,
                ywchange: p,
                hychangeAndBuy: d,
                ywchangeAndBuy: v
            }
        }
        ;
        g.fn._getBookingRefactorErrorTimeLog = function() {
            var e = this;
            return {
                passengerNameErrorTime: e.DOM("name").data("errorTime") || 0,
                idNumberErrorTime: e.DOM("identityno").data("errorTime") || 0
            }
        }
        ;
        g.fn._isDisableIdentity = function() {
            if (this._isOnlyChineseID()) {
                this._disableIdentity()
            } else {
                this._enableIdentity()
            }
        }
        ;
        g.fn._disableIdentity = function() {
            var e = this.DOM("identity").data("YSELECTOR");
            if (!e) {
                return
            }
            e.index(0);
            e.disable()
        }
        ;
        g.fn._enableIdentity = function() {
            var e = this.DOM("identity").data("YSELECTOR");
            if (!e) {
                return
            }
            e.enable()
        }
        ;
        g.fn._setPassengerPriceTag = function() {
            var e = this;
            var t = e.getCurrentPriceMap();
            e.DOM("passengerPriceTag").val(t["tag"])
        }
        ;
        g.fn.getCurrentPriceMap = function() {
            var e = this;
            var t = e.DOM("type").data("YSELECTOR").val();
            var n = e.normalizeModel;
            var r;
            var i = "";
            try {
                t = e.DOM("type").data("YSELECTOR").val();
                i = e.DOM("insure").data("YSELECTOR").val()
            } catch (s) {
                return {}
            }
            i = i !== "0" && !e.insureModel.isNoFavorableInsurance() ? 1 : 0;
            r = e.productModel.getPriceInfoBySel({
                passengerType: t,
                INS: i
            });
            return r
        }
        ;
        g.fn._delegateEvents = function() {
            function t(e) {
                var t = e.currentTarget;
                var n = $(t).find(".js_insureTipsContainer");
                n.addClass("hide")
            }
            function n(t, n) {
                var r = t.currentTarget;
                var i = $(r).find(".js_insureTipsContainer");
                i.removeClass("hide");
                if (e._insureTip != n) {
                    e._insureTip = n;
                    i.find(".tips_content").html(n)
                }
            }
            var e = this;
            e.jObj.delegate(".del", "click", function(t) {
                e.removeThis()
            }
            ).delegate("a.modify_row", "click", function() {
                $(this).addClass("hide");
                e._clearDisable();
                e.notBack = true
            }
            ).delegate("[name=passenger_name]", "blur", function(t) {
                var n = $(t.target).parent();
                var r = e._manager.getItemIndex(e);
                i.trigger("addfoodinfo.mealsinfo", {
                    index: r,
                    pName: e.DOM("name").val(),
                    flag: 0
                })
            }
            );
            e.jObj.delegate(".js_insureDetail_handler", "mouseover", function(t) {
                var n = t.currentTarget;
                var r = $(n).find(".js_insureTipsContainer");
                r.removeClass("hide");
                e.voucherModel.ajaxGetVouDesc(function(t) {
                    var n = e.insureModel.getInsureTip();
                    t = e._getJSJVouTip(t);
                    var i = t + n;
                    if (!i)
                        return;
                    if (e._insureTip != i) {
                        e._insureTip = i;
                        r.find(".tips_content").html(i)
                    }
                }
                )
            }
            ).delegate(".js_insureDetail_handler", "mouseout", t).delegate(".js_insure_hy_Detail_handler", "mouseover", function(t) {
                var r = e.insureModel.getHYInsureTip();
                if (!r)
                    return;
                n(t, r)
            }
            ).delegate(".js_insure_hy_Detail_handler", "mouseout", t).delegate(".js_gitfpack_Detail_handler", "mouseover", function(t) {
                var r = e.voucherModel.getVoucherGiftTips();
                n(t, r)
            }
            ).delegate(".js_gitfpack_Detail_handler", "mouseout", t);
            e.jObj.delegate(".js_infant_info", "mouseover", function(e) {
                $(this).find(".js_infant_tip").css("display", "block")
            }
            ).delegate(".js_infant_info", "mouseout", function(e) {
                $(this).find(".js_infant_tip").css("display", "none")
            }
            );
            e.jObj.delegate(".js_voucherHandler", "mouseover", function(e) {
                $(this).find(".js_voucherContainer").removeClass("hide")
            }
            ).delegate(".js_voucherHandler", "mouseout", function(e) {
                $(this).find(".js_voucherContainer").addClass("hide")
            }
            )
        }
        ;
        g.fn._getJSJVouTip = function(e) {
            var t = this.voucherModel.getVoucherName();
            return e ? '<div class="js_jsj_tip"><p class="title">' + t + "说明：</p>" + e + "</div>" : ""
        }
        ;
        g.fn._isHidden = function() {
            var e = this.getIdentityType();
            var t = this._getCardById(e);
            if (t) {
                var n = Utils.treatSensitiveInfo(l[e], t.credentialsNo);
                var r = ~n.indexOf("*");
                return r
            }
        }
        ;
        g.fn._checkChanged = function() {
            var e = this._data;
            if (!e)
                return false;
            var t = this.getUserName();
            if (t != e.name)
                return true;
            var n = this.DOM("type").data("YSELECTOR").val();
            if (n != e.ticketType)
                return true;
            return false
        }
        ;
        g.fn._setDisable = function() {
            if (this.notBack === true)
                return;
            if (this._checkChanged())
                return;
            var e = this;
            var t = e.DOM("name");
            if (t.val()) {
                t.attr(a, a).jvalidTip("disable");
                t.closest("label").addClass("disabled")
            }
            e.DOM("type").data("YSELECTOR").disable();
            var n = e.DOM("identityno");
            var r = n.val();
            if (r) {
                n.attr(a, a).jvalidTip("disable");
                if (!~r.indexOf("*")) {
                    var i = this.getIdentityType();
                    var s = Utils.treatSensitiveInfo(l[i], r);
                    n.data("raw_data", r);
                    n.val(s)
                }
            }
            e.DOM("gender").data("YSELECTOR").disable();
            var o = e.DOM("birth");
            if (!o[0].isPlaceHolderEmpty()) {
                o.attr(a, a).jvalidTip("disable")
            }
            e.DOM("modify").removeClass("hide")
        }
        ;
        g.fn._clearDisable = function() {
            var e = this;
            e.DOM("name").removeAttr(a).removeClass("disble");
            e.DOM("name").parent().removeClass("textbox_disable");
            e.DOM("type").data("YSELECTOR") && e.DOM("type").data("YSELECTOR").enable();
            var t = e.DOM("identityno")
              , n = t.data("raw_data");
            t.removeAttr(a).removeClass("disble").removeData("raw_data").placeholder();
            t.parent().removeClass("textbox_disable");
            if (n) {
                t.val(n)
            }
            e.DOM("gender").data("YSELECTOR") && e.DOM("gender").data("YSELECTOR").enable();
            e.DOM("birth").removeAttr(a).removeClass("disble");
            e.DOM("birth").parent().removeClass("textbox_disable");
            e.DOM("modify").addClass("hide")
        }
        ;
        g.fn.selectInsure = function(e) {
            var t = this._roundtrip ? 2 : 1
              , n = this.DOM("insure").data("YSELECTOR");
            n.index(e / t)
        }
        ;
        g.fn.clearHYInsure = function() {
            var e = this.DOM("ywinsure").data("YSELECTOR")
              , t = this.DOM("hy_insure_val");
            t.val(0);
            e.val(0);
            e.disable()
        }
        ;
        g.fn.resetInsureSelect = function(e) {
            var t = this
              , n = t.insureModel
              , r = n.currentInsure()
              , e = e || r;
            min = e.min,
            max = e.max,
            ins = this.DOM("insure").data("YSELECTOR"),
            list = [],
            muti = t._roundtrip ? 2 : 1,
            val = Math.min(ins && ins.val(), max * muti);
            if (!ins)
                return;
            var i = t._isAdult();
            var s = t.voucherModel.getVoucherSaleType();
            var o = (s == 1 ? t.voucherModel.getVoucherCut() : t.voucherModel.getVoucherPerPrice()) * t.voucherModel.getVoucherCount();
            if (t.jsjVoucher && i) {
                for (var u = min; u <= max; u++) {
                    var a = u * muti;
                    if (u === 0) {
                        list.push({
                            text: "未购买套餐",
                            value: "0"
                        })
                    } else {
                        list.push({
                            text: "¥" + (r.price + o) + "/份×" + a + " 代金券+保险套餐",
                            value: a.toString()
                        })
                    }
                }
            } else {
                for (var u = min; u <= max; u++) {
                    var a = u * muti;
                    if (u === 0) {
                        list.push({
                            text: "未购买航意险",
                            value: "0"
                        })
                    } else {
                        list.push({
                            text: "¥" + r.price + "/份×" + a + " 保额" + r.amount + "万/份",
                            value: a.toString()
                        })
                    }
                }
            }
            ins.setOptions(list);
            ins.val(val)
        }
        ;
        g.fn._hideVoucher = function() {
            this.jObj.find(".js_voucherHandler").addClass("hide")
        }
        ;
        g.fn._showVoucher = function(e) {
            this.jObj.find(".js_voucherPrice").html("&yen;" + e);
            this.jObj.find(".js_voucherHandler").removeClass("hide")
        }
        ;
        g.fn.isOta = function() {
            return this._priceInfo.isOta
        }
        ;
        n.exports = g
    }
    (t.exports, t, e);
    e.____MODULES["61dede7f27e4f3c8c73c7685c0c8391a"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "37d93aba8ee4096808a4ad1672334d37",
        filename: "PassengerInfo.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        var i = e.____MODULES["285adc5af3055e36addfeabe5289c690"];
        var s = e.____MODULES["312540359c661f626d6031b9f938e9a2"];
        var o = e.____MODULES["61dede7f27e4f3c8c73c7685c0c8391a"];
        var u = e.____MODULES["8d5168dbb4341c76a4be945117498c25"];
        var a = 1;
        var f = "#module_passinfo";
        var l = 9;
        var c = "save_passenger_to_user";
        var h = "#passenger_list";
        var p = "insure_tipper";
        var d = "#js_insureTips";
        var v = ".js_insureTips_n";
        var m = ".js_ins_sum_tips";
        var g = s.create();
        g.fn.initialize = function(e) {
            var t = this;
            var n = e.originData;
            t.fs = false;
            t.dataModel = e;
            t._data = n;
            t.price = n.priceInfo;
            t.insure = n.insurInfo;
            t.roundtrip = n.roundTrip;
            t.flight = n.flightInfo;
            t.forceInsure = n.urlInfo.prt === "1" && !t.fs;
            t._insureTipper = null ;
            t.urlInfo = n.urlInfo;
            t.policyInfo = n.policyInfo;
            t.initDepModel();
            t._quantity = {
                adult: 0,
                child: 0,
                infant: 0,
                isAdult: 0,
                isChild: 0,
                isInfant: 0
            };
            t.showYWInsureTipper = false;
            t.YWInsureYH = t.price.dipp || 0;
            t.acceptYWInsureYH = false;
            t.canNotUseYWYH = true;
            t.showYWInsFreTip = false;
            t.showHYInsFreTip = false;
            t.HYInsure = t.insureModel.getHYInsure();
            t.showHYInsure = t.insureModel.showHYInsure();
            t.hyInsurePerPrice = t.showHYInsure ? t.HYInsure.price : 0;
            t.insurePerPrice = t._defaultInsurePrice();
            if (t.insureModel.isForce()) {
                t.fs = true
            }
            t.currPassItem = null ;
            t._addMinAndMaxAgeChecker();
            t._drawStruct();
            t._channelBind()
        }
        ;
        g.fn.updateView = function(e) {
            var t = this.passengerInfoModel.current;
            var n = null ;
            var r = this.insureModel.getInsureCount();
            this.updateStatus();
            for (var i = 0, s = t.length; i < s; i++) {
                n = t[i];
                n.resetInsureSelect();
                n.selectInsure(r[i]);
                n._setPassengerPriceTag()
            }
        }
        ;
        g.fn._channelBind = function() {
            var e = this;
            i.on("updateview.broadcast", function(t, n) {
                e.updateView(n)
            }
            );
            i.on("resetinsureselect.passengerinfo", function(t, n) {
                e.resetInsureSelect(n)
            }
            );
            i.on("updateinsureprice.passengerinfo", function(t, n) {
                e.updateInsurePrice(n)
            }
            );
            i.on("selectinsure.passengerinfo", function(t, n) {
                e.selectInsure(n)
            }
            );
            i.on("hideinsurerecover.passengerinfo", function() {
                e.hideInsureRecover()
            }
            );
            i.on("clearhyinsure.passengerinfo", function() {
                e.clearHYInsure()
            }
            );
            i.on("showinsurerecover.passengerinfo", function(t, n) {
                e.showInsureRecover(n)
            }
            );
            i.on("updatestatus.passengerinfo", function() {
                e.updateStatus()
            }
            );
            i.on("updatehyinsuretipper.passengerinfo", function() {
                e.updateHYInsureTipper()
            }
            );
            i.on("checkvouchertips.passengerinfo", function(t, n) {
                var r = e.roundtrip ? 2 : 1;
                if (n) {
                    e.selectInsure(1 * r)
                }
            }
            )
        }
        ;
        g.fn.initDepModel = function() {
            var e = this;
            var t = e.dataModel;
            e.passengerInfoModel = t.passengerInfoModel;
            e.priceModel = t.priceModel;
            e.insureModel = t.agreementModel;
            e.couponInfoModel = t.couponInfoModel;
            e.voucherModel = t.voucherModel;
            e.checheModel = t.checheModel;
            e.productModel = t.productModel
        }
        ;
        g.fn.getAgeLimit = function() {
            var e = {};
            var t = this.policyInfo;
            if (t) {
                e.min = t.minAge;
                e.max = t.maxAge
            }
            return e
        }
        ;
        g.fn._getBirth = function(e) {
            if (e.length === 10) {
                return Utils.toDateTime(e)
            }
            return Utils.toDateTime(e.slice(6, 14).replace(/(\d{4})(\d\d)(\d\d)/, "$1-$2-$3"))
        }
        ;
        g.fn._addMinAndMaxAgeChecker = function() {
            function s(e) {
                var t = ["特殊票，乘机人年龄不得"];
                if (n) {
                    t.push("小于" + n + "周岁")
                }
                if (r) {
                    if (t.length === 2) {
                        t.push("，不得大于" + r + "周岁")
                    } else {
                        t.push("大于" + r + "周岁")
                    }
                }
                if (e === "birth") {
                    t.push("，如果出生日期和证件中不一致，将会影响您的正常乘机")
                }
                return t.join("")
            }
            var e = this;
            var t = this.getAgeLimit();
            var n = t.min;
            var r = t.max;
            var i = {
                name: "minAndMaxAge",
                message: "",
                check: function(t, o) {
                    if (!n && !r) {
                        o.result(true)
                    }
                    var u = e._getBirth(t);
                    var a = (new Date(SERVER_TIME.getTime())).getFullYear();
                    var f;
                    var l;
                    var c = true;
                    if (r) {
                        f = new Date(SERVER_TIME.getTime());
                        f.setFullYear(a - r - 1);
                        if (u <= f) {
                            c = false
                        }
                    }
                    if (n) {
                        l = new Date(SERVER_TIME.getTime());
                        l.setFullYear(a - n);
                        if (u > l) {
                            c = false
                        }
                    }
                    if (c) {
                        o.result(true)
                    } else {
                        i.message = s(t.length === 10 ? "birth" : "");
                        o.result(false)
                    }
                }
            };
            $.checker.addItem(i)
        }
        ;
        g.fn.addInsureVoucher = function() {}
        ;
        g.fn.hideInsureTipper = function() {
            $("#" + p).addClass("hide")
        }
        ;
        g.fn.showHYInsureFreTipper = function() {
            var e = this;
            if (e.insure.profitsFee == 0) {
                if (!e.showHYInsFreTip) {
                    var t = ['<span class="close" data-role="show-hyins-fre-tip"></span>', '<p class="tips-desc">航意险<span class="rmb">&yen;' + e.insurePerPrice + "</span>/份，最高保额可达260万</p>"].join("");
                    var n = $.ui.confirm(t, {
                        ok_txt: "买放心",
                        ok_cls: "btn_blue",
                        cancel_txt: "暂不需要>>",
                        wrapCls: "hyinsure-pre-tips",
                        closeBtn: false,
                        icon: "warn",
                        ok_call: function() {
                            i.trigger("selectallinsure.agreement")
                        },
                        cancel_call: function() {}
                    });
                    $(document).delegate('[data-role="show-hyins-fre-tip"]', "click", function() {
                        n.hide()
                    }
                    )
                }
                e.showHYInsFreTip = true
            }
        }
        ;
        g.fn.showInsureTipper = function(e, t, n) {
            var r = this;
            if (!r.price.bpr || !r.insureModel.hasIq() || r.fs) {
                i.trigger("LOG4J.info", ["没有bpr或者iq或者未配置保险或者强绑保险，不显示保险TIPS"]);
                return
            }
            if (t || n) {
                i.trigger("LOG4J.info", ["儿童票和婴儿票，不显示保险TIPS"]);
                return
            }
            if (!r.priceModel.hasPreferentialPrice()) {
                return
            }
            var s = $("#" + p);
            if (s.data("showInsureTipper") && !s.is(":visible")) {
                return
            }
            topVal = 73 * e;
            $("#insure_tipper").css({
                top: topVal + "px",
                "z-index": 100
            });
            s.removeClass("hide").data("showInsureTipper", true)
        }
        ;
        g.fn.showYWInsureFreTipper = function() {
            function f() {
                var n = t.extInfo;
                if (e.price.xfx || n && n.codeBase && n.codeBase == "ttsgnd01204") {
                    return false
                }
                return true
            }
            function l(e) {
                if (!e) {
                    return
                }
                $.ui.confirm(e, {
                    ok_txt: "确定购买",
                    ok_cls: "btn_blue",
                    cancel_txt: "取消",
                    wrapCls: "relat_tip w424",
                    icon: "warn",
                    ok_call: function() {
                        i.trigger("selectallhyinsure.agreement")
                    },
                    cancel_call: function() {}
                })
            }
            function c(t) {
                if (e.showYWInsureTipper) {
                    i.trigger("LOG4J.info", ["已经提示过延误险优惠了，不再提示"]);
                    return
                }
                if (u) {
                    var n = parseInt(r.price);
                    var o = r.maxClaimPrice;
                    var a = r.detailUrl2;
                    var f = ['<div class="ywinsure_tip">', '<h4 class="title">此订单您可使用<span class="rmb">&yen;' + s + "</span>/人优惠，是否立即使用？</h4>", '<p class="fs12 ywyh_desc">现在购买延误险，每张机票立减<span class="rmb">&yen;' + s + '</span>，航班延误超过2.5小时，<br />被保险人即可获得<span style="font-family: arial">&yen;</span>' + o + '/人赔偿。保费<span style="font-family:arial">&yen;' + n + '</span>/份。<a href="' + a + '" target="_blank">《延误险说明》</a></p>', t || "", '<div class="comment gray fs12">', '<p class="tip_title">注：</p>', '<div class="tip_content">', "<p>若订单申请退票或改签，优惠金额将全部收回。</p>", "<p>此优惠不与接送机优惠同时享受。</p>", "</div>", "</div>", "</div>"].join("");
                    $.ui.confirm(f, {
                        ok_txt: "立即使用",
                        ok_cls: "btn_blue",
                        cancel_txt: "放弃优惠",
                        wrapCls: "relat_tip w424",
                        icon: "warn",
                        ok_call: function() {
                            i.trigger("monitor.behavior", ["ywinsure", {
                                action: "accept"
                            }]);
                            e.acceptYWInsureYH = true;
                            i.trigger("selectallhyinsure.agreement");
                            e.updateHYInsureTipper()
                        },
                        cancel_call: function() {}
                    });
                    i.trigger("monitor.behavior", ["ywinsure", {
                        action: "show"
                    }]);
                    e.showYWInsureTipper = true
                } else {}
            }
            var e = this;
            var t = e._data;
            var n = t.canBuyFlightDelay;
            var r = t.flightDelayProduct;
            var s = e.YWInsureYH;
            var o = e.flight[0];
            var u = n && s && r && f();
            var a = u ? " fs12" : " fs14";
            r = $.isEmptyObject(r) ? null  : r;
            if (e.insureModel.info.flightDelayErr || e.showYWInsFreTip) {
                return
            }
            if (model.dataModel.productModel.productName == "EVF") {
                c()
            } else {
                $.ajax({
                    url: "http://baoxian.qunar.com/pop/flightDelay",
                    data: {
                        flightNo: o.co,
                        dptCode: o.de,
                        arrCode: o.ae
                    },
                    cache: false,
                    dataType: "jsonp",
                    timeout: 150,
                    success: function(t) {
                        var n = "";
                        var r = t.data;
                        switch (t.status) {
                        case 0:
                            switch (r.type) {
                            case 0:
                                n = ['<div class="ywins_ftip' + a + '">', '<p class="em">', '您所乘坐的航班：<span class="highlight">' + o.co + "</span>", "</p>", '<p class="em">', '准点率：<span class="highlight">' + r.correctness + "</span>", "</p>", "<p>", "为保证顺利出行，推荐您购买延误险", "</p>", "</div>"].join("");
                                break;
                            case 1:
                                n = ['<div class="ywins_ftip' + a + '">', '<p>近期已有<span class="highlight em">' + r.buyerNum + "</span>个用户购买过此航班的延误险，推荐您购买。</p>", "</div>"].join("");
                                break;
                            default:
                                break
                            }
                            if (u) {
                                c(n)
                            } else {
                                l(n)
                            }
                            break;
                        default:
                            c()
                        }
                        e.showYWInsFreTip = true
                    },
                    error: function() {
                        e.showYWInsFreTip = true;
                        c()
                    }
                })
            }
        }
        ;
        g.fn.updateHYInsureTipper = function() {
            var e = this;
            var t = e.getHYInsureCount();
            var n = e.YWInsureYH;
            var r = parseInt(t * n, 10);
            var s = e.acceptYWInsureYH;
            var o = $(".js-hyinsure-tip-container");
            var u = e.checheModel.isChecked();
            if (s && !u && r) {
                o.find(".js-hyinsure-yh").html(r).end().removeClass("hide");
                e.canNotUseYWYH = false;
                i.trigger("hide.installment")
            } else {
                o.addClass("hide");
                e.canNotUseYWYH = true
            }
        }
        ;
        g.fn.isInsureCheckedAll = function() {
            var e = this.adultInsureCount;
            if (e.length) {
                for (var t = 0; t < e.length; t++) {
                    if (e[t] === 0) {
                        return 0
                    }
                }
                return 1
            }
            return 0
        }
        ;
        g.fn._defaultInsurePrice = function() {
            var e = this;
            return e.insureModel.defaultInsuerGroup()[0].price
        }
        ;
        g.fn._addDate = function(e, t) {
            var n = e.replace(/-/g, "/");
            var r = t * 24 * 60 * 60 * 1e3 + (new Date(n)).getTime();
            var i = new Date(r);
            return i.getMonth() + 1 + "月" + i.getDate() + "日"
        }
        ;
        g.fn.updateStatus = function(e, t) {
            var n = this
              , r = n.price
              , s = n.flight && n.flight[0];
            var o = n.passengerInfoModel;
            var u = n._data;
            var a = {
                count: o.current.length,
                price: 0,
                insure: 0,
                hyInsure: 0,
                insureCount: [],
                adultInsureCount: [],
                vCount: 0,
                vouchers: 0,
                voucherPack: 0,
                fanxian: 0,
                fanxianDate: "",
                adultNum: 0,
                childNum: 0,
                adultCountBuyInsure: 0,
                fot: 0,
                acf: 0,
                sendFlyFund: u.sendFlyFund,
                flyFundCount: 0,
                flyFundToUse: 0,
                adultTicketPrice: 0
            };
            var f = n.price.cpr + n.price.cot;
            var l = n.price.ipr + n.price.infantServerFee;
            var c = n.price.cot;
            var h = n.price.infantServerFee;
            var p = {
                isAdult: 0,
                isChild: 0,
                isInfant: 0
            };
            var d = 0
              , v = 0
              , m = 0;
            var g = 0;
            var y = n.insurePerPrice;
            var b = n.hyInsurePerPrice;
            a.fanxianDate = n._addDate(n.flight[0].dd, 1);
            $.each(o.current, function(e, t) {
                var i = t.getCurrentPriceMap();
                var s = parseInt(i.price, 10);
                var o = t.insures(), u = t.hyInsures(), c;
                if (t.hasVoucher) {
                    a.voucherPack += 1
                }
                if (o) {
                    a.insure += o * y
                }
                if (u) {
                    a.hyInsure += u * b
                }
                a.insureCount.push(o);
                if (t.isChild()) {
                    v++;
                    a.price += parseInt(f, 10)
                } else if (t.isInfant()) {
                    m++;
                    a.price += parseInt(l, 10)
                } else {
                    d++;
                    if ((!o || n.insureModel.isNoFavorableInsurance()) && r.bpr) {
                        c = r.bpr
                    } else {
                        c = r.pr
                    }
                    g += parseInt(c, 10);
                    a.adultTicketPrice = g;
                    a.fot += r.fot;
                    a.acf += r.acf;
                    a.price += parseInt(c, 10);
                    if (r.fx) {
                        a.fanxian += parseInt(r.fx, 10)
                    }
                    if (o) {
                        a.adultCountBuyInsure += 1
                    }
                    a.adultInsureCount.push(o);
                    n.adultInsureCount = a.adultInsureCount;
                    if (n.voucherModel.isJSJVoucher()) {
                        a.vCount += o
                    }
                }
                n.getPassengerType(p, t)
            }
            );
            a.adultNum = d;
            a.childNum = v;
            if (u.sendFlyFund) {
                a.flyFundCount = d * (u.flyFundCount || 0)
            }
            if (u.useFlyFund) {
                a.flyFundToUse = Math.min(g, u.flyFundToUse || 0)
            }
            n._quantity = {
                adult: d,
                child: v,
                infant: m
            };
            $.extend(n._quantity, p || {});
            o.setQuantity(n._quantity);
            setTimeout(function() {
                var r = n.voucherModel;
                var s = r.isJSJVoucher();
                a.vPrice = r.getVoucherPerPrice();
                if (r.isSaleVoucher()) {
                    a.vouchers = r.getVoucherMoney(d);
                    i.trigger("disablevouchers.agreement", a.vouchers);
                    if (!s) {
                        a.vCount = r.getVoucherCount()
                    }
                } else {
                    a.vouchers = 0
                }
                if (s) {
                    a.vouchers = r.getVoucherMoney(a.vCount)
                }
                if (e === "insure") {
                    i.trigger("showlayer.floatlayer", {
                        vouchers: a.vouchers,
                        price: a.vPrice,
                        count: a.vCount,
                        voucherModel: r
                    })
                }
                var u = n.couponInfoModel;
                if (u && u.getAttr("show")) {
                    a.couponPrice = d * u.getCouponPrice();
                    i.trigger("upamount.couponinfo", d)
                }
                a.passQuantity = o.getQuantity();
                i.trigger("update.priceinfo", a);
                i.trigger("disableinsure.expressinfo", [a.insure, a.hyInsure]);
                i.trigger("update.agreement", a);
                i.trigger("disablevoucher.agreement", a.voucherPack);
                i.trigger("disableinsure.agreement", a.insure);
                i.trigger("disablehyinsure.agreement", a.hyInsure);
                if (t) {
                    i.trigger("update.flightinfo", a)
                }
                i.trigger("disinstall.installment", a);
                n.updateHYInsureTipper()
            }
            , 15)
        }
        ;
        g.fn.getPassengerType = function(e, t) {
            var n = t.DOM("identity").val();
            var r, i, s, o;
            var u = this._data.flightInfo[0];
            var a = Utils.toDateTime(u.dd, u.dt);
            var f = new Date(a.getFullYear(),a.getMonth(),a.getDate());
            if (n == 1) {
                r = t.DOM("identityno").val();
                if (r.indexOf("*") > -1) {
                    r = t.DOM("identityno").data("raw_data")
                }
            } else {
                r = t.DOM("birth").val()
            }
            i = this._getBirth(r);
            s = f.getFullYear() - i.getFullYear() - (f.getMonth() < i.getMonth() || f.getMonth() == i.getMonth() && f.getDate() < i.getDate() ? 1 : 0);
            o = (f.getTime() - i.getTime()) / (24 * 60 * 60 * 1e3);
            if (s >= 12) {
                e.isAdult = e.isAdult + 1
            } else if (s >= 2) {
                e.isChild = e.isChild + 1
            } else if (s < 2 && o >= 14) {
                e.isInfant = e.isInfant + 1
            }
        }
        ;
        g.fn.getHYInsureCount = function() {
            var e = this;
            return e.insureModel.getHYInsureCount()
        }
        ;
        g.fn.checkLXFP = function() {
            var e = this
              , t = 0
              , n = e.passengerInfoModel;
            $.each(n.current, function(e, n) {
                t += parseInt(n.DOM("insure").data("YSELECTOR").val());
                t += parseInt(n.DOM("hy_insure_val").val())
            }
            );
            if (t > 0) {
                $("#lxfp").show()
            } else {
                $("#lxfp").hide()
            }
        }
        ;
        g.fn._hasChildTicket = function() {
            var e = this;
            var t = parseInt(e.price.inventory.child || 0, 10);
            t = isNaN(t) ? Number.MAX_VALUE : t;
            return !!(t && e.flight[0].ccb)
        }
        ;
        g.fn._hasInfantTicket = function() {
            var e = this;
            var t = parseInt(e.price.inventory.infant || 0, 10);
            t = isNaN(t) ? Number.MAX_VALUE : t;
            return !!(t && e.flight[0].icb)
        }
        ;
        g.fn.addItem = function(e) {
            var t = this;
            var n = t.passengerInfoModel;
            if (!t._checkStatus()) {
                return false
            }
            var r = t.voucherModel;
            var s = t.insure
              , u = 0
              , a = 0;
            var f;
            if (t.insureModel.hasIq() && (f = t.insureModel.currentInsure())) {
                u = f.max;
                insureMin = f.min
            }
            var l = new o
              , c = {
                dataModel: t.dataModel,
                insureMax: u,
                insureMin: insureMin,
                iq: s.iq && !!f,
                manager: t,
                childPrice: t.price.cpr,
                childOil: t.price.cot,
                infantPrice: t.price.ipr,
                infantServerFee: t.price.infantServerFee,
                roundtrip: t.roundtrip,
                forceInsure: t.forceInsure,
                priceInfo: t.price,
                supportChildTicket: t._hasChildTicket(),
                supportInfantTicket: t._hasInfantTicket(),
                urlInfo: t.urlInfo,
                insurePerPrice: t.insurePerPrice,
                insureModel: t.insureModel,
                voucherModel: t.voucherModel,
                YWInsureYH: t.YWInsureYH,
                originData: t._data
            };
            if (e) {
                n.current.unshift(l);
                l.init(c);
                t.JContainer.prepend(l.JDOM())
            } else {
                n.current.push(l);
                l.init(c);
                t.JContainer.append(l.JDOM())
            }
            i.trigger("upamount.couponinfo", n.getQuantity().adult);
            t.insureModel.addInsureCount(e);
            return l
        }
        ;
        g.fn.removeItem = function(e) {
            var t = this;
            var n = t.passengerInfoModel;
            if (e) {
                var r = n.current;
                var s = e.JDOM();
                i.trigger("addfoodinfo.mealsinfo", {
                    index: this.getItemIndex(e),
                    pName: e.DOM("name").val(),
                    flag: -1
                });
                s.remove();
                for (var o = 0, u = r.length; o < u; o++) {
                    if (r[o] === e) {
                        r.splice(o, 1);
                        t.insureModel.removeInsure(o)
                    }
                }
                var a = e.getID();
                if (a) {
                    t._clickBoard.uncheck(a)
                }
                if (r.length < 1) {
                    t.addItem();
                    t.showNotice("一个订单至少保留1位乘机人")
                } else {
                    t.hideNotice()
                }
                i.trigger("upamount.couponinfo", n.getQuantity().adult);
                t.updateStatus()
            }
        }
        ;
        g.fn.showHelper = function() {
            $(f).find(".btn_qnhelp").removeClass("hide")
        }
        ;
        g.fn.showNotice = function(e, t) {
            $("#exc_tip").html(e).removeClass("hide")
        }
        ;
        g.fn.hideNotice = function(e) {
            $("#exc_tip").addClass("hide")
        }
        ;
        g.fn.showHiddenNotice = function() {
            $("#safe_tiper").removeClass("hide")
        }
        ;
        g.fn.getFirstEmpty = function() {
            var e = this;
            var t = e.passengerInfoModel;
            var n = t.current;
            for (var r = 0, i = n.length; r < i; r++) {
                if (n[r].isEmpty()) {
                    return n[r]
                }
            }
            return null 
        }
        ;
        g.fn.initClickBoard = function(e) {
            function n(e) {
                var n = t.getFirstEmpty();
                var r = false;
                if (!n) {
                    n = t.addItem(true)
                } else {
                    r = true
                }
                if (!n) {
                    e.checked = false;
                    return
                }
                var s = parseInt($(e).data("id"), 10)
                  , o = t.getPassengerDataById(s);
                if (o) {
                    n.setValue(o)
                }
                i.trigger("addfoodinfo.mealsinfo", {
                    index: t.getItemIndex(n),
                    pName: n.DOM("name").val(),
                    flag: 1
                })
            }
            function r(e) {
                var n = parseInt($(e).data("id"), 10)
                  , r = t.getItemById(n);
                if (r) {
                    t.removeItem(r)
                }
            }
            var t = this;
            t.passengerData = {};
            t._clickBoard = new u({
                type: "mutiple",
                oncheck: n,
                onuncheck: r,
                container: "#user_passinfo",
                data: e,
                title: "常用乘机人"
            });
            t.passengerData = e;
            $("button.btn_qnhelp", $(f)).hide();
            $("#save_passenger_to_user").attr("checked", true).parent().removeClass("hide")
        }
        ;
        g.fn.getItemById = function(e) {
            var t = this.passengerInfoModel.current, n;
            for (var r = 0, i = t.length; r < i; r++) {
                n = t[r];
                if (n.getID() === e) {
                    return n
                }
            }
            return null 
        }
        ;
        g.fn.getPassengerDataById = function(e) {
            if (!e) {
                return null 
            }
            var t = this
              , n = t.passengerData;
            for (var r = 0, i = n.length; r < i; r++) {
                if (n[r].id === e) {
                    return n[r]
                }
            }
            return null 
        }
        ;
        g.fn._checkStatus = function() {
            var e = this;
            var t = e.passengerInfoModel;
            var n = t.caculateTickets();
            if (t.current.length >= n.all) {
                e.showNotice("抱歉，剩余座位数不足，您无法添加更多的乘机人");
                return false
            } else if (t.current.length >= l) {
                e.showNotice("同一订单仅支持" + l + "位乘客");
                return false
            } else {
                e.hideNotice()
            }
            return true
        }
        ;
        g.fn._drawStruct = function() {
            var e = this;
            var t = e.passengerInfoModel;
            var n = t.caculateTickets();
            var r = e.insure.detail;
            var i = e.price;
            var s = i.specialPrice;
            var o = e._getNoInsuranceTips();
            var u = QTMPL.BookingPassengerContainer.render({
                showTips: s.type == -1,
                showChild: false,
                showAdult: n.adult < l,
                adult: n.adult,
                child: n.child,
                saveID: c,
                isLogin: UserStatus.isLogin(),
                insureTipper: p,
                noInsurancePrice: e.priceModel.getPriceOfNoInsurance(),
                noInsuranceTipsHtml: o,
                jsjVoucher: e.voucherModel.isJSJVoucher(),
                voucherGift: e.voucherModel.getVoucherSaleType() == "2"
            });
            $(f).html(u);
            e.JContainer = $(h);
            e._drawList(a);
            e._delegateEvents()
        }
        ;
        g.fn._drawList = function(e) {
            e = e || 0;
            for (var t = 0, n = e; t < n; t++) {
                this.addItem()
            }
        }
        ;
        g.fn._getNoInsuranceTips = function() {
            var e = this.voucherModel.getVoucherSaleType();
            var t = this.voucherModel.getVoucherPerPrice();
            var n = this.voucherModel.getVoucherName();
            var r = this.priceModel.getPriceOfNoInsurance();
            var i = this.price.pr;
            var s = r - i;
            var o = "";
            switch (e) {
            case "2":
                o = ['<div class="tips_contair">', '<div class="tips_content">', "<h3>买航意、享优惠、获好礼</h3>", '<p><span>机票更优惠</span>机票直减<span class="rmb">&yen;' + s + '</span>，原价<span class="rmb" style="color:#535353">&yen;' + r + '</span>，优惠后仅<span class="rmb">&yen;' + i + "</span></p>", '<p><span>好礼送不停</span>机场接送不用愁，满手车券乐无忧，赠送价值<span class="rmb">&yen;' + t + "</span>" + n + "</p>", '<p class="txt-left"><label class="tips-check-insurance"><input type="checkbox" class="checkbox">立享优惠</label></p>', "</div>", '<div class="b"></div>', '<div class="t"></div>', '<b class="tips_close"></b>', "</div>"].join("");
                break;
            default:
                o = ['<div class="tips_contair">', '<p><div class="tips_content">购买航意险，机票更优惠，您选择的航意险份数为0，不享受优惠，机票价格为<i class="rmb">&yen;</i><span id="js_noInsurancePrice">' + r + "</span>元。</div></p>", '<div class="b"></div>', '<div class="t"></div>', '<b class="tips_close"></b>', "</div>"].join("");
                break
            }
            return o
        }
        ;
        g.fn._delegateEvents = function() {
            var e = this;
            var t = {
                warning: '为确保您信息的安全，"去哪儿"需要您登录后才能把您的乘机人信息传输到您现在订票的网站。',
                ret: "index.jsp"
            };
            i.on("dataready.passanger", function(t, n) {
                e.initClickBoard(n)
            }
            );
            i.on("loaderror.passanger", function(t) {
                e.showHelper()
            }
            );
            i.on("checkservice.cheche", function(t, n, r) {
                e.updateHYInsureTipper(n, r)
            }
            );
            $(f).delegate("a.bt_add", "click", function() {
                e.addItem()
            }
            ).delegate(".btn_qnhelp", "click", function() {
                QNR.showLoginDia({
                    callback: function() {
                        i.trigger("monitor.behavior", ["login", {
                            from: "qnhelp"
                        }])
                    },
                    proxy: "/tts/proxy.htm",
                    twoWeek: true,
                    regFlag: true
                }, t)
            }
            ).delegate(".tips_close", "click", function() {
                e.hideInsureTipper()
            }
            ).delegate(".js_voucher_check", "click", function() {
                var e = $(this).prop("checked");
                i.trigger("checkvouchertips.passengerinfo", e)
            }
            ).delegate(".js_defaultinsure", "click", function() {
                e.hideInsureRecover();
                i.trigger("recoverinsure.agreement")
            }
            ).delegate(".tips-check-insurance", "click", function() {
                e.selectInsure(1)
            }
            )
        }
        ;
        g.fn.selectInsure = function(e) {
            var t = this;
            $.each(t.passengerInfoModel.current, function(t, n) {
                n.selectInsure(e[t] || e)
            }
            )
        }
        ;
        g.fn.clearHYInsure = function() {
            var e = this;
            $.each(e.passengerInfoModel.current, function(e, t) {
                t.clearHYInsure()
            }
            );
            e.updateStatus()
        }
        ;
        g.fn.resetInsureSelect = function(e) {
            var t = this;
            $.each(t.passengerInfoModel.current, function(t, n) {
                n.resetInsureSelect(e)
            }
            )
        }
        ;
        g.fn.updateInsurePrice = function(e) {
            var t = this;
            t.insurePerPrice = e;
            $(".js_insureprice").html(e)
        }
        ;
        g.fn.showInsureRecover = function(e) {
            $(f).find(".js_defaultinsuretext").html(e);
            $(f).find(".js_defaultinsure").removeClass("hide")
        }
        ;
        g.fn.hideInsureRecover = function() {
            $(f).find(".js_defaultinsure").addClass("hide")
        }
        ;
        g.fn.getItemIndex = function(e) {
            var t = this.passengerInfoModel.current;
            var n = t.length;
            for (var r = 0; r < n; r++) {
                if (t[r] === e) {
                    return r
                }
            }
            return -1
        }
        ;
        n.exports = g
    }
    (t.exports, t, e);
    e.____MODULES["37d93aba8ee4096808a4ad1672334d37"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "6cfaa2812d34505984b4a57643074349",
        filename: "index.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        e.____MODULES["b1adcbbeb3da980f9bd03e2c4d81ebd1"];
        e.____MODULES["fb6e625af4aebf77cdcda3f9e71509e2"];
        e.____MODULES["ae662099fd1345385f778cc2d90de07e"];
        var i = e.____MODULES["37d93aba8ee4096808a4ad1672334d37"];
        n.exports = i
    }
    (t.exports, t, e);
    e.____MODULES["6cfaa2812d34505984b4a57643074349"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "5c49733f6e69af8f74361dca934cddf3",
        filename: "installmentModel.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        var i = e.____MODULES["285adc5af3055e36addfeabe5289c690"];
        var s = e.____MODULES["312540359c661f626d6031b9f938e9a2"];
        var o = window.model;
        var u = s.create();
        u.fn.initialize = function(e) {
            this.info = {
                price: 0,
                insure: 0,
                insureCount: [],
                delivery: 0,
                hyInsure: 0,
                adultNum: 0,
                count: 0,
                oneTicketPre: 0,
                handleFee: 0,
                maxSellPrice: 0,
                couponPrice: 0,
                minSellPrice: 0,
                vPrice: 0,
                vCount: 0
            };
            this.tagNameInMaxSellPrice = null 
        }
        ;
        u.fn.oTotal = function() {
            var e = this.info;
            var t = e.adultNum * e.handleFee;
            return oTotal = e.price + e.insure + e.hyInsure + e.delivery + t
        }
        ;
        u.fn.getOneTicketPre = function() {
            return this.info.oneTicketPre
        }
        ;
        u.fn.getMaxSellPrice = function() {
            return this.info.maxSellPrice
        }
        ;
        u.fn.getTagNameInMaxSellPrice = function() {
            return this.tagNameInMaxSellPrice
        }
        ;
        u.fn.getMinSellPrice = function() {
            return this.info.minSellPrice
        }
        ;
        u.fn.getHandleFee = function() {
            return this.info.handleFee
        }
        ;
        o.autoRun.push(function(e) {
            o.dataModel.installmentModel = new u(e)
        }
        )
    }
    (t.exports, t, e);
    e.____MODULES["5c49733f6e69af8f74361dca934cddf3"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "2ffdb9d63fc27a2dd221ded1fbcbc437",
        filename: "Installment.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        var i = e.____MODULES["285adc5af3055e36addfeabe5289c690"];
        var s = e.____MODULES["312540359c661f626d6031b9f938e9a2"];
        var o = '<div class="b_installment">' + '<a id="js_installment_btn" class="b_installment_btn" href="javascrcipt:;">分期购票</a>' + '<div class="tips_contair b_installment_tip">' + '<div class="tips_content">先支付定金<span class="pr pre_pr">{{{prePrHtml}}}</span>{{{hanldFeeHtml}}}，最晚起飞前24小时补齐余款<span class="pr remain_pr">{{{remainPrHtml}}}</span></div>' + '<div class="b"></div>' + '<div class="t"></div>' + "</div>" + "</div>";
        var u = Hogan.compile(o);
        var a, f = false;
        var l = s.create();
        l.fn.initialize = function(e) {
            this.agreementModell = e.agreementModel;
            this.checheModel = e.checheModel;
            this.voucherModel = e.voucherModel;
            this.installmentModel = e.installmentModel;
            this.originData = e.originData;
            this._channelBind();
            var t = window.location.href;
            var n = /qnf.trade.qunar.com/;
            var r = n.test(t);
            var i = this.parse();
            if (!i) {
                return false
            }
            if (r) {
                return false
            }
            var s = this;
            try {
                $.ajax({
                    type: "get",
                    url: "http://prepay.qunar.com/verify",
                    data: i,
                    dataType: "jsonp",
                    success: function(e) {
                        if (e && e.returnFee) {
                            s.info.handleFee = e.handleFee || 0;
                            s.info.oneTicketPre = e.returnFee || 0;
                            s.update()
                        }
                    },
                    error: function() {}
                })
            } catch (o) {}
        }
        ;
        l.fn._channelBind = function() {
            var e = this;
            i.on("disinstall.installment", function(t, n) {
                e.disInstall(n)
            }
            );
            i.on("update.installment", function(t, n) {
                e.update(n)
            }
            );
            i.on("show.installment", function(t) {
                e.show()
            }
            );
            i.on("hide.installment", function(t) {
                e.hide()
            }
            )
        }
        ;
        l.fn.parse = function() {
            function y(e, t) {
                return -(b(e) - b(t))
            }
            function b(e) {
                var t;
                for (t in e) {
                    return e[t]
                }
            }
            function w(e) {
                var t;
                for (t in e) {
                    return t
                }
            }
            function E(e, t) {
                var n = 0
                  , r = t.length;
                for (var n = 0; n < r; n++) {
                    if (e == t[n]) {
                        return true
                    }
                }
            }
            function S(e, t) {
                var n = [];
                for (name in e) {
                    if (!E(name, t)) {
                        var r = {};
                        r[name] = e[name];
                        n.push(r)
                    }
                }
                return n
            }
            var e = this, t = e.installmentModel, n = e.originData, r = n && n.flightInfo, i = n && n.policyInfo, s = n && n.priceInfo, o = t.info, u, a = [];
            if (r && r.length == 1 && i && s) {
                f = true;
                var l = r[0];
                var c, h, p;
                if (s.priceTag) {
                    var d = s.priceTag;
                    var v = ["C", "CI", "I", "II", "A", "AI"];
                    a = S(d, v);
                    if (a.length == 0) {
                        return false
                    }
                    a.sort(y);
                    var m = a[0];
                    var g = a[a.length - 1];
                    c = b(m);
                    h = b(g);
                    p = w(m);
                    t.tagNameInMaxSellPrice = p;
                    t.info.maxSellPrice = c;
                    t.info.minSellPrice = h
                }
                u = {
                    flightNum: l.co,
                    cabin: l.cb,
                    deptCity: l.de,
                    arrCity: l.ae,
                    deptDate: l.dd,
                    departureTime: l.dt,
                    bookingTag: n.bookingTag,
                    tagName: p,
                    printPrice: s.npr,
                    maxSellPrice: c,
                    minSellPrice: h,
                    policyId: i.pid,
                    clientId: window.location.host
                }
            }
            return u
        }
        ;
        l.fn.$event = $({});
        l.fn.update = function(e) {
            var t = this.voucherModel && this.voucherModel.isJSJVoucher();
            if (!f) {
                return
            }
            $.extend(this.installmentModel.info, e || {});
            this.refreshUI()
        }
        ;
        l.fn.hide = function() {
            a && a.hide()
        }
        ;
        l.fn.disInstall = function(e) {
            var t = this;
            if ($(".js_service_chk").filter(":checked").length === 0) {
                if (e.count < 3) {
                    t.update(e)
                } else {
                    t.hide()
                }
            } else {
                t.hide()
            }
        }
        ;
        l.fn.show = function() {
            a && a.show()
        }
        ;
        l.fn.refreshUI = function() {
            function b(e) {
                var t = e.length;
                var n = 0;
                for (var r = 0; r < t; r++) {
                    if (e[r] > 0) {
                        n = n + e[r]
                    }
                }
                return n
            }
            function w(e, t) {
                for (var n = 0; n < t.length; n++) {
                    if (t[n] == e) {
                        return true
                    }
                }
            }
            var t = this
              , n = t.installmentModel
              , r = n.info;
            var i = r.adultNum * (r.oneTicketPre + r.handleFee), s, o = r.count, f = r.adultNum, l = r.couponPrice || 0, c = r.handleFee, h = b(r.insureCount), p = h == 0 ? 0 : r.insure / h, d;
            var v = ["s5", "i30", "r30"];
            var m = t.agreementModell.getInsureTag();
            var g = w(m, v);
            if (i == 0 || o != f || l > 0 || p > 0 && g) {
                this.hide();
                return false
            }
            s = n.oTotal();
            d = s - i;
            var y = e.____MODULES["ad05b58af7a3e1c622124b2ca5f09d7a"];
            y.config(9);
            if (!a) {
                a = $(u.render({
                    prePrHtml: '<i class="rmb">&yen;</i>' + y.getHTML(i),
                    remainPrHtml: '<i class="rmb">&yen;</i>' + y.getHTML(d),
                    hanldFeeHtml: c > 0 ? '(含分期手续费<i class="rmb">&yen;</i>' + c + "/人)" : ""
                }));
                $("#bt_submit").after(a)
            } else {
                a.find(".pre_pr").html('<i class="rmb">¥</i>' + y.getHTML(i));
                a.find(".remain_pr").html('<i class="rmb">¥</i>' + y.getHTML(d));
                this.show()
            }
        }
        ;
        n.exports = l
    }
    (t.exports, t, e);
    e.____MODULES["2ffdb9d63fc27a2dd221ded1fbcbc437"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "d6feb296fd4e8fc9174297ffbe54f407",
        filename: "index.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        e.____MODULES["5c49733f6e69af8f74361dca934cddf3"];
        var i = e.____MODULES["2ffdb9d63fc27a2dd221ded1fbcbc437"];
        n.exports = i
    }
    (t.exports, t, e);
    e.____MODULES["d6feb296fd4e8fc9174297ffbe54f407"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "93df894dd52eb9599131eeb6428ee963",
        filename: "UserInfoCheck.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        function f(e, t) {
            function n(n) {
                if (!n)
                    return;
                if (n.ret === false) {
                    o[e] = t
                }
            }
            $.post("/api/fuwu/idcheck/check", {
                idnumber: e,
                username: t
            }, n, "json")
        }
        function d(e) {
            var t = new Image;
            var n = c++;
            l[n] = t;
            t.onload = function() {
                delete l[n];
                t = null 
            }
            ;
            var r = (new Date).getTime();
            if (e == 1) {
                h = r
            }
            var i = {
                s: 869,
                t: r,
                a: e,
                b: r - h,
                c: (/QunarGlobal=([^;]+)/.exec(document.cookie) || [])[1] + "||" + p
            };
            t.src = "http://bc.qunar.com/clk?" + $.param(i)
        }
        function v(e) {
            var e = $(e).parents("ul");
            var t = e.data("passengerItem");
            m(t)
        }
        function m(e) {
            var t = e.getUserCardNo()
              , n = e.getUserName();
            if (n && t) {
                var r = t + "_" + n;
                if (u[r])
                    return;
                f(t, n);
                u[r] = 1
            }
        }
        function g(e) {
            return e.replace(/&/g, "&amp;").replace(/</g, "&lt;").replace(/>/g, "&gt;").replace(/"/g, "&quot;").replace(/'/g, "&#39;").replace(/\//g, "&#x2F;").replace(/ /g, "&nbsp;")
        }
        var i = e.____MODULES["285adc5af3055e36addfeabe5289c690"];
        var s = e.____MODULES["312540359c661f626d6031b9f938e9a2"];
        var o = {}
          , u = {}
          , a = [];
        var l = {}, c = 1, h, p;
        if ($.checker) {
            $.checker.addItem({
                name: "cardname",
                message: "只是获取DOM",
                check: function(e, t) {
                    t.result(true);
                    v(t.checkNode)
                }
            })
        }
        var y = s.create();
        y.fn.initialize = function(e) {
            p = e.originData.bookingTag;
            this._channelBind()
        }
        ;
        y.fn._channelBind = function() {
            var e = this;
            i.on("checkpassenger.userinfocheck", function(t, n) {
                e.checkPassenger(n.passengers, n.callback)
            }
            );
            i.on("addcheck.userinfocheck", function(t, n) {
                e.addCheck(n)
            }
            )
        }
        ;
        y.fn.addCheck = m;
        y.fn.checkPinyin = function(e) {
            var t = {
                _type: "adult",
                same: 0
            }
              , n = {
                _type: "child",
                same: 0
            }
              , r = this;
            $.each(a, function(e, i) {
                var s = i._isAdult() ? t : n
                  , o = i.DOM("name").data("PINYIN");
                r._checkPinyinName(s, o)
            }
            );
            this._pinyinConfirm(t.same, n.same, e)
        }
        ;
        y.fn._checkPinyinName = function(e, t) {
            var n = t.join("").replace(/\//g, "").toUpperCase();
            if (n.indexOf(",") > -1)
                return;
            if (e[n]) {
                e[n] += 1;
                e["same"] += 1
            } else {
                e[n] = 1
            }
        }
        ;
        y.fn._pinyinConfirm = function(e, t, n) {
            if (e && t) {
                $.ui.alert("同1张订单不能有姓名或拼音相同的成人或儿童，请分多张订单提交。（例如：张楠和章男，读音均为zhangnan）儿童不能单独乘机，请确定有成人陪同乘机。")
            }
            if (e && !t) {
                $.ui.alert("同1张订单不能有姓名或拼音相同的成人，请分多张订单提交（例如：张楠和章男，读音均为zhangnan）")
            }
            if (!e && t) {
                $.ui.alert("同1张订单不能有姓名或拼音相同的儿童，请分多张订单提交（例如：张楠和章男，读音均为zhangnan）儿童不能单独乘机，请确定有成人陪同乘机。")
            }
            if (!e && !t) {
                n && n()
            }
        }
        ;
        y.fn.checkPassenger = function(e, t) {
            var n = []
              , r = [];
            var i = this;
            a = e;
            $.each(e, function(e, t) {
                var i = t.getUserCardNo()
                  , s = t.getUserName();
                var u = o[i] === s ? n : r;
                u.push(t)
            }
            );
            if (n.length == 0) {
                i.checkPinyin(t)
            } else {
                if (r.length > 0) {
                    n.push.apply(n, r)
                }
                this._confirmCheck(n, t)
            }
        }
        ;
        y.fn._confirmCheck = function(e, t) {
            var n = this;
            var r = 3;
            var i = $.ui.confirm({
                width: 560,
                textLarge: "请您仔细核对乘机人信息是否正确，信息错误可能导致无法正常登机。",
                textSmall: this._getHTML(e),
                textSmallCls: "e_checklst",
                icon: "question_m",
                ok_txt: "确认并继续预订",
                ok_cls: "btn_blue",
                cancel_txt: "返回修改",
                ok_call: function() {
                    r = 2;
                    n.checkPinyin(t)
                }
            });
            i.setBeforeHideFn(function() {
                d(r)
            }
            );
            d(1)
        }
        ;
        y.fn._getHTML = function(e) {
            var t = ['<div class="tbl_checklst"><table><thead> <tr> <th class="c1">乘机人</th><th class="c2">证件类型</th><th class="c3">证件号码</th></tr></thead></tbody'];
            $.each(e, function(e, n) {
                var r = n.getPassengerData();
                var i = r.cardType == 1 ? "身份证" : r.cardType == 2 ? "护照" : "其他";
                var s = g(r.cardNo);
                if (r.cardType == 1) {
                    s = s.replace(/^(\d{6,6})(\d+)(\d{4,4}|\d{3,3}x)$/i, "$1&nbsp;$2&nbsp;$3")
                } else if (r.birth) {
                    s += "&nbsp;(" + ["", "男&nbsp;", "女&nbsp;"][r.sex || 0] + r.birth + ")"
                }
                t.push('<tr> <td class="c1">', g(r.name), '</td> <td class="c2">', i, '</td> <td class="c3"> <span class="f_tahama">', s, "</span></td> </tr>")
            }
            );
            t.push("</tbody></table> </div>");
            return t.join("")
        }
        ;
        n.exports = y
    }
    (t.exports, t, e);
    e.____MODULES["93df894dd52eb9599131eeb6428ee963"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "c2fb5ec17525a1d0e16dfa6cad37d58e",
        filename: "index.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        var i = e.____MODULES["93df894dd52eb9599131eeb6428ee963"];
        n.exports = i
    }
    (t.exports, t, e);
    e.____MODULES["c2fb5ec17525a1d0e16dfa6cad37d58e"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "d440e651631269b88789108f0d229047",
        filename: "giftInfoModel.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        var s = e.____MODULES["285adc5af3055e36addfeabe5289c690"];
        var o = e.____MODULES["312540359c661f626d6031b9f938e9a2"];
        var u = window.model;
        var a = o.create();
        a.fn.initialize = function(e) {
            var t = e.qdhInfo;
            if (t) {
                t.flightInfo = e.flightInfo[0];
                t.couponCode = e.extInfo ? e.extInfo.couponCode || "" : "";
                var n = this.isShow = t.showQdhGift || false;
                var r = t.qdhGiftList;
                this.hasData = false;
                this.items = null ;
                if (n && r && r.length > 0) {
                    this.hasData = true;
                    this.data = {
                        items: r,
                        index: function() {
                            return i++
                        },
                        reset: function() {
                            i--;
                            return ""
                        }
                    }
                }
            }
        }
        ;
        a.fn.getPnrInfo = function() {
            var e = -1, t, n = "", r = [];
            this.container = $("#module_gift");
            this.items = this.container.find("input");
            if (this.hasData) {
                r = this.container.find("input:checked");
                if (r.length) {
                    e = this.items.index(r);
                    t = this.data.items[e];
                    n = "qdhGiftType=" + t["type"] + "&qdhGiftBatch=" + t.batch
                }
            }
            return n
        }
        ;
        u.autoRun.push(function(e) {
            if (e.qdhInfo) {
                u.dataModel.giftInfoModel = new a(e)
            } else {
                u.dataModel.giftInfoModel = null 
            }
        }
        )
    }
    (t.exports, t, e);
    e.____MODULES["d440e651631269b88789108f0d229047"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "fbd9b343abcbccfbf63700fb02209b4c",
        filename: "giftInfo.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        var i = e.____MODULES["285adc5af3055e36addfeabe5289c690"];
        var s = e.____MODULES["312540359c661f626d6031b9f938e9a2"];
        var o = s.create();
        o.fn.initialize = function(e) {
            var t = this.giftInfoModel = e.giftInfoModel;
            if (t.hasData) {
                this.container = $("#module_gift");
                this._render(t.data);
                this._bind()
            }
        }
        ;
        o.fn._render = function(e) {
            var t = QTMPL.BookingGiftInfo.render(e);
            this.container.html(t);
            this.container.show()
        }
        ;
        o.fn._bind = function() {
            this.container.delegate(".m_gift_des", "mouseenter", function() {
                $(this).find(".tips_contair").show()
            }
            ).delegate(".m_gift_des", "mouseleave", function() {
                $(this).find(".tips_contair").hide()
            }
            )
        }
        ;
        n.exports = o
    }
    (t.exports, t, e);
    e.____MODULES["fbd9b343abcbccfbf63700fb02209b4c"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "9b9f7559f023970a13fe0f801ca6b69f",
        filename: "index.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        e.____MODULES["d440e651631269b88789108f0d229047"];
        var i = e.____MODULES["fbd9b343abcbccfbf63700fb02209b4c"];
        n.exports = i
    }
    (t.exports, t, e);
    e.____MODULES["9b9f7559f023970a13fe0f801ca6b69f"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "1157ab65b34c3f27ccb008726eebbacd",
        filename: "couponInfoModel.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        var i = e.____MODULES["285adc5af3055e36addfeabe5289c690"];
        var s = e.____MODULES["312540359c661f626d6031b9f938e9a2"];
        var o = window.model;
        var u = s.create();
        u.fn.initialize = function(e) {
            var t = e.qdhInfo;
            t.flightInfo = e.flightInfo[0];
            t.couponCode = e.extInfo ? e.extInfo.couponCode || "" : "";
            this.attr = {
                show: t && t.showQdhCoupon || false,
                validated: false,
                checking: false,
                price: 0,
                couponStr: "",
                flight: t.flightInfo || null ,
                couponCode: t.couponCode
            }
        }
        ;
        u.fn.getAttr = function(e) {
            return this.attr[e]
        }
        ;
        u.fn.setAttr = function(e, t) {
            this.attr[e] = t
        }
        ;
        u.fn.getNode = function(e) {
            return this.nodes[e]
        }
        ;
        u.fn.getCouponPrice = function() {
            return this.attr["price"]
        }
        ;
        u.fn.getCouponStr = function() {
            var e = this.getNode("inputEle");
            return e ? $.trim(e.val()) : ""
        }
        ;
        u.fn.getPnrInfo = function() {
            var e = ""
              , t = this.getCouponStr();
            if (t) {
                e = "qdhCouponNum=" + t
            }
            return e
        }
        ;
        u.fn.validated = function() {
            return this.getAttr("validated")
        }
        ;
        u.fn.needCheck = function() {
            var e = this.validated(), t;
            if (e) {
                return false
            } else {
                t = this.getCouponStr();
                if (t === "") {
                    return false
                } else {
                    return true
                }
            }
        }
        ;
        o.autoRun.push(function(e) {
            if (e.qdhInfo) {
                o.dataModel.couponInfoModel = new u(e)
            } else {
                o.dataModel.couponInfoModel = null 
            }
        }
        )
    }
    (t.exports, t, e);
    e.____MODULES["1157ab65b34c3f27ccb008726eebbacd"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "1a2bbd74bb029b2262f0aad1ca8e18d0",
        filename: "BookingCouponInfo.mustache",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(e, t, n) {
        if (typeof window.QTMPL === "undefined")
            window.QTMPL = {};
        window.QTMPL["BookingCouponInfo"] = new window.Hogan.Template(function(e, t, n) {
            var r = this;
            r.b(n = n || "");
            r.b('<div class="title_main">我有优惠券<em>（输入优惠券号码后，验证有效才可使用）</em></div>');
            r.b("\n" + n);
            r.b('<div class="e_gift">');
            r.b("\n" + n);
            r.b('    <ul class="form_gift">');
            r.b("\n" + n);
            r.b("        <li>");
            r.b("\n" + n);
            r.b('            <div class="lab">优惠券号码</div>');
            r.b("\n" + n);
            r.b('            <div class="fm">');
            r.b("\n" + n);
            r.b('                <input type="text" class="inp_txt" node-type="couponNo">');
            r.b("\n" + n);
            r.b('                <button type="button" class="btn_blue" action-type="check" node-type="usable"><b><b>使用</b></b></button>');
            r.b("\n" + n);
            r.b('                <button type="button" class="btn_nm btn_nm_dis" node-type="unusable" style="display:none"><b><b>使用</b></b></button>');
            r.b("\n" + n);
            r.b('                <div class="m_gift_des">优惠券说明');
            r.b("\n" + n);
            r.b('                    <div class="orangejt_tips">');
            r.b("\n" + n);
            r.b('                        <div class="tips_contair" style="display: none;">');
            r.b("\n" + n);
            r.b('                            <div class="bot"></div>');
            r.b("\n" + n);
            r.b('                            <div class="top"></div>');
            r.b("\n" + n);
            r.b('                            <div class="tips_content" style="width:260px;">');
            r.b("\n" + n);
            r.b("                                <p>如您曾经收到");
            r.b(r.v(r.f("agentName", e, t, 0)));
            r.b("旗舰店发至手机上的优惠券号码，请输入后点击“使用”享受优惠。<br>");
            r.b("\n" + n);
            r.b("                                    使用须知：<br>");
            r.b("\n" + n);
            r.b('                                    <ul class="ul_list_num">');
            r.b("\n" + n);
            r.b('                                        <li><span class="uln_a">1、</span><span class="uln_b">优惠券只能折抵票面价格，不能折抵税费</span></li>');
            r.b("\n" + n);
            r.b('                                        <li><span class="uln_a">2、</span><span class="uln_b">每张订单只能使用一张优惠券；同订单多人都可同时享受到优惠；儿童不享受优惠</span></li>');
            r.b("\n" + n);
            r.b('                                        <li><span class="uln_a">3、</span><span class="uln_b">发生退票，原订单使用的优惠券不进行返还</span></li>');
            r.b("\n" + n);
            r.b("                                    </ul>");
            r.b("\n" + n);
            r.b("                            </div>");
            r.b("\n" + n);
            r.b("                        </div>");
            r.b("\n" + n);
            r.b("                    </div>");
            r.b("\n" + n);
            r.b("                </div>");
            r.b("\n" + n);
            r.b('                <div class="m_gift_stat" style="display:none" node-type="suc_tip">');
            r.b("\n" + n);
            r.b('                 <i class="ico_correct"></i>使用成功，机票已优惠<em>50</em>元！<a href="javascript:;" action-type="cancel">取消使用</a>');
            r.b("\n" + n);
            r.b("                </div>");
            r.b("\n" + n);
            r.b('                <div class="m_gift_stat" style="display:none" node-type="err_tip">');
            r.b("\n" + n);
            r.b('                 <i class="ico_error"></i><span></span>');
            r.b("\n" + n);
            r.b("                </div>");
            r.b("\n" + n);
            r.b("            </div>");
            r.b("\n" + n);
            r.b("        </li>");
            r.b("\n" + n);
            r.b("    </ul>");
            r.b("\n" + n);
            r.b("</div>");
            return r.fl();
        }
        );
        if (typeof t !== "undefined")
            t.exports = window.QTMPL["BookingCouponInfo"]
    }
    (t.exports, t, e);
    e.____MODULES["1a2bbd74bb029b2262f0aad1ca8e18d0"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "8a073a32b476422eaf00a57a29d4aed6",
        filename: "CouponInfo.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        e.____MODULES["1a2bbd74bb029b2262f0aad1ca8e18d0"];
        var i = e.____MODULES["285adc5af3055e36addfeabe5289c690"];
        var s = e.____MODULES["312540359c661f626d6031b9f938e9a2"];
        var o = {
            1: "优惠券号码错误，请重新输入或提交订单",
            2: "优惠券号码已使用，请重新输入或提交订单",
            3: "优惠券号码不在有效期，请重新输入或提交订单",
            4: "优惠券号码与乘机人证件号码不匹配，请重新输入或提交订单"
        };
        var u = function() {
            return location.protocol + "//" + location.host
        }
        ();
        var a = s.create();
        a.fn.initialize = function(e) {
            var t = this.couponInfoModel = e.couponInfoModel;
            this._initNode();
            if (t.getAttr("show")) {
                this.passengerInfoModel = e.passengerInfoModel;
                this._render();
                this._bind();
                this.autoDisCoupon()
            }
        }
        ;
        a.fn._channelBind = function() {
            i.on("validate.couponinfo", function(e, t) {
                self.validate(t.callback)
            }
            );
            i.on("upamount.couponinfo", function(e, t) {
                self.upAmount(t)
            }
            )
        }
        ;
        a.fn._render = function() {
            var e = QTMPL.BookingCouponInfo.render({
                agentName: $fScope.agentName
            });
            var t = this.couponInfoModel.getNode("container");
            t.html(e);
            t.show()
        }
        ;
        a.fn._initNode = function() {
            var e = this.couponInfoModel;
            var t = e.nodes = this.nodes = {};
            t.container = $("#module_coupon");
            var n = e.getNode("container");
            t.inputEle = n.find("[node-type=couponNo]");
            t.sucTip = n.find("[node-type=suc_tip]");
            t.errTip = n.find("[node-type=err_tip]");
            t.usableBtn = n.find("[node-type=usable]");
            t.unusableBtn = n.find("[node-type=unusable]");
            t.amount = t.sucTip.find("em")
        }
        ;
        a.fn._bind = function() {
            var e = this
              , t = e.couponInfoModel
              , n = t.getNode("container");
            n.delegate(".m_gift_des", "mouseenter", function() {
                $(this).find(".tips_contair").show()
            }
            ).delegate(".m_gift_des", "mouseleave", function() {
                $(this).find(".tips_contair").hide()
            }
            ).delegate("[action-type=check]", "click", function(n) {
                var r = t.getCouponStr();
                if (r === "") {
                    e.setErrTip("优惠券号码不能为空").show();
                    return false
                }
                e._toggle(true);
                e.validate(function(e) {
                    var t = {
                        couponPrice: e
                    };
                    i.trigger("update.priceinfo", t);
                    i.trigger("update.installment", t)
                }
                )
            }
            ).delegate("[action-type=cancel]", "click", function() {
                e._toggle();
                e.hideSucTip();
                e.reset();
                var n = {
                    couponPrice: t.getAttr("price")
                };
                i.trigger("update.priceinfo", n);
                i.trigger("update.installment", n)
            }
            );
            t.getNode("inputEle").bind("blur", function() {
                e.hideErrTip()
            }
            )
        }
        ;
        a.fn._toggle = function(e) {
            var t = this.couponInfoModel;
            var n = t.getNode("usableBtn");
            var r = t.getNode("unusableBtn");
            if (e) {
                n.hide();
                r.show()
            } else {
                n.show();
                r.hide()
            }
        }
        ;
        a.fn._getValidateUrl = function() {
            var e = window.location;
            return e.protocol + "//" + e.host
        }
        ;
        a.fn.reset = function() {
            var e = this.couponInfoModel;
            e.getNode("inputEle").val("");
            e.setAttr("checking", false);
            e.setAttr("validated", false);
            e.setAttr("price", 0);
            e.setAttr("couponStr", "");
            this.nodes.inputEle.attr("disabled", "")
        }
        ;
        a.fn.setErrTip = function(e) {
            var t = this.couponInfoModel;
            t.getNode("errTip").find("span").text(e);
            return t.getNode("errTip")
        }
        ;
        a.fn.hideErrTip = function() {
            this.couponInfoModel.getNode("errTip").hide()
        }
        ;
        a.fn.hideSucTip = function() {
            this.couponInfoModel.getNode("sucTip").hide()
        }
        ;
        a.fn.autoDisCoupon = function() {
            var e = this.couponInfoModel;
            var t = e.getAttr("couponCode");
            if (t) {
                e.getNode("inputEle").val(t);
                e.getNode("usableBtn").trigger("click")
            }
        }
        ;
        a.fn.validate = function(e) {
            var t = this;
            var n = t.couponInfoModel;
            if (n.getAttr("checking")) {
                return
            }
            n.setAttr("checking", true);
            var r = n.getCouponStr();
            var i = n.getAttr("flight");
            var s = u + "/qdh/checkCoupon.json?";
            var o = {
                couponNum: r,
                source: u,
                passengerInfo: JSON.stringify(t.passengerInfoModel.getIdInfo())
            };
            if (i) {
                o["depTime"] = i.dd;
                o["depAirPort"] = i.de;
                o["arrAirPort"] = i.ae;
                o["airline"] = i.fc;
                o["cabin"] = i.cb;
                o["flightNo"] = i.co
            }
            $.ajax({
                url: s,
                type: "post",
                data: o,
                error: function() {
                    $.ui.alert("系统繁忙，请稍后再试");
                    t._toggle();
                    t.nodes.inputEle.select()
                }
            }).done(function(i) {
                var s = i.ret
                  , o = i.price || 0
                  , u = t.passengerInfoModel.getQuantity().adult;
                n.setAttr("checking", false);
                if (s === 0) {
                    n.setAttr("price", o);
                    n.setAttr("couponStr", r);
                    n.setAttr("validated", true);
                    t.nodes.inputEle.attr("disabled", "disabled");
                    t._toggle(true);
                    t.upAmount(u);
                    n.getNode("sucTip").show()
                } else if (s > 0 && s < 9) {
                    t._toggle();
                    t.nodes.inputEle.select();
                    t.setErrTip(t.getErrMsg(s)).show()
                } else if (s === 9) {
                    location.reload()
                }
                $.isFunction(e) && e(o * u, s)
            }
            ).fail(function() {
                n.setAttr("checking", false)
            }
            )
        }
        ;
        a.fn.getErrMsg = function(e) {
            return o[e || 1]
        }
        ;
        a.fn.upAmount = function(e) {
            var t = this.couponInfoModel;
            var n = t.getNode("amount");
            var r = t.getAttr("price");
            n && n.text(r * e)
        }
        ;
        n.exports = a
    }
    (t.exports, t, e);
    e.____MODULES["8a073a32b476422eaf00a57a29d4aed6"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "cbca373e8d3464aa1bcc0d27ff9e4df4",
        filename: "index.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        e.____MODULES["1157ab65b34c3f27ccb008726eebbacd"];
        var i = e.____MODULES["8a073a32b476422eaf00a57a29d4aed6"];
        n.exports = i
    }
    (t.exports, t, e);
    e.____MODULES["cbca373e8d3464aa1bcc0d27ff9e4df4"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "1aba117e851a04b4a03ea5fd8df1ee0c",
        filename: "Submit.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        function o(e, t) {
            var n = e.policyInfo.specialRule;
            if (n) {
                n = n.split("|").join("")
            }
            var r = $("#js_chunqiuTerms");
            var i = ['<p class="p_sp">', n, "</p>"];
            i.push('<p class="p_check"><input type="checkbox" id="js_terms_confirm" class="inp_ch"/>');
            i.push('<label for="js_terms_confirm">在提交订单前确认已阅读并同意《春秋航空行李额规定》</label></p>');
            if (r.is(":visible") && !r.attr("checked")) {
                u(i, t)
            } else {
                t()
            }
        }
        function u(e, t) {
            var n;
            var r = $.ui.alert(e.join(""), {
                ok_call: function() {
                    if (n.attr("checked")) {
                        r.hide();
                        t()
                    }
                    return false
                },
                ok_txt: "确定",
                ok_cls: "btn_nm btn_nm_dis",
                wrapCls: "auto-tips relat_tip"
            });
            n = $("#js_terms_confirm");
            n.click(function() {
                var e = $(this).attr("checked");
                var t = r.getDom("btns").find("button");
                if (e) {
                    t.removeClass("btn_nm_dis")
                } else {
                    t.addClass("btn_nm_dis")
                }
            }
            )
        }
        function a(e) {
            (new Image).src = "http://bc.qunar.com/clk?s=" + window["_ba_utm_s"] + "&a=" + e + "&t=" + Math.random()
        }
        var i = e.____MODULES["285adc5af3055e36addfeabe5289c690"];
        var s = e.____MODULES["312540359c661f626d6031b9f938e9a2"];
        var f = s.create();
        f.fn.initialize = function(e) {
            var t = this;
            var n = $("#bt_submit");
            t.submitWrap = n.parent();
            t.payType = 0;
            t.data = e.originData;
            t.voucherModel = e.voucherModel;
            t.passengerInfoModel = e.passengerInfoModel;
            t.installmentModel = e.installmentModel;
            t.priceModel = e.priceModel;
            t.contactorModel = e.contactorModel;
            t.insureModel = e.agreementModel;
            t.secureModel = e.secureModel;
            t.giftInfoModel = e.giftInfoModel;
            t.couponInfoModel = e.couponInfoModel;
            t.mealsInfoModel = e.mealsInfoModel;
            t.checheModel = e.checheModel;
            t.expressModel = e.expressModel;
            t.productModel = e.productModel;
            $("#js_booking_form").jvalidForm({
                oncheck: function() {
                    var e = t.data.priceInfo;
                    var n = "";
                    switch (t.productModel.productName) {
                    case "UFF":
                        if (t.productModel.getCurSel()) {
                            n = "《优飞币活动说明》"
                        }
                        break;
                    case "LPF":
                        n = "《低价特惠活动说明》";
                        break;
                    default:
                        n = "";
                        break
                    }
                    if (!$("#agreement_this").attr("checked")) {
                        $.ui.alert("在提交订单前请确认已阅读并同意《网络电子客票协议》" + n);
                        return false
                    }
                },
                onchecked: function(e) {
                    if (!e) {
                        $.ui.alert("请检查页面上所有选项是否正确填写");
                        return false
                    }
                    if (!t.expressModel.bookingCheck()) {
                        $.ui.alert("必须选择行程单或者保单邮寄地址");
                        return false
                    }
                    i.trigger("updatestatus.passengerinfo");
                    var n = t.passengerInfoModel.getQuantity();
                    if (n.isChild > n.isAdult * 2) {
                        $.ui.alert("抱歉，儿童必须在成人陪同下登机，一位成人乘客最多带两名儿童乘客登机。");
                        return false
                    }
                    if (n.isInfant > n.isAdult) {
                        $.ui.alert("抱歉，婴儿必须在成人陪同下登机，一位成人乘客最多带一名婴儿乘客登机。");
                        return false
                    }
                    var r = t.passengerInfoModel.caculateTickets();
                    if (r.adult < n.adult) {
                        $.ui.alert("成人票数量不足" + n.adult + "张，请重新选择乘机人。");
                        return false
                    }
                    if (r.child < n.child) {
                        $.ui.alert("儿童剩余票量不足" + n.child + "张，请重新选择乘机人。");
                        return false
                    }
                    if (r.infant < n.infant) {
                        $.ui.alert("婴儿剩余票量不足" + n.infant + "张，请重新选择乘机人。");
                        return false
                    }
                    var s = function() {
                        var e = function() {
                            var e = t.passengerInfoModel.getAllPassenger();
                            i.trigger("checkpassenger.userinfocheck", {
                                passengers: e,
                                callback: function() {
                                    t.submit()
                                }
                            })
                        }
                        ;
                        o(t.data, function() {
                            var n = t.couponInfoModel;
                            if (n && n.needCheck()) {
                                i.trigger("validate.couponinfo", {
                                    callback: function(t, n) {
                                        var r = {
                                            couponPrice: t
                                        };
                                        i.trigger("update.priceinfo", r);
                                        i.trigger("update.installment", r);
                                        var s = "";
                                        if (n === 0) {
                                            e()
                                        } else {
                                            if (n === 1) {
                                                s = "您的优惠券号码错误，不能享受优惠，是否继续提交订单?"
                                            } else if (n === 2) {
                                                s = "您的优惠券号码已使用，不能享受优惠，是否继续提交订单?"
                                            } else if (n === 3) {
                                                s = "您的优惠券号码已过期，不能享受优惠，是否继续提交订单?"
                                            } else if (n === 4) {
                                                s = "您的优惠券号码与乘机人证件号码不匹配，不能享受优惠，是否继续提交订单?"
                                            }
                                            $.ui.confirm(s, {
                                                ok_txt: "是",
                                                ok_cls: "btn_blue",
                                                cancel_txt: "否",
                                                ok_call: function() {
                                                    e()
                                                }
                                            })
                                        }
                                    }
                                })
                            } else {
                                e()
                            }
                        }
                        )
                    }
                    ;
                    var u = function() {
                        if (t.passengerInfoModel.hasSameID()) {
                            $.ui.confirm("乘机人证件号码已重复，请检查是否输入有误", {
                                ok_call: function() {
                                    s()
                                },
                                ok_txt: "提交订单",
                                ok_cls: "btn_blue",
                                cancel_txt: "返回修改",
                                cancel_cls: "btn_blue"
                            });
                            return false
                        } else if (t.passengerInfoModel.isArrivalAliCity()) {
                            var e = "根据民航总局指示，凡购买到达或者途经中转阿里客票的旅客，除持阿里地区本地身份证居民外，其他人员进入阿里地区需持有《边境通行证》才能进入阿里地区。如因旅客违反此规定造成无法乘机等损失，将由旅客自行承担。感谢您的配合";
                            $.ui.alert(e, {
                                closeBtn: false,
                                isEsc: false,
                                ok_cls: "btn_blue",
                                ok_txt: "我知道了",
                                ok_call: function() {
                                    s()
                                }
                            })
                        } else {
                            s()
                        }
                    }
                    ;
                    if (t.payType == 0 && t.expressModel.checkedXCD()) {
                        i.trigger("showspecialtips.agreement", u)
                    } else {
                        if (t.isShowRecInsurance() && t.payType == 0) {
                            i.trigger("showrecinsurancetips.agreement", u);
                            UserTrack(["TTS", "Booking", "RI5"].join("|"));
                            return false
                        } else {
                            u()
                        }
                    }
                },
                each_extend: function(e, t) {
                    var n = $(t.checkNode), r;
                    if (!e) {
                        var r = n.data("errorTime");
                        if (r) {
                            n.data("errorTime", r + 1)
                        } else {
                            n.data("errorTime", 1)
                        }
                    }
                }
            });
            t.submitWrap.delegate("#js_installment_btn", "click", function() {
                t.payType = 1;
                $("#js_booking_form").submit();
                return false
            }
            );
            n.bind("mousedown", function() {
                t.payType = 0
            }
            )
        }
        ;
        f.fn.isShowRecInsurance = function() {
            return this.data.urlInfo.prt !== "1" && this.insureModel._insureCount() === 0 && this.insureModel._recInsuranceGroup().length > 0 && this.insureModel._currInsureTag !== this.insureModel._getRecInsuranceTag()
        }
        ;
        f.fn.submit = function(e) {
            var t = this;
            t.loading();
            t.submit2Pnr(e);
            t.submit2User()
        }
        ;
        f.fn.loading = function() {
            this.submitWrap.hide();
            $("#js_bookingMdloading").removeClass("hide")
        }
        ;
        f.fn.reset = function() {
            this.submitWrap.show();
            $("#js_bookingMdloading").addClass("hide")
        }
        ;
        f.fn.flightNum = function() {
            var e = "";
            for (var t = 0; t < 3; t++) {
                e += Math.floor(Math.random() * 10)
            }
            return e
        }
        ;
        f.fn.submit2User = function(e) {
            var t = this;
            if (!UserStatus.isLogin())
                return;
            var n = t.passengerInfoModel.getPassengerInfo();
            var r = t.contactorModel.getContactInfo();
            var i = t.expressModel.getContactInfo();
            if (!$.isEmptyObject(r)) {
                n.push(r)
            }
            if (!$.isEmptyObject(i)) {
                n.push(i)
            }
            var s = (/csrfToken=([^;]+)/.exec(document.cookie) || [])[1] || "";
            var o = "http://user.qunar.com/webapi/contact/batchSaveOrUpdate";
            QNR.crossDomainPost(o, "contacts=" + JSON.stringify(n) + "&csrfToken=" + s + "&source=flight", "tts/proxydemo.jsp", {})
        }
        ;
        f.fn.pnrData = function(e) {
            var t = this;
            var n = t.data;
            var r = encodeURIComponent;
            var i = [];
            $.each(n.flightInfo, function(e, s) {
                i.push("tgqId=" + (n.randcInfo.id || ""));
                i.push("policy_source=" + (n.urlInfo.source || ""));
                i.push("policy_id=" + n.policyInfo.pid);
                i.push("source=" + n.policyInfo.src);
                i.push("productTag=" + n.priceInfo.prdTag);
                i.push("price=" + n.priceInfo.ypr);
                i.push("discount=" + n.priceInfo.dis);
                i.push("real_price=" + n.priceInfo.pr);
                i.push("type=" + n.policyInfo.put);
                i.push("gx=" + (n.urlInfo.gx || ""));
                i.push("qt=" + (n.urlInfo.qt || ""));
                i.push("prt=" + (n.urlInfo.prt || "1"));
                i.push("policytype=" + n.policyInfo.pmt);
                i.push("tid=" + (n.urlInfo.tid || ""));
                i.push("url=" + r(location.href.toString()));
                i.push("token=" + r(n.token));
                i.push("flightType=" + (n.urlInfo.flight_type || "1"));
                i.push("realfee=" + t.priceModel.total());
                i.push("voucherNum=" + t.priceModel.getVoucherNum());
                i.push("voucherType=" + t.voucherModel.getVoucherType());
                i.push("voucherPerPrice=" + t.voucherModel.getVoucherPerPrice());
                i.push("child_print_price=" + n.priceInfo.cpr);
                i.push("print_price=" + n.priceInfo.npr);
                i.push("cabinCount=" + n.priceInfo.inventory.adult);
                i.push("construction_fee=" + s.acf);
                i.push("fuel_tax=" + s.fot);
                i.push("child_fuel_tax=" + s.cot);
                i.push("flight_no=" + s.co);
                i.push("cabin=" + s.cb);
                i.push("departure_day=" + s.dd);
                i.push("departure_city=" + r(s.dc));
                i.push("departure_airport=" + s.de);
                i.push("departure_time=" + s.dt);
                i.push("arrival_city=" + r(s.ac));
                i.push("arrival_airport=" + s.ae);
                i.push("arrival_time=" + s.at);
                i.push("stop=" + s.sp);
                i.push("child_cangwei=" + s.ccb)
            }
            );
            i.push(this.mealsInfoModel.getFoodInfo());
            i.push(this.passengerInfoModel.getPnrInfo());
            i.push(this.contactorModel.getPnrInfo());
            i.push(this.expressModel.getPnrInfo());
            i.push(this.insureModel.getPnrInfo());
            i.push(this.checheModel.getBookingInfo());
            if (this.giftInfoModel) {
                i.push(this.giftInfoModel.getPnrInfo())
            }
            if (this.couponInfoModel) {
                i.push(this.couponInfoModel.getPnrInfo())
            }
            if (n.needChangeName) {
                i.push("needChangeName=" + n.needChangeName)
            }
            i.push("domain=" + n.venderInfo.site);
            i.push("prdTag=" + n.priceInfo.prdTag);
            i.push("bookingTag=" + r(n.bookingTag));
            var s = this.secureModel.getPnrInfo();
            if (s) {
                i.push(s)
            }
            if (e === "debug") {
                i.push("commitConfirm=true")
            }
            i.push("flightNum=" + t.flightNum());
            if (t.payType == 1) {
                i.push("returnFee=" + t.installmentModel.getOneTicketPre());
                i.push("bookMaxSellPrice=" + t.installmentModel.getMaxSellPrice());
                i.push("bookMinSellPrice=" + t.installmentModel.getMinSellPrice());
                i.push("handleFee=" + t.installmentModel.getHandleFee());
                i.push("bookTagName=" + t.installmentModel.getTagNameInMaxSellPrice());
                i.push("bookPrintPrice=" + n.priceInfo.npr);
                i.push("clientId=" + window.location.host)
            }
            if (n.useFlyFund) {
                i.push("flyfund=" + (t.priceModel.isCheckFlyFund() ? true : false))
            }
            return i.join("&")
        }
        ;
        f.fn.getSearchUrl = function(e) {
            var t = this.data;
            var n = t.roundTrip ? "RoundTripFlight" : "OnewayFlight";
            var r = t.flightInfo[0].dc;
            var i = t.flightInfo[0].ac;
            var s = e || t.flightInfo[0].dd;
            var o = t.flightInfo[1] ? t.flightInfo[1].ad : t.flightInfo[0].ad;
            var u = ["http://flight.qunar.com/twell/flight/Search.jsp?searchType=", n, "&fromCity=", encodeURIComponent(r), "&toCity=", encodeURIComponent(i), "&fromDate=", s, "&toDate=", o].join("");
            return u
        }
        ;
        f.fn.pnrFailTreat = function(e) {
            function l() {
                s = "";
                o = "确定";
                i = '报价已过期，请<a href="' + f + '">返回</a>重新搜索报价'
            }
            function c() {
                s = "";
                o = "确定";
                i = '该代理商无售卖此舱位权限，请<a href="' + f + '">返回</a>选择其他代理商报价'
            }
            function h() {
                s = "";
                o = "确定";
                i = "乘机人证件类型或号码有误，请您仔细核对后再提交订单"
            }
            function p() {
                r = JSON.parse(r);
                var e = r.length;
                var t = {
                    1: "身份证",
                    2: "护照",
                    12: "证件号码"
                };
                switch (e) {
                case 1:
                    var n = r[0];
                    var u = n.cardtype == 1 ? "identity" : "";
                    i = ['<div class="pnrfail-tip-wrapper">', '<p class="pnrfail-title">乘机人&nbsp;&nbsp;', n.name, "（", t[n.cardtype], "&nbsp;", a.treatSensitiveInfo(u, n.cardno), "）", "</p>", '<p class="pnrfail-desc">', '目前为<a href="http://shixin.court.gov.cn/" target="_blank">失信被执行人</a>，暂时无法预订机票，请返回去掉此乘机人', "</p>", "</div>"].join("");
                    break;
                default:
                    var f = [];
                    for (var l = 0; l < e; l++) {
                        f.push(r[l].name)
                    }
                    i = ['<div class="pnrfail-tip-wrapper">', '<p class="pnrfail-title">乘机人', f.join("、"), '目前为<a href="http://shixin.court.gov.cn/" target="_blank">失信被执行人</a>，暂时无法预订机票，请返回去掉失信被执行人乘客', "</p>", "</div>"].join("")
                }
                o = "返回";
                s = "btn_blue"
            }
            var t = this
              , n = e.code
              , r = e.msg
              , i = ""
              , s = ""
              , o = ""
              , u = function() {}
              , a = Utils
              , f = t.getSearchUrl();
            switch (n) {
            case 32:
                h();
                break;
            case 33:
                p();
                break;
            case 34:
            case 35:
                c();
                break;
            case 36:
                l();
                break;
            default:
                break
            }
            $.ui.alert(i, {
                ok_cls: s,
                ok_txt: o,
                ok_call: u
            })
        }
        ;
        f.fn.submit2Pnr = function(e) {
            var t = this.pnrData(e);
            var n = this
              , r = n.payType;
            var s = function() {
                if (r == 0) {
                    return "/api/web/trade/new_order.json"
                } else if (r == 1) {
                    return "/api/web/prepay_order.json"
                }
            }
            ();
            if (r == 1) {
                a("installment_ck")
            }
            i.trigger("monitor.behavior", ["bookingrefactor", {
                passenger: n.passengerInfoModel
            }]);
            var o = $.ajax({
                url: s,
                type: "POST",
                data: t,
                cache: false,
                dataType: "json",
                timeout: 4e4
            });
            o.done(function(e) {
                if (e && e.result === 0) {
                    var t = [];
                    var r = e.flyfundAmount || 0;
                    var s = n.priceModel.getFlyFundUsed() || 0;
                    var o = n.priceModel.getTotalPriceByName("adultTicketPrice");
                    var u = s;
                    var a = n.priceModel.isCheckFlyFund();
                    if (r > n.data.flyFundToUse) {
                        u = Math.min(o, r)
                    } else if (r < n.data.flyFundToUse) {
                        if (s == n.data.flyFundToUse) {
                            u = r
                        } else {
                            u = Math.min(o, r)
                        }
                    }
                    var f = s - u;
                    if (e.flightDelayErr || e.carOrderErr || n.data.useFlyFund && a && f != 0) {
                        if (n.data.useFlyFund && f != 0) {
                            var l = n.priceModel.getTotalPriceByName("total");
                            var c = n.priceModel.getTotalPriceByName("hyInsure");
                            var h = f > 0 ? "对不起" : "恭喜您";
                            var p = l + f - (e.flightDelayErr ? c : 0);
                            t.push([h, "，您当前可用飞基金金额由", s, "变为", u, "待支付金额由", l + "元", "变为", p + "元"].join(""))
                        }
                        e.flightDelayErr && t.push(e.msg);
                        e.carOrderErr && t.push(e.carOrderErr);
                        t = t.join("<br/>");
                        var d = $.ui.alert(t, {
                            ok_txt: "继续购买",
                            ok_cls: "btn_blue",
                            closeBtn: false,
                            ok_call: function() {
                                location.href = e.url
                            },
                            callback: function() {
                                if (e.flightDelayErr) {
                                    n.insureModel.info.flightDelayErr = true;
                                    i.trigger("clearhyinsure.agreement")
                                }
                            }
                        })
                    } else {
                        location.href = e.url
                    }
                } else {
                    n.submitFaild(e);
                    n.reset()
                }
            }
            );
            o.fail(function(e) {
                n.reset();
                $.ui.alert("系统繁忙，请稍后再试")
            }
            );
            return o
        }
        ;
        f.fn.submitFaild = function(e) {
            function r() {
                var n = e.code
                  , r = e.msg
                  , i = e.url;
                switch (n) {
                case 32:
                case 33:
                case 34:
                case 35:
                case 36:
                    t.pnrFailTreat(e);
                    break;
                case 300:
                    var s = $.ui.alert("测试环境不允许预订两个月之内的航班！", {
                        btns: [{
                            txt: "重新预订",
                            cbfun: function() {
                                location.href = i
                            }
                        }, {
                            txt: "继续下单",
                            cbfun: function() {
                                s.hide();
                                t.submit("debug")
                            }
                        }]
                    });
                    break;
                case 25:
                    $.ui.alert(r, {
                        ok_txt: "重新搜索",
                        ok_cls: "btn_blue",
                        ok_call: function() {
                            location.href = i
                        }
                    });
                    break;
                case 17:
                    $.ui.alert(r, {
                        ok_call: function() {
                            location.reload()
                        }
                    });
                    break;
                default:
                    if (r) {
                        $.ui.alert(r)
                    } else if (i) {
                        location.href = i
                    }
                }
            }
            var t = this;
            var n = t.secureModel;
            if (!e) {
                $.ui.alert("下单失败，请联系客服。");
                return
            }
            n.init({
                bmSubmit: t,
                data: e,
                callback: r
            })
        }
        ;
        n.exports = f
    }
    (t.exports, t, e);
    e.____MODULES["1aba117e851a04b4a03ea5fd8df1ee0c"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "a79d8298509685891e2e50bd5f4f0192",
        filename: "index.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        var i = e.____MODULES["1aba117e851a04b4a03ea5fd8df1ee0c"];
        n.exports = i
    }
    (t.exports, t, e);
    e.____MODULES["a79d8298509685891e2e50bd5f4f0192"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "da77f0f8eaa3d0749273c29350d2982c",
        filename: "customEventModel.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        var i = e.____MODULES["285adc5af3055e36addfeabe5289c690"];
        var s = e.____MODULES["312540359c661f626d6031b9f938e9a2"];
        var o = window.model;
        var u = s.create();
        u.fn.initialize = function(e) {
            priceInfo = e.priceInfo || {};
            priceInfo.inventory = priceInfo.inventory || {};
            priceTag = priceInfo.priceTag || {};
            flightInfo = e.flightInfo || [{}];
            policyInfo = e.policyInfo || {};
            extInfo = e.extInfo || {};
            this.logDeferData = {
                tag: extInfo.tag,
                key: e.bookingTag,
                price: priceInfo.pr,
                nprince: priceInfo.npr,
                restCabin: priceInfo.inventory.adult,
                dpt: flightInfo[0].de,
                arr: flightInfo[0].ae,
                date: flightInfo[0].dd,
                flight: flightInfo[0].co,
                cabin: flightInfo[0].cb,
                fid: policyInfo.policyFriendlyId,
                qt: extInfo.qt,
                priceTag: priceTag,
                domain: document.location.host
            };
            this.phoneDeferData = {
                key: e.bookingTag,
                user: /_q=([^;]*);?/.exec(document.cookie) && /_q=([^;]*);?/.exec(document.cookie)[1].substring(2) || ""
            }
        }
        ;
        o.autoRun.push(function(e) {
            o.dataModel.customEventModel = new u(e)
        }
        )
    }
    (t.exports, t, e);
    e.____MODULES["da77f0f8eaa3d0749273c29350d2982c"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "dadb7b2c4be19b294778cae6b248e63b",
        filename: "customEvent.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        var i = e.____MODULES["285adc5af3055e36addfeabe5289c690"];
        var s = e.____MODULES["312540359c661f626d6031b9f938e9a2"];
        var o = s.create();
        o.fn.initialize = function(e) {
            var t = e.customEventModel;
            var n = new $.Deferred;
            var r = new $.Deferred;
            var s = t.logDeferData;
            var o = t.phoneDeferData;
            var u = function() {
                var t = window.location.search.substring(1);
                t = t.split("&");
                var n = {};
                $.each(t, function() {
                    var e = this.split("=");
                    n[e[0]] = e[1]
                }
                );
                return n
            }
            ();
            var a = "d" in u && "k" in u;
            ~function() {
                i.on("passenger.onceAdd", function(e, t) {
                    $.ajax({
                        url: "/tts/price/tools/crawl",
                        data: t,
                        type: "get"
                    })
                }
                );
                i.on("contactor.phoneAdd", function(e, t) {
                    $.ajax({
                        url: "/tts/price/tools/scalper",
                        data: t,
                        type: "get"
                    })
                }
                );
                n.done(function(e) {
                    i.trigger("passenger.onceAdd", [e])
                }
                );
                r.done(function(e) {
                    i.trigger("contactor.phoneAdd", [e])
                }
                );
                if (a) {
                    n.resolve(s)
                }
                $(document.body).delegate(".js-logDefer", "click", function(e) {
                    var t = $(this).attr("type") === "radio";
                    if (a && t) {
                        $(".js-phoneDefer").trigger("blur")
                    }
                }
                );
                $(document.body).delegate(".js-phoneDefer", "blur", function() {
                    function t() {
                        var t = $(".js-phoneDefer");
                        var n = t.size();
                        n === 2 ? o.phone = t.eq(1).val() : o.phone = e.val()
                    }
                    var e = $(this);
                    if (a && ("TN" in s.priceTag || "TNI" in s.priceTag)) {
                        e.parent().hasClass("e_correct") && (t(),
                        r.resolve(o))
                    }
                }
                )
            }
            ()
        }
        ;
        n.exports = o
    }
    (t.exports, t, e);
    e.____MODULES["dadb7b2c4be19b294778cae6b248e63b"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "0c828e7548ccc142cfd74816836e342c",
        filename: "index.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        e.____MODULES["da77f0f8eaa3d0749273c29350d2982c"];
        var i = e.____MODULES["dadb7b2c4be19b294778cae6b248e63b"];
        n.exports = i
    }
    (t.exports, t, e);
    e.____MODULES["0c828e7548ccc142cfd74816836e342c"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "c8cd93050267470eef00bcb85818a30f",
        filename: "Floatlayer.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        var i = e.____MODULES["285adc5af3055e36addfeabe5289c690"];
        var s = e.____MODULES["312540359c661f626d6031b9f938e9a2"];
        var o = s.create();
        o.fn.initialize = function(e) {
            this._data = e.originData;
            this.executed = false;
            this._urlSearch = this._urlParse(this._data.urlInfo);
            this._channelBind()
        }
        ;
        o.fn._channelBind = function() {
            var e = this;
            i.on("showlayer.floatlayer", function(t, n) {
                e.showLayer(n.vouchers, n.price, n.count, n.voucherModel)
            }
            )
        }
        ;
        o.fn._urlParse = function(e) {
            var t = [];
            $.each(e, function(e, n) {
                t.push(e + "=" + n)
            }
            );
            return t.join("&")
        }
        ;
        o.fn.showLayer = function(e, t, n, r) {
            if (this.executed || this._data.forceLogin) {
                return
            }
            if (r.isJSJVoucher()) {
                return
            }
            this.executed = true;
            var i;
            var s;
            var o = r.getVouchesInfo().vname;
            if (e > 0) {
                i = "您购买的是自由行产品，包括机票和价值" + e + "元（" + t + "元 * " + n + "张）" + o + "。";
                s = "预订套餐"
            } else if (!(this._data.flightInfo.length > 1) && this.isHigherThanY()) {
                i = "您所选购的是特殊机票产品，销售价高于票面价格（经济舱全价）。";
                s = "预订"
            }
            if (!i) {
                return
            }
            $.ui.alert(i, {
                closeBtn: false,
                isEsc: false,
                btns: [{
                    txt: s,
                    cbfun: function() {},
                    cls: "btn_blue"
                }, {
                    txt: "取消",
                    cbfun: function() {
                        location.href = "http://flight.qunar.com"
                    },
                    cls: "btn_blue"
                }]
            })
        }
        ;
        o.fn.isHigherThanY = function() {
            var e = this._data.flightInfo[0].cbcn === "经济舱";
            if (!e) {
                return false
            }
            var t;
            if (this._data.urlInfo) {
                t = (/prt=([^&]*)/.exec(this._urlSearch) || [])[1]
            } else {
                t = (/prt=([^&]*)/.exec(location.href) || [])[1]
            }
            var n = this._data.priceInfo;
            var r = n.pr;
            var i = n.bpr;
            var s = n.ypr;
            return (t === "1" && r ? r : i) > s
        }
        ;
        n.exports = o
    }
    (t.exports, t, e);
    e.____MODULES["c8cd93050267470eef00bcb85818a30f"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "4a9d43464cbcc1df6abb94f1b9c2e3bd",
        filename: "index.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        var i = e.____MODULES["c8cd93050267470eef00bcb85818a30f"];
        n.exports = i
    }
    (t.exports, t, e);
    e.____MODULES["4a9d43464cbcc1df6abb94f1b9c2e3bd"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "acd548c0a60f14b416c868146bd51323",
        filename: "BookingChecheInfo.mustache",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(e, t, n) {
        if (typeof window.QTMPL === "undefined")
            window.QTMPL = {};
        window.QTMPL["BookingChecheInfo"] = new window.Hogan.Template(function(e, t, n) {
            var r = this;
            r.b(n = n || "");
            r.b("<!--车车模块-->");
            r.b("\n" + n);
            if (r.s(r.f("support_car", e, t, 1), e, t, 0, 28, 12167, "{{ }}")) {
                r.rs(e, t, function(e, t, r) {
                    r.b('    <div class="title_main">');
                    r.b("\n" + n);
                    r.b('        <div class="service_info js_fuwu_info">');
                    r.b("\n" + n);
                    r.b('            <a href="#" onclick="return false;" class="s_text">服务说明</a>');
                    r.b("\n" + n);
                    r.b('            <div class="orangejt_tips js_fuwu_container hide">');
                    r.b("\n" + n);
                    r.b('                <div class="tips_contair">');
                    r.b("\n" + n);
                    r.b('                    <div class="bot"></div>');
                    r.b("\n" + n);
                    r.b('                    <div class="top"></div>');
                    r.b("\n" + n);
                    r.b('                    <div class="tips_content js_tips_content">');
                    r.b("\n" + n);
                    r.b("                       ");
                    r.b("\n" + n);
                    r.b("                    </div>");
                    r.b("\n" + n);
                    r.b("                </div>");
                    r.b("\n" + n);
                    r.b("            </div>");
                    r.b("\n" + n);
                    r.b("        </div>");
                    r.b("\n" + n);
                    r.b("        <div>接送机<em>");
                    r.b(r.t(r.f("slogan", e, t, 0)));
                    r.b("</em></div>");
                    r.b("\n" + n);
                    r.b("        ");
                    r.b("\n" + n);
                    r.b("    </div>");
                    r.b("\n" + n);
                    r.b("\n" + n);
                    r.b('    <div class="service_detial">');
                    r.b("\n" + n);
                    if (r.s(r.f("toAirPortInfo", e, t, 1), e, t, 0, 667, 6421, "{{ }}")) {
                        r.rs(e, t, function(e, t, r) {
                            r.b('        <div class="drop_service js_drop_service">');
                            r.b("\n" + n);
                            if (r.s(r.f("isSupported", e, t, 1), e, t, 0, 747, 5980, "{{ }}")) {
                                r.rs(e, t, function(e, t, r) {
                                    r.b('            <div class="service_title fix">');
                                    r.b("\n" + n);
                                    r.b('                <div class="info">');
                                    r.b("\n" + n);
                                    r.b('                    <input type="checkbox" class="checkbox js_service_chk" id="drop_service">        ');
                                    r.b("\n" + n);
                                    r.b('                    <label for="drop_service">');
                                    r.b("\n" + n);
                                    r.b("                        送机服务");
                                    r.b("\n" + n);
                                    r.b('                        <span class="service_price">(<i class="rmb">&yen;</i> <em class="pr">');
                                    r.b(r.v(r.f("startPrice", e, t, 0)));
                                    r.b("</em>起)</span>");
                                    r.b("\n" + n);
                                    r.b("                    </label>");
                                    r.b("\n" + n);
                                    r.b("                </div>");
                                    r.b("\n" + n);
                                    r.b('                <div class="line">');
                                    r.b("\n" + n);
                                    r.b('                    <span class="from">出发地</span> <i class="arrow"></i>');
                                    r.b("\n" + n);
                                    r.b('                    <span class="to">');
                                    r.b(r.v(r.f("airPortName", e, t, 0)));
                                    r.b("</span>");
                                    r.b("\n" + n);
                                    r.b("                </div>");
                                    r.b("\n" + n);
                                    r.b("            </div>");
                                    r.b("\n" + n);
                                    r.b('            <div class="s_area fix hide js_service_area">');
                                    r.b("\n" + n);
                                    r.b('                <div class="s_content">');
                                    r.b("\n" + n);
                                    r.b('                    <div class="s_list fix">');
                                    r.b("\n" + n);
                                    r.b('                        <h3 class="s_tip">');
                                    r.b("\n" + n);
                                    r.b('                            用车时间<i class="l_star"></i>');
                                    r.b("\n" + n);
                                    r.b("                        </h3>");
                                    r.b("\n" + n);
                                    r.b('                        <div class="s_op fix">');
                                    r.b("\n" + n);
                                    r.b('                            <div class="date js_car_date">');
                                    r.b("\n" + n);
                                    r.b('                                <select class="js_date_select selectbox idtype hide" name="car_date_1" data-service-type=1  style="display: none;">');
                                    r.b("\n" + n);
                                    if (r.s(r.f("dateList", e, t, 1), e, t, 0, 1962, 2074, "{{ }}")) {
                                        r.rs(e, t, function(e, t, n) {
                                            n.b("                                        <option value=");
                                            n.b(n.v(n.d(".", e, t, 0)));
                                            n.b(">");
                                            n.b(n.v(n.d(".", e, t, 0)));
                                            n.b("</option>");
                                            n.b("\n")
                                        }
                                        );
                                        e.pop()
                                    }
                                    r.b("                                    ");
                                    r.b("\n" + n);
                                    r.b("                                </select>");
                                    r.b("\n" + n);
                                    r.b("                            ");
                                    r.b("\n" + n);
                                    r.b("                            </div>");
                                    r.b("\n" + n);
                                    r.b('                            <div class="hour js_car_hour">');
                                    r.b("\n" + n);
                                    r.b('                                <select class="selectbox idtype hide" name="car_hour" style="display: none;">');
                                    r.b("\n" + n);
                                    if (r.s(r.f("hourList", e, t, 1), e, t, 0, 2449, 2561, "{{ }}")) {
                                        r.rs(e, t, function(e, t, n) {
                                            n.b("                                        <option value=");
                                            n.b(n.v(n.d(".", e, t, 0)));
                                            n.b(">");
                                            n.b(n.v(n.d(".", e, t, 0)));
                                            n.b("</option>");
                                            n.b("\n")
                                        }
                                        );
                                        e.pop()
                                    }
                                    r.b("\n" + n);
                                    r.b("                                </select>");
                                    r.b("\n" + n);
                                    r.b("                            ");
                                    r.b("\n" + n);
                                    r.b("                            </div>");
                                    r.b("\n" + n);
                                    r.b('                            <div class="minute js_car_minute">');
                                    r.b("\n" + n);
                                    r.b('                                <select class="selectbox idtype hide" name="car_minute" style="display: none;">');
                                    r.b("\n" + n);
                                    if (r.s(r.f("minuteList", e, t, 1), e, t, 0, 2908, 3020, "{{ }}")) {
                                        r.rs(e, t, function(e, t, n) {
                                            n.b("                                        <option value=");
                                            n.b(n.v(n.d(".", e, t, 0)));
                                            n.b(">");
                                            n.b(n.v(n.d(".", e, t, 0)));
                                            n.b("</option>");
                                            n.b("\n")
                                        }
                                        );
                                        e.pop()
                                    }
                                    r.b("                                </select>");
                                    r.b("\n" + n);
                                    r.b("                            </div>");
                                    r.b("\n" + n);
                                    r.b("\n" + n);
                                    r.b("                        </div>");
                                    r.b("\n" + n);
                                    r.b("                    </div>");
                                    r.b("\n" + n);
                                    r.b('                    <div class="s_list">');
                                    r.b("\n" + n);
                                    r.b('                        <h3 class="s_tip s_tip_little">出发地<i class="l_star l_star_little"></i>');
                                    r.b("\n" + n);
                                    r.b("                        </h3>");
                                    r.b("\n" + n);
                                    r.b('                        <div class="s_op js_address s_address">');
                                    r.b("\n" + n);
                                    r.b('                            <span class="textbox_place">');
                                    r.b("\n" + n);
                                    r.b('                                <input autocomplete="off" name="place" type="text" class="input_place" data-jvalid-ruler="empty" data-service-type=1 data-airport-code="');
                                    r.b(r.v(r.f("airportCode", e, t, 0)));
                                    r.b('" data-terminal-code="');
                                    r.b(r.v(r.f("terminalCode", e, t, 0)));
                                    r.b('"></span>');
                                    r.b("\n" + n);
                                    r.b("                        </div>");
                                    r.b("\n" + n);
                                    r.b('                         <div class="s_price_info js_price_info">');
                                    r.b("\n" + n);
                                    r.b("                           ");
                                    r.b("\n" + n);
                                    r.b("                        </div>");
                                    r.b("\n" + n);
                                    r.b("                    </div>");
                                    r.b("\n" + n);
                                    r.b("                </div>");
                                    r.b("\n" + n);
                                    r.b('                <div class="car_type">');
                                    r.b("\n" + n);
                                    r.b('                    <ul class="car_list fix">');
                                    r.b("\n" + n);
                                    if (r.s(r.f("carList", e, t, 1), e, t, 0, 4017, 5887, "{{ }}")) {
                                        r.rs(e, t, function(e, t, r) {
                                            r.b('                        <li class="car js_car ');
                                            if (!r.s(r.f("isChecked", e, t, 1), e, t, 1, 0, 0, "")) {
                                                r.b("opacity_car")
                                            }
                                            r.b('">');
                                            r.b("\n" + n);
                                            r.b('                            <input type="radio" name="car_type_service" class="js_car_type " id="s_tcar_');
                                            r.b(r.v(r.f("carTypeId", e, t, 0)));
                                            r.b('" value="');
                                            r.b(r.v(r.f("carTypeId", e, t, 0)));
                                            r.b('" ');
                                            if (r.s(r.f("isChecked", e, t, 1), e, t, 0, 4261, 4268, "{{ }}")) {
                                                r.rs(e, t, function(e, t, n) {
                                                    n.b("checked")
                                                }
                                                );
                                                e.pop()
                                            }
                                            r.b(">        ");
                                            r.b("\n" + n);
                                            r.b('                            <label for="s_tcar_');
                                            r.b(r.v(r.f("carTypeId", e, t, 0)));
                                            r.b('" class="s_car_label">');
                                            r.b("\n" + n);
                                            r.b('                                <img src="');
                                            r.b(r.v(r.f("carTypeImg", e, t, 0)));
                                            r.b('" class="s_car_img"  height="24"/>');
                                            r.b("\n" + n);
                                            r.b('                                 <span class="s_car_type js_little_tip">');
                                            r.b("\n" + n);
                                            r.b("                                    <span>");
                                            r.b(r.v(r.f("carTypeName", e, t, 0)));
                                            r.b("</span>");
                                            r.b("\n" + n);
                                            r.b('                                    <div class="orangejt_tips js_car_tips hide">');
                                            r.b("\n" + n);
                                            r.b('                                        <div class="tips_contair">');
                                            r.b("\n" + n);
                                            r.b('                                            <div class="bot"></div>');
                                            r.b("\n" + n);
                                            r.b('                                            <div class="top"></div>');
                                            r.b("\n" + n);
                                            r.b('                                            <div class="tips_content js_little_content">');
                                            r.b(r.v(r.f("carTypeDesc", e, t, 0)));
                                            r.b("</div>");
                                            r.b("\n" + n);
                                            r.b("                                        </div>");
                                            r.b("\n" + n);
                                            r.b("                                    </div>");
                                            r.b("\n" + n);
                                            r.b("                                </span>");
                                            r.b("\n" + n);
                                            r.b('                                <span class="s_people js_little_tip">');
                                            r.b("\n" + n);
                                            r.b("                                    <span>");
                                            r.b(r.v(r.f("carSeatNum", e, t, 0)));
                                            r.b("人</span>");
                                            r.b("\n" + n);
                                            r.b('                                    <div class="orangejt_tips js_car_tips hide">');
                                            r.b("\n" + n);
                                            r.b('                                        <div class="tips_contair">');
                                            r.b("\n" + n);
                                            r.b('                                            <div class="bot"></div>');
                                            r.b("\n" + n);
                                            r.b('                                            <div class="top"></div>');
                                            r.b("\n" + n);
                                            r.b('                                            <div class="tips_content js_little_content">此车型可乘坐');
                                            r.b(r.v(r.f("carSeatNum", e, t, 0)));
                                            r.b("人</div>");
                                            r.b("\n" + n);
                                            r.b("                                        </div>");
                                            r.b("\n" + n);
                                            r.b("                                    </div>");
                                            r.b("\n" + n);
                                            r.b("                                </span>   ");
                                            r.b("\n" + n);
                                            r.b("                            </label>");
                                            r.b("\n" + n);
                                            r.b("                        </li>");
                                            r.b("\n")
                                        }
                                        );
                                        e.pop()
                                    }
                                    r.b("                    </ul>");
                                    r.b("\n" + n);
                                    r.b("                </div>");
                                    r.b("\n" + n);
                                    r.b("            </div>");
                                    r.b("\n")
                                }
                                );
                                e.pop()
                            }
                            if (!r.s(r.f("isSupported", e, t, 1), e, t, 1, 0, 0, "")) {
                                r.b('            <div class="service_title fix">');
                                r.b("\n" + n);
                                r.b('                <div class="info">');
                                r.b("\n" + n);
                                r.b('                    <input type="checkbox" class="checkbox js_service_chk" disabled id="drop_service">        ');
                                r.b("\n" + n);
                                r.b('                    <label for="drop_service">送机服务</label>');
                                r.b("\n" + n);
                                r.b("                </div>");
                                r.b("\n" + n);
                                r.b('                <div class="line">此城市暂不支持送机服务</div>');
                                r.b("\n" + n);
                                r.b("            </div>");
                                r.b("\n")
                            }
                            r.b("        </div>");
                            r.b("\n")
                        }
                        );
                        e.pop()
                    }
                    r.b("        ");
                    r.b("\n" + n);
                    if (r.s(r.f("fromAirPortInfo", e, t, 1), e, t, 0, 6477, 11667, "{{ }}")) {
                        r.rs(e, t, function(e, t, r) {
                            r.b('        <div class="pick_service js_pick_service">');
                            r.b("\n" + n);
                            if (r.s(r.f("isSupported", e, t, 1), e, t, 0, 6557, 11226, "{{ }}")) {
                                r.rs(e, t, function(e, t, r) {
                                    r.b('            <div class="service_title fix">');
                                    r.b("\n" + n);
                                    r.b('                <div class="info">');
                                    r.b("\n" + n);
                                    r.b('                    <input type="checkbox" class="checkbox js_service_chk" id="pick_service">        ');
                                    r.b("\n" + n);
                                    r.b('                    <label for="pick_service">');
                                    r.b("\n" + n);
                                    r.b("                        接机服务");
                                    r.b("\n" + n);
                                    r.b('                        <span class="service_price">(<i class="rmb">&yen;</i> <em class="pr">');
                                    r.b(r.v(r.f("startPrice", e, t, 0)));
                                    r.b("</em>起)</span>");
                                    r.b("\n" + n);
                                    r.b("                    </label>");
                                    r.b("\n" + n);
                                    r.b("                </div>");
                                    r.b("\n" + n);
                                    r.b('                <div class="line">');
                                    r.b("\n" + n);
                                    r.b('                    <span class="from">');
                                    r.b(r.v(r.f("airPortName", e, t, 0)));
                                    r.b('</span> <i class="arrow"></i>');
                                    r.b("\n" + n);
                                    r.b('                    <span class="to">目的地</span>');
                                    r.b("\n" + n);
                                    r.b("                </div>");
                                    r.b("\n" + n);
                                    r.b("            </div>");
                                    r.b("\n" + n);
                                    r.b('            <div class="s_area fix hide js_service_area">');
                                    r.b("\n" + n);
                                    r.b('                <div class="s_content">');
                                    r.b("\n" + n);
                                    r.b('                    <div class="s_list fix">');
                                    r.b("\n" + n);
                                    r.b('                        <h3 class="s_tip">');
                                    r.b("\n" + n);
                                    r.b('                            用车时间<i class="l_star"></i>');
                                    r.b("\n" + n);
                                    r.b("                        </h3>");
                                    r.b("\n" + n);
                                    r.b('                        <div class="s_op fix js_pick_time" data-time="');
                                    r.b(r.v(r.f("dateList", e, t, 0)));
                                    r.b(" ");
                                    r.b(r.v(r.f("hourList", e, t, 0)));
                                    r.b(":");
                                    r.b(r.v(r.f("minuteList", e, t, 0)));
                                    r.b(':00">');
                                    r.b("\n" + n);
                                    r.b("                            ");
                                    r.b(r.v(r.f("dateList", e, t, 0)));
                                    r.b("&nbsp;&nbsp;&nbsp; ");
                                    r.b(r.v(r.f("hourList", e, t, 0)));
                                    r.b(":");
                                    r.b(r.v(r.f("minuteList", e, t, 0)));
                                    r.b("\n" + n);
                                    r.b("\n" + n);
                                    r.b("                        </div>");
                                    r.b("\n" + n);
                                    r.b("                    </div>");
                                    r.b("\n" + n);
                                    r.b('                    <div class="s_list">');
                                    r.b("\n" + n);
                                    r.b('                        <h3 class="s_tip s_tip_little">目的地<i class="l_star l_star_little"></i>');
                                    r.b("\n" + n);
                                    r.b("                        </h3>");
                                    r.b("\n" + n);
                                    r.b('                        <div class="s_op js_address s_address">');
                                    r.b("\n" + n);
                                    r.b('                            <span class="textbox_place">');
                                    r.b("\n" + n);
                                    r.b('                                <input autocomplete="off" name="place" type="text" class="input_place" data-jvalid-ruler="empty" data-service-type=2  data-airport-code="');
                                    r.b(r.v(r.f("airportCode", e, t, 0)));
                                    r.b('" data-terminal-code="');
                                    r.b(r.v(r.f("terminalCode", e, t, 0)));
                                    r.b('"></span>');
                                    r.b("\n" + n);
                                    r.b('                            <!-- <ul class="address_list js_address_list">');
                                    r.b("\n" + n);
                                    r.b('                                <li class="error_item">找不到<i class="error_tip"></i></li>');
                                    r.b("\n" + n);
                                    r.b('                                <li class="address_item on">');
                                    r.b("\n" + n);
                                    r.b('                                    <p class="add_name">维亚大厦</p>');
                                    r.b("\n" + n);
                                    r.b('                                    <p class="add_detail">海淀区苏州街29号</p>');
                                    r.b("\n" + n);
                                    r.b("                                </li>");
                                    r.b("\n" + n);
                                    r.b('                                <li class="address_item">东升科技园</li>');
                                    r.b("\n" + n);
                                    r.b("                            </ul> -->");
                                    r.b("\n" + n);
                                    r.b("                        </div>");
                                    r.b("\n" + n);
                                    r.b('                        <div class="s_price_info js_price_info">');
                                    r.b("\n" + n);
                                    r.b("                           ");
                                    r.b("\n" + n);
                                    r.b("                        </div>");
                                    r.b("\n" + n);
                                    r.b("                    </div>");
                                    r.b("\n" + n);
                                    r.b('                    <p class="s_list s_list_p"><i class="tip_blue"></i>航班延误，司机将免费等待</p>');
                                    r.b("\n" + n);
                                    r.b("                </div>");
                                    r.b("\n" + n);
                                    r.b('                <div class="car_type">');
                                    r.b("\n" + n);
                                    r.b('                    <ul class="car_list fix">');
                                    r.b("\n" + n);
                                    if (r.s(r.f("carList", e, t, 1), e, t, 0, 9170, 11133, "{{ }}")) {
                                        r.rs(e, t, function(e, t, r) {
                                            r.b('                        <li class="car js_car ');
                                            if (!r.s(r.f("isChecked", e, t, 1), e, t, 1, 0, 0, "")) {
                                                r.b("opacity_car")
                                            }
                                            r.b('">');
                                            r.b("\n" + n);
                                            r.b('                            <input type="radio" class="js_car_type" name="car_type_pick" id="s_fcar_');
                                            r.b(r.v(r.f("carTypeId", e, t, 0)));
                                            r.b('" ');
                                            if (r.s(r.f("isChecked", e, t, 1), e, t, 0, 9388, 9395, "{{ }}")) {
                                                r.rs(e, t, function(e, t, n) {
                                                    n.b("checked")
                                                }
                                                );
                                                e.pop()
                                            }
                                            r.b(' value="');
                                            r.b(r.v(r.f("carTypeId", e, t, 0)));
                                            r.b('">        ');
                                            r.b("\n" + n);
                                            r.b('                            <label for="s_fcar_');
                                            r.b(r.v(r.f("carTypeId", e, t, 0)));
                                            r.b('" class="s_car_label">');
                                            r.b("\n" + n);
                                            r.b('                                <img src="');
                                            r.b(r.v(r.f("carTypeImg", e, t, 0)));
                                            r.b('" class="s_car_img"  height="24"/>        ');
                                            r.b("\n" + n);
                                            r.b('                                <span class="s_car_type js_little_tip">');
                                            r.b("\n" + n);
                                            r.b("                                    <span>");
                                            r.b(r.v(r.f("carTypeName", e, t, 0)));
                                            r.b("</span>");
                                            r.b("\n" + n);
                                            r.b('                                    <div class="orangejt_tips js_car_tips hide">');
                                            r.b("\n" + n);
                                            r.b('                                        <div class="tips_contair">');
                                            r.b("\n" + n);
                                            r.b('                                            <div class="bot"></div>');
                                            r.b("\n" + n);
                                            r.b('                                            <div class="top"></div>');
                                            r.b("\n" + n);
                                            r.b('                                            <div class="tips_content js_little_content">');
                                            r.b(r.v(r.f("carTypeDesc", e, t, 0)));
                                            r.b("</div>");
                                            r.b("\n" + n);
                                            r.b("                                        </div>");
                                            r.b("\n" + n);
                                            r.b("                                    </div>");
                                            r.b("\n" + n);
                                            r.b("                                </span>");
                                            r.b("\n" + n);
                                            r.b('                                <span class="s_people js_little_tip">');
                                            r.b("\n" + n);
                                            r.b("                                    <span>");
                                            r.b(r.v(r.f("carSeatNum", e, t, 0)));
                                            r.b("人</span>");
                                            r.b("\n" + n);
                                            r.b('                                    <div class="orangejt_tips js_car_tips hide">');
                                            r.b("\n" + n);
                                            r.b('                                        <div class="tips_contair">');
                                            r.b("\n" + n);
                                            r.b('                                            <div class="bot"></div>');
                                            r.b("\n" + n);
                                            r.b('                                            <div class="top"></div>');
                                            r.b("\n" + n);
                                            r.b('                                            <div class="tips_content js_little_content">');
                                            r.b("\n" + n);
                                            r.b("                                               此车型可乘坐");
                                            r.b(r.v(r.f("carSeatNum", e, t, 0)));
                                            r.b("人");
                                            r.b("\n" + n);
                                            r.b("                                            </div>");
                                            r.b("\n" + n);
                                            r.b("                                        </div>");
                                            r.b("\n" + n);
                                            r.b("                                    </div>");
                                            r.b("\n" + n);
                                            r.b("                                </span>");
                                            r.b("\n" + n);
                                            r.b("                            </label>");
                                            r.b("\n" + n);
                                            r.b("                        </li>");
                                            r.b("\n")
                                        }
                                        );
                                        e.pop()
                                    }
                                    r.b("                    </ul>");
                                    r.b("\n" + n);
                                    r.b("                </div>");
                                    r.b("\n" + n);
                                    r.b("            </div>");
                                    r.b("\n")
                                }
                                );
                                e.pop()
                            }
                            if (!r.s(r.f("isSupported", e, t, 1), e, t, 1, 0, 0, "")) {
                                r.b('            <div class="service_title fix">');
                                r.b("\n" + n);
                                r.b('                <div class="info">');
                                r.b("\n" + n);
                                r.b('                    <input type="checkbox" class="checkbox js_service_chk" disabled id="pick_service">        ');
                                r.b("\n" + n);
                                r.b('                    <label for="pick_service">接机服务</label>');
                                r.b("\n" + n);
                                r.b("                </div>");
                                r.b("\n" + n);
                                r.b('                <div class="line">此城市暂不支持接机服务</div>');
                                r.b("\n" + n);
                                r.b("            </div>");
                                r.b("\n")
                            }
                            r.b("        </div>");
                            r.b("\n")
                        }
                        );
                        e.pop()
                    }
                    r.b("\n" + n);
                    r.b('        <div class="s_phone fix hide js_service_phone">');
                    r.b("\n" + n);
                    r.b('            <h3 class="s_tip">订车电话<i class="l_star"></i></h3>');
                    r.b("\n" + n);
                    r.b('            <div class="s_op">');
                    r.b("\n" + n);
                    r.b('                    <span class="textbox_place">');
                    r.b("\n" + n);
                    r.b('                        <input data-jvalid-ruler="empty mobile" autocomplete="off" name="phone" type="text" class="input_phone js_car_phone">');
                    r.b("\n" + n);
                    r.b("    ");
                    r.b("\n" + n);
                    r.b("                    </span>");
                    r.b("\n" + n);
                    r.b('                <span class="p_text">用于接收车辆安排信息</span>');
                    r.b("\n" + n);
                    r.b("            </div>");
                    r.b("\n" + n);
                    r.b("        </div>");
                    r.b("\n" + n);
                    r.b("    ");
                    r.b("\n" + n);
                    r.b("    </div>");
                    r.b("\n")
                }
                );
                e.pop()
            }
            return r.fl();
        }
        );
        if (typeof t !== "undefined")
            t.exports = window.QTMPL["BookingChecheInfo"]
    }
    (t.exports, t, e);
    e.____MODULES["acd548c0a60f14b416c868146bd51323"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "fab6346e0a30b7bd4a9905677735bbf8",
        filename: "checheModel.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        var i = e.____MODULES["285adc5af3055e36addfeabe5289c690"];
        var s = e.____MODULES["312540359c661f626d6031b9f938e9a2"];
        var o = window.model;
        var u = s.create();
        u.fn.initialize = function(e) {
            if (!e.carSellResult || $.isEmptyObject(e.carSellResult)) {
                this._showCar = false;
                return
            }
            this._carPrice = null ;
            this._originData = e;
            this._carSellResult = e.carSellResult;
            this._dealData(e.flightInfo);
            this._cacheLocation = {}
        }
        ;
        u.fn.getCarSellResult = function() {
            return this._carSellResult
        }
        ;
        u.fn.isChecked = function() {
            var e = $(".js_service_chk");
            for (var t = 0; t < e.length; t++) {
                if ($(e[t]).is(":checked")) {
                    return true
                }
            }
            return false
        }
        ;
        u.fn.getBookingInfo = function() {
            var e = {};
            var t = this._carPrice;
            var n = [];
            var r = $("#module_car");
            var i, s;
            if (this.isChecked()) {
                e.orderPhone = Number(r.find(".js_car_phone").val());
                if (t.dropCarToken) {
                    s = "1:" + t.dropCarToken;
                    n.push(s)
                }
                if (t.pickCarToken) {
                    i = "2:" + t.pickCarToken;
                    n.push(i)
                }
                if (!n.length) {
                    return ""
                }
                e.carPriceInfo = n.join("#");
                return "&orderPhone=" + encodeURIComponent(e.orderPhone) + "&carOrderInfo=" + encodeURIComponent(e.carPriceInfo)
            }
            return ""
        }
        ;
        u.fn._dealData = function(e) {
            var t = this.getCarSellResult();
            var n = t.toAirPortInfo && t.toAirPortInfo.isSupported;
            var r = t.fromAirPortInfo && t.fromAirPortInfo.isSupported;
            var i = n || r;
            var s = t.toAirPortInfo.carList;
            var o = t.fromAirPortInfo.carList;
            this._showCar = i;
            t.support_car = i;
            t.toAirPortInfo.planeTime = e[0].dd;
            t.toAirPortInfo.airPortName = t.toAirPortInfo.terminalCode ? e[0].da + t.toAirPortInfo.terminalCode : e[0].da;
            t.toAirPortInfo.airportCode = e[0].de;
            t.fromAirPortInfo.airPortName = t.fromAirPortInfo.terminalCode ? e[0].aa + t.fromAirPortInfo.terminalCode : e[0].aa;
            t.fromAirPortInfo.airportCode = e[0].ae;
            t.fromAirPortInfo.planeTime = e[0].ad;
            t.fromAirPortInfo.dateList = e[0].ad;
            t.fromAirPortInfo.hourList = e[0].at.split(":")[0];
            t.fromAirPortInfo.minuteList = e[0].at.split(":")[1];
            this._fixCarTime("toAirPortInfo");
            if (s && s.length) {
                s[0].isChecked = true
            }
            if (o && o.length) {
                o[0].isChecked = true
            }
        }
        ;
        u.fn._fixCarTime = function(e) {
            var t = this.getCarSellResult();
            var n = e == "toAirPortInfo" ? 1 : 2;
            if (!t[e]["isSupported"]) {
                return
            }
            if (!t[e].timeLimit) {
                this._setDefault(e)
            }
            var r;
            var i = t[e].timeLimit;
            var s = {
                dateList: [],
                dateObj: {}
            };
            for (var o = 0; o < i.length; o++) {
                i[o].month = ("" + i[o].month).length == 2 ? i[o].month : "0" + i[o].month;
                i[o].day = ("" + i[o].day).length == 2 ? i[o].day : "0" + i[o].day;
                r = i[o].year + "-" + i[o].month + "-" + i[o].day;
                s.dateList.push(r);
                s.dateObj[r] = i[o].hourLimit
            }
            t[e].dateList = s.dateList;
            t[e].dateList.sort(function(e, t) {
                return Utils.toDateTime(t) - Utils.toDateTime(e)
            }
            );
            this["timeObj" + n] = s
        }
        ;
        u.fn._setDefault = function(e) {
            var t = this.getCarSellResult();
            var n = t[e].planeTime.split("-");
            t[e].timeLimit = [{
                year: n[0],
                month: n[1],
                day: n[2],
                hourLimit: [{
                    hour: 0,
                    minutes: [5, 10, 15]
                }, {
                    hour: 3,
                    minutes: [5, 10, 15]
                }, {
                    hour: 6,
                    minutes: [5, 10, 15]
                }, {
                    hour: 9,
                    minutes: [5, 10, 15]
                }, {
                    hour: 12,
                    minutes: [5, 10, 15]
                }, {
                    hour: 15,
                    minutes: [5, 10, 15]
                }, {
                    hour: 18,
                    minutes: [5, 10, 15]
                }, {
                    hour: 21,
                    minutes: [5, 10, 15]
                }]
            }]
        }
        ;
        u.fn.isShowCar = function() {
            return this._showCar
        }
        ;
        u.fn.getDefaultDate = function() {
            var e = [];
            var t = this.getCarSellResult();
            var n = this._originData;
            var r = n.flightInfo[0];
            var i = r.dd.replace(/-/g, "/");
            var s = r.dt;
            var o = new Date(i + " " + s);
            var u = t.toAirPortInfo;
            var a = u.timeLimit;
            var f, l, c, h, p;
            $.each(a, function(t, n) {
                f = n.year;
                l = n.month;
                c = n.day;
                $.each(n.hourLimit, function(t, n) {
                    h = n.hour;
                    $.each(n.minutes, function(t, n) {
                        p = n;
                        var r = new Date(f,parseInt(l) - 1,c,h,p);
                        if (o - r >= 2.5 * 60 * 60 * 1e3) {
                            e.push(r)
                        }
                    }
                    )
                }
                )
            }
            );
            e.sort(function(e, t) {
                var n = Math.abs(e - o);
                var r = Math.abs(t - o);
                return n < r
            }
            );
            return e[e.length - 1]
        }
        ;
        o.autoRun.push(function(e) {
            o.dataModel.checheModel = new u(e)
        }
        )
    }
    (t.exports, t, e);
    e.____MODULES["fab6346e0a30b7bd4a9905677735bbf8"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "2c80a8b282ec3272f2c05ce4cb5f5f39",
        filename: "Cheche.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        var i = e.____MODULES["285adc5af3055e36addfeabe5289c690"];
        var s = e.____MODULES["312540359c661f626d6031b9f938e9a2"];
        var o = s.create();
        o.fn.initialize = function(e) {
            var t = this.checheModel = e.checheModel;
            this._area = $("#module_car");
            if (!t.isShowCar() || !this._area) {
                return
            }
            this.contactorModel = e.contactorModel;
            this._originData = e.originData;
            this._data = t.getCarSellResult();
            var n = QTMPL.BookingChecheInfo.render(this._data);
            this._area.html(n);
            this._initSelector(1);
            this._bindEvent()
        }
        ;
        o.fn._channelBind = function() {
            var e = this;
            i.on("setmobile.cheche", function() {
                e.setMobile()
            }
            )
        }
        ;
        o.fn.setMobile = function() {
            this._autoFill()
        }
        ;
        o.fn._updatePrice = function() {
            var e = $(".js_drop_service");
            var t = $(".js_pick_service");
            var n = e.find(".js_car_price");
            var r = t.find(".js_car_price");
            var s = {
                dropCar: 0,
                pickCar: 0,
                total: 0,
                dropCarToken: null ,
                pickCarToken: null 
            };
            if (e.find(".js_service_chk").is(":checked")) {
                s.dropCar = Number(n.length && n.html()) || 0;
                s.dropCarToken = n.length && n.data("price-token") || null 
            }
            if (t.find(".js_service_chk").is(":checked")) {
                s.pickCar = Number(r.length && r.html()) || 0;
                s.pickCarToken = r.length && r.data("price-token") || null 
            }
            s.total = s.dropCar + s.pickCar;
            s.total = Number(s.total.toFixed(2));
            this.checheModel._carPrice = s;
            i.trigger("update.priceinfo", {
                carPrice: s.total
            })
        }
        ;
        o.fn._initSelector = function(e) {
            var t = e === 1 ? $(".js_drop_service") : $(".js_pick_service");
            var n = t.find(".input_place");
            var r = this;
            var i = r.checheModel;
            if (!t.find(".js_date_select").length) {
                return
            }
            var s = i.getDefaultDate();
            var o = s.getFullYear();
            var u = s.getMonth() + 1;
            var a = s.getDate();
            var f = s.getHours();
            var l = s.getMinutes();
            u = u < 10 ? "0" + u : u;
            a = a < 10 ? "0" + a : a;
            f = f < 10 ? "0" + f : f;
            l = l < 10 ? "0" + l : l;
            var c = [o, u, a].join("-");
            var h = function() {
                var e = 0;
                var t = r._data.toAirPortInfo.dateList;
                for (; e < t.length; e++) {
                    if (t[e] == c) {
                        return e
                    }
                }
            }
            ();
            t.find(".js_date_select").yselector({
                index: h,
                onchange: function(i) {
                    var s = i.index;
                    var o = i.text;
                    var u = r["checheModel"]["timeObj" + e]["dateObj"][o];
                    var a = [];
                    var c = [];
                    c.push('<select class="js_hour_select selectbox idtype hide" name="car_hour_', e, '" style="display: none;">');
                    for (var h = 0; h < u.length; h++) {
                        var p = u[h];
                        var d = p.hour == f ? " selected" : "";
                        p.hour = ("" + p.hour).length == 2 ? p.hour : "0" + p.hour;
                        c.push('<option value="', p.hour, '"', d, "> ", p.hour, "</option>");
                        a.push(u[h].hour)
                    }
                    c.push("</select>");
                    t.find(".js_car_hour").html(c.join(""));
                    t.find(".js_hour_select").yselector({
                        onchange: function(i) {
                            var s = i.index;
                            var o = u[s].minutes;
                            var a = [];
                            a.push('<select class="js_minute_select selectbox idtype hide" name="car_minute_', e, '" style="display: none;">');
                            for (var f = 0; f < o.length; f++) {
                                var c = o[f];
                                var h = c == l ? " selected" : "";
                                c = ("" + c).length == 2 ? c : "0" + c;
                                a.push('<option value="', c, '"', h, "> ", c, "</option>")
                            }
                            a.push("</select>");
                            t.find(".js_car_minute").html(a.join(""));
                            t.find(".js_minute_select").yselector({
                                onchange: function(e) {
                                    r._renderPrice(n)
                                }
                            })
                        }
                    })
                }
            })
        }
        ;
        o.fn._bindEvent = function(e) {
            var t = this;
            t._initSuggest();
            t._fixEnter();
            t._checkService();
            t._blurCheck();
            t._hoverEvent();
            t._clickEvent()
        }
        ;
        o.fn._clickEvent = function() {
            var e = this;
            this._area.delegate(".js_car_type", "click", function(t) {
                var n = $(this).closest(".js_car ");
                var r = $(this).closest(".js_service_area");
                var i = r.find(".input_place");
                r.find(".js_car").addClass("opacity_car");
                n.removeClass("opacity_car");
                setTimeout(function() {
                    e._renderPrice(i)
                }
                , 0)
            }
            );
            this._area.delegate(".s_car_label", "click", function(e) {
                e.preventDefault();
                var t = $(this).closest(".js_car ");
                t.find(".js_car_type").trigger("click")
            }
            )
        }
        ;
        o.fn._hoverEvent = function() {
            var e = this;
            this._area.delegate(".js_fuwu_info", "mouseover", function(t) {
                var n = this;
                if (!$(this).data("has-info")) {
                    $.ajax({
                        url: "/api/car/fuwuinfo",
                        data: {
                            fromAirportCode: e._data.fromAirPortInfo.airportCode,
                            toAirportCode: e._data.toAirPortInfo.airportCode
                        },
                        success: function(e) {
                            if (e && e.ret) {
                                var t = e.data && e.data.serviceIns.itemList;
                                var r = e.data && e.data.cancelIns.itemList;
                                var i = [];
                                i.push('<p class="bold_font">', e.data.serviceIns.title, "</p>");
                                for (var s = 0; s < t.length; s++) {
                                    i.push('<p><em class="bold_font">', s + 1, "、</em>", t[s], "</p>")
                                }
                                i.push('<p class="bold_font">', e.data.cancelIns.title, "</p>");
                                for (var s = 0; s < r.length; s++) {
                                    i.push('<p><em class="bold_font">', s + 1, "、</em>", r[s], "</p>")
                                }
                                $(".js_tips_content").html(i.join(""));
                                $(".js_fuwu_container").removeClass("hide");
                                $(n).data("has-info", true)
                            }
                        }
                    })
                } else {
                    $(".js_fuwu_container").removeClass("hide")
                }
            }
            ).delegate(".js_fuwu_info", "mouseout", function(e) {
                $(".js_fuwu_container").addClass("hide")
            }
            );
            var t;
            this._area.delegate(".js_little_tip", "mouseenter", function(e) {
                var n = this;
                t = setTimeout(function() {
                    if ($(n).find(".js_little_content").html() != "") {
                        $(n).find(".js_car_tips").removeClass("hide")
                    }
                }
                , 500)
            }
            ).delegate(".js_little_tip", "mouseleave", function(e) {
                var n = this;
                clearTimeout(t);
                if ($(n).is(":visible")) {
                    $(n).find(".js_car_tips").addClass("hide")
                }
            }
            )
        }
        ;
        o.fn._fixEnter = function() {
            this._area.delegate(".input_place", "keydown", function(e) {
                if (e.keyCode === 13) {
                    e.preventDefault()
                }
            }
            )
        }
        ;
        o.fn._initSuggest = function() {
            var e = this;
            var t = e.checheModel._cacheLocation;
            $inputArr = $(".input_place");
            for (var n = 0; n < $inputArr.length; n++) {
                var r = $($inputArr[n]);
                var i = r.data("airport-code");
                var s = r.closest(".js_address");
                (function(n, r) {
                    n.qsuggest({
                        ajax: {
                            url: "/api/car/addressSuggest?keywords=*&count=5&airportCode=" + i,
                            cache: false,
                            error: function() {
                                var e = r.find(".q-suggest");
                                var t = '<table cellspacing="0" cellpadding="2"><tbody><tr data-sug_type="1" data-ind="0"><td><span style="color: red">系统繁忙，请稍后再试</span></td></tr></tbody></table>';
                                e.html(t);
                                e.show()
                            },
                            timeout: 3e3
                        },
                        delay: 200,
                        on: {
                            "q-suggest-hide": function(t) {
                                var r = $(this);
                                var i = $.trim(r.val());
                                var s = r.data("suggest_list");
                                for (var o = 0; o < s.length; o++) {
                                    if ((s[o] && s[o].val) === "no_suggest") {
                                        break
                                    }
                                }
                                if (o == s.length) {
                                    e._renderPrice(n)
                                }
                            }
                        },
                        width: "305px",
                        container: r,
                        render: function(e) {
                            return e
                        },
                        reader: function(e) {
                            var r = [], i, s;
                            var o = n.data("service-type");
                            if (e && e.ret) {
                                i = e.data && e.data.addressList || [];
                                t[o] = i;
                                for (var u = 0, a = i.length; u < a; u += 1) {
                                    s = i[u];
                                    r.push({
                                        txt: '<p class="add_name">' + s.name + '</p><p class="add_detail">' + s.address + "</p>",
                                        val: s.name,
                                        type: 0
                                    })
                                }
                                if (r.length === 0)
                                    r.push({
                                        txt: '<span style="color: red">此地区暂不支持接送机</span>',
                                        val: "no_suggest",
                                        type: 1
                                    })
                            } else {
                                r.push({
                                    txt: '<span style="color: red">' + e.errMsg + "</span>",
                                    val: "no_suggest",
                                    type: 1
                                })
                            }
                            this.activeEl.data("suggest_list", r);
                            return r
                        }
                    })
                }
                )(r, s)
            }
        }
        ;
        o.fn._renderPrice = function(e) {
            var t = this;
            var n = e.closest(".js_service_area");
            var r = n.find(".js_price_info");
            var i = e.data("service-type");
            var s = t.checheModel._cacheLocation[i];
            if (!s) {
                return
            }
            var o = n.find("input[type='radio']:checked").val();
            var u;
            if (i == 2) {
                u = $(".js_pick_time").data("time")
            } else {
                var a = n.find(".js_date_select").data("YSELECTOR").val();
                var f = n.find(".js_hour_select").data("YSELECTOR").val();
                var l = n.find(".js_minute_select").data("YSELECTOR").val();
                u = a + " " + f + ":" + l + ":00"
            }
            var c = e.data("airport-code");
            var h = e.data("terminal-code");
            var p = $.trim(e.val());
            var d, v, m;
            for (var g = 0; g < s.length; g++) {
                if (p == s[g].name) {
                    d = s[g].address;
                    v = s[g].longitude;
                    m = s[g].latitude;
                    break
                }
            }
            var y = {
                serviceType: i,
                carTypeId: o,
                bookTime: u,
                airportCode: c,
                name: p,
                longitude: v,
                latitude: m,
                address: d
            };
            if (h) {
                y.terminalCode = h
            }
            $.ajax({
                url: "/api/car/priceQuery",
                data: y,
                success: function(n) {
                    if (n && n.ret) {
                        var o = n.data;
                        var u = [];
                        var a = o.salesPrice;
                        if (a.toString().indexOf(".") > -1) {
                            a = a.toFixed(2)
                        }
                        t._cachePrice = o;
                        u.push('<span class="service_price"><i class="rmb">&yen;</i><em class="pr js_car_price" >', a, "</em>/趟</span>");
                        u.push('<span class="service_text">(原价<i class="rmb">&yen;</i>', o.standPrice, "，约", o.distance, "公里/", o.timeLength, "分钟)</span>");
                        u = u.join("");
                        r.html(u);
                        r.find(".js_car_price").data("price-token", o.priceToken);
                        t._updatePrice()
                    } else {
                        r.html('<span style="color:red">*获取价格失败，请重新输入地址</span>');
                        s[i] = [];
                        t._updatePrice();
                        e.val("");
                        e.jvalid()
                    }
                },
                error: function() {
                    r.html('<span style="color:red">*获取价格失败，请重新输入地址</span>');
                    s[i] = {};
                    t._updatePrice();
                    e.val("");
                    e.jvalid()
                },
                timeout: 3e3
            })
        }
        ;
        o.fn._blurCheck = function() {
            var e = this;
            var t = e.checheModel._cacheLocation;
            this._area.delegate(".input_place", "blur.car", function() {
                var n = $(this);
                var r = $.trim(n.val());
                var i = n.closest(".js_service_area");
                var s = i.find(".js_price_info");
                var o = $(this).data("service-type");
                var u = n.data("suggest_list") || [];
                for (var a = 0; a < u.length; a++) {
                    if ((u[a] && u[a].val) === "no_suggest" || r == "") {
                        n.val("");
                        s.html("");
                        t[o] = [];
                        e._updatePrice();
                        break
                    }
                }
                n.jvalid()
            }
            )
        }
        ;
        o.fn._checkService = function() {
            var e = this;
            this._area.delegate(".js_service_chk", "click", function(t) {
                var n = $(t.target);
                var r = $(".js_drop_service").find(".js_service_area");
                var s = $(".js_pick_service").find(".js_service_area");
                var o = n.attr("id") === "drop_service" ? r : s;
                var u = UserStatus.getCookie("QunarGlobal");
                var a = $(".js_service_phone");
                var f = n.attr("id");
                if (n[0].checked) {
                    $(".js_log_open").remove();
                    o.removeClass("hide");
                    a.removeClass("hide")
                } else {
                    $(".js_log_close").remove();
                    o.addClass("hide")
                }
                i.trigger("monitor.behavior", ["cheche", {
                    type: f,
                    checked: n[0].checked,
                    QunarGlobal: u
                }]);
                if (!r.is(":visible") && !s.is(":visible") && a.is(":visible")) {
                    a.addClass("hide")
                }
                e._dispInstall();
                e._updatePrice();
                e._expressControl();
                i.trigger("updatehyinsuretipper.passengerinfo")
            }
            )
        }
        ;
        o.fn._dispInstall = function() {
            var e = this;
            if (e.checheModel.isChecked()) {
                i.trigger("hide.installment")
            } else {
                i.trigger("show.installment")
            }
        }
        ;
        o.fn._expressControl = function() {
            var e = $("#lvxingfapiao");
            var t = $("#lxInviocecontainer");
            var n = e.is(":checked");
            var r = t.is(":visible");
            var i = this.checheModel.isChecked();
            var s = this._originData.showFPOriginal;
            if (s) {
                return
            }
            if (i) {
                $(".js-xinchendan").length && $(".js-xinchendan").html("旅行产品发票");
                $(".js_car_rules").length && $(".js_car_rules").removeClass("hide");
                if (n && !r) {
                    t.removeClass("hide")
                }
            } else {
                $(".js-xinchendan").length && $(".js-xinchendan").html("行程单");
                $(".js_car_rules").length && $(".js_car_rules").addClass("hide");
                if (n && r) {
                    t.addClass("hide")
                }
            }
        }
        ;
        o.fn._autoFill = function(e) {
            if (!this._config)
                return;
            var t = $(".js_car_phone");
            var n = this.contactorModel.getContactInfo()["mobile"];
            var r = n.data("placeholder");
            if (n && n.val() != "" && n.val() != r) {
                t.val(n.val());
                t.jvalid()
            }
        }
        ;
        n.exports = o
    }
    (t.exports, t, e);
    e.____MODULES["2c80a8b282ec3272f2c05ce4cb5f5f39"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "f51a8ef6e7fe1912267410cabee51825",
        filename: "index.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        e.____MODULES["acd548c0a60f14b416c868146bd51323"];
        e.____MODULES["fab6346e0a30b7bd4a9905677735bbf8"];
        var i = e.____MODULES["2c80a8b282ec3272f2c05ce4cb5f5f39"];
        n.exports = i
    }
    (t.exports, t, e);
    e.____MODULES["f51a8ef6e7fe1912267410cabee51825"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "b65f2b9c54818a017af4d43ef5e08565",
        filename: "expressModel.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        var i = e.____MODULES["285adc5af3055e36addfeabe5289c690"];
        var s = e.____MODULES["312540359c661f626d6031b9f938e9a2"];
        var o = window.model;
        var u = s.create();
        u.fn.initialize = function(e) {
            var t = o.dataModel;
            this._data = e;
            this.agreementModel = t.agreementModel;
            this.checheModel = t.checheModel;
            this.CONTAINER_ID = "#reimbur_info";
            this.XINCHENDAN_ID = "xingchengdan";
            this.BAOXIAN_ID = "baoxianfapiao";
            this.XINCHENDAN_CONTAINER_ID = "#xingchengdan_container";
            this.KUAIDI_CONTAINER_ID = "#reim_expressinfo";
            this.SAVE_TO_ID = "save_express_to_user";
            this.NO_XCD_TIP = "#js-no_xcd_tip";
            this.LXINVOICE = "lvxingfapiao";
            this.LXINVOICE_CONTAINER = "#lxInviocecontainer";
            this.JCONTAINER = $(this.CONTAINER_ID)[0];
            this._dealData()
        }
        ;
        u.fn._dealData = function() {
            var e = this;
            var t = this.agreementModel.currentInsure()
              , n = this.checheModel
              , r = this._data.expressInfo
              , i = this._data.venderInfo.enablePost
              , s = this._data.policyInfo.itp
              , o = this.agreementModel.hasIq()
              , u = this._data.expressInfo.isFree;
            var a = r.tip;
            var f = e._data.priceInfo.isOta;
            var l, c;
            var h = "代理商不提供行程单。";
            if (f) {
                h = null 
            }
            if (s === 1) {
                l = "行程单";
                c = "仅作为报销凭证，起飞后超过7天不可打印行程单";
                h = null 
            } else if (s === 2 || s === 0 && !window.is9C) {
                l = "发票";
                c = "仅作为报销凭证";
                h = s === 2 ? "代理商提供部分额度行程单，差额部分开具发票。" : "无行程单，可提供等额发票作为报销凭证";
                if (r.isLXInvoice) {
                    h = null 
                }
            } else if (s === 0 && window.is9C) {
                h = null 
            }
            var p = e._data.extInfo.flight_type || 1;
            if (p != 1) {
                h = null 
            }
            var d = {
                ipost: i,
                iq: o,
                itp: s,
                xcdTxt: l,
                xcdTips: c,
                xcdMsg: h,
                expressTip: a,
                xingchengdan: e.XINCHENDAN_ID,
                baoxianfapiao: e.BAOXIAN_ID,
                is9cAndNoXCD: window.is9C && !s,
                is9C: window.is9C,
                isfree: u
            };
            if (!i) {
                d.selftoken = r.zq;
                d.delivery = r.kd;
                d.expressMail = r.kddf
            } else {
                if (t) {
                    d.name = t.name;
                    d.nurl = t.nurl;
                    d.url = t.url
                }
            }
            d.phone = this._data.venderInfo.phone;
            d.time = this._data.venderInfo.time;
            if (r.isLXInvoice) {
                d.showInvoice = r.isLXInvoice;
                d.lvxingfapiao = e.LXINVOICE;
                d.invoiceName = [];
                d.invoiceTitle = [];
                d.selftoken = null ;
                d.expressMail = null ;
                d.showCar = n.isShowCar();
                d.forceFapiao = e._data.showFPOriginal;
                $.each(r.lxInvoice.invoiceType, function(e, t) {
                    var n = e == "0" ? t : false;
                    d.invoiceName.push({
                        key: e,
                        value: t
                    })
                }
                );
                $.each(r.lxInvoice.receiverType, function(e, t) {
                    d.invoiceTitle.push({
                        key: e,
                        value: t
                    })
                }
                );
                d.invoiceName.sort(function(e, t) {
                    if (e.key == r.lxInvoice.di) {
                        return -1
                    } else {
                        return 1
                    }
                }
                );
                d.invoiceTitle.sort(function(e, t) {
                    if (e.key == r.lxInvoice.dr) {
                        return -1
                    } else {
                        return 1
                    }
                }
                )
            }
            var v = window.location.host;
            d.isCapitalAir = v.indexOf("capitalair.qunar.com") > -1;
            $.extend(this, d)
        }
        ;
        u.fn.checkedXCD = function() {
            return $(this.XINCHENDAN_CONTAINER_ID).is(":visible")
        }
        ;
        u.fn._get = function(e) {
            var t = this;
            return $.trim(e.data("YSELECTOR").val()) ? e.data("YSELECTOR").text() : ""
        }
        ;
        u.fn.getPnrInfo = function() {
            var e = [];
            var t = this;
            var n = encodeURIComponent;
            var r = $("#" + t.BAOXIAN_ID);
            var i = r.is(":checked") && !r.is(":disabled");
            var s = $("#" + t.LXINVOICE).is(":checked");
            var o = $(t.LXINVOICE_CONTAINER);
            var u = "";
            var a = $("[name=receiver]", t.JCONTAINER);
            var f = $("[name=receiver_phone]", t.JCONTAINER);
            var l = $("[name=schedule_province]", t.JCONTAINER);
            var c = $("[name=schedule_city]", t.JCONTAINER);
            var h = $("[name=schedule_county]", t.JCONTAINER);
            var p = $("[name=receiver_address]", t.JCONTAINER);
            var d = $("#js_receiverTitle");
            var v = $("[name=receiverTitle]", t.JCONTAINER);
            var m = $("[name=invoiceType]", t.JCONTAINER);
            var g = $("[name=receiverType]", t.JCONTAINER);
            if (!$("#" + t.SAVE_TO_ID).length) {
                e.push("xcd=");
                e.push("bxInvoice=");
                e.push("xcdPrice=0");
                e.push("xcdMethod=");
                e.push("sjr=");
                e.push("phone=");
                e.push("address=")
            } else {
                e.push("xcdType=" + this._data.policyInfo.itp);
                e.push("bxInvoice=" + (i ? "1" : ""));
                e.push("xcdPrice=" + t.price);
                e.push("xcdMethod=" + t.priceId);
                e.push("sjr=" + n(a.val() === a.data("placeholder") ? "" : a.val()));
                e.push("phone=" + (f.val() === f.data("placeholder") ? "" : f.val()));
                var y = p.val() === p.data("placeholder") ? "" : p.val();
                e.push("address=" + n(t._get(l) + " " + t._get(c) + " " + t._get(h) + " " + y))
            }
            if (s) {
                e.push("xcd=1");
                if (o.is(":visible")) {
                    e.push("invoiceType=" + m.data("YSELECTOR").val());
                    e.push("receiverType=" + g.data("YSELECTOR").val());
                    e.push("receiverTitle=" + n($.trim(v.val())))
                }
            } else {
                e.push("xcd=" + ($("#" + t.XINCHENDAN_ID).is(":checked") ? "1" : ""))
            }
            return e.join("&")
        }
        ;
        u.fn.bookingCheck = function() {
            var e = this;
            var t = true;
            var n = ["province", "city"];
            $.each(n, function(n, r) {
                $domCl = $("[name=schedule_" + r + "]", e.JCONTAINER);
                if ($(e.KUAIDI_CONTAINER_ID).is(":visible") && e._get($domCl) === "") {
                    t = false
                }
            }
            );
            return t
        }
        ;
        u.fn.getContactInfo = function() {
            if (!$("#" + this.SAVE_TO_ID).is(":visible") || !$("#" + this.SAVE_TO_ID).is(":checked")) {
                return {}
            }
            var e = this;
            var t = $("[name=express_id]", e.JCONTAINER);
            var n = $("[name=receiver]", e.JCONTAINER);
            var r = $("[name=receiver_phone]", e.JCONTAINER);
            var i = $("[name=schedule_id]", e.JCONTAINER);
            var s = $("[name=schedule_province]", e.JCONTAINER);
            var o = $("[name=schedule_city]", e.JCONTAINER);
            var u = $("[name=schedule_county]", e.JCONTAINER);
            var a = $("[name=receiver_address]", e.JCONTAINER);
            var f = $("[name=receiverTitle]", e.JCONTAINER);
            var l = $("[name=invoiceType]", e.JCONTAINER);
            var c = $("[name=receiverType]", e.JCONTAINER);
            var h = f.val();
            var p = c.data("YSELECTOR").text();
            if (f[0] && f[0].isPlaceHolderEmpty && f[0].isPlaceHolderEmpty()) {
                h = ""
            }
            var d = l.val();
            var v;
            if (d == 2) {
                v = 5
            } else if (d == 1) {
                v = 4
            }
            var m = {
                id: t.val(),
                usersource: "flight",
                name: n.val(),
                mobile: r.val(),
                addresses: [{
                    id: i.val(),
                    contactId: t.val(),
                    province: s.data("YSELECTOR").val(),
                    city: o.data("YSELECTOR").val(),
                    district: u.data("YSELECTOR").val(),
                    detail: a.val()
                }],
                invoices: [{
                    contactId: t.val(),
                    invoiceTitle: $.trim(h),
                    invoiceType: v
                }]
            };
            if (p == "个人") {
                m.invoices[0].invoiceTitle = "个人"
            }
            return m
        }
        ;
        o.autoRun.push(function(e) {
            o.dataModel.expressModel = new u(e)
        }
        )
    }
    (t.exports, t, e);
    e.____MODULES["b65f2b9c54818a017af4d43ef5e08565"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "51e29bbefde42914b2669949ec76d133",
        filename: "BookingExpressItem.mustache",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(e, t, n) {
        if (typeof window.QTMPL === "undefined")
            window.QTMPL = {};
        window.QTMPL["BookingExpressItem"] = new window.Hogan.Template(function(e, t, n) {
            var r = this;
            r.b(n = n || "");
            r.b('<div class="title_main">报销信息</div>');
            r.b("\n" + n);
            if (r.s(r.f("ipost", e, t, 1), e, t, 0, 45, 584, "{{ }}")) {
                r.rs(e, t, function(e, t, r) {
                    r.b('<div class="breim_info clr_after">');
                    r.b("\n" + n);
                    if (r.s(r.f("itp", e, t, 1), e, t, 0, 91, 284, "{{ }}")) {
                        r.rs(e, t, function(e, t, r) {
                            r.b('  <div id="airlineComXcd"');
                            if (r.s(r.f("iq", e, t, 1), e, t, 0, 124, 141, "{{ }}")) {
                                r.rs(e, t, function(e, t, n) {
                                    n.b(' class="mod_left"')
                                }
                                );
                                e.pop()
                            }
                            r.b(">");
                            r.b("\n" + n);
                            r.b("    <h5>如何获取行程单？</h5>");
                            r.b("\n" + n);
                            r.b("    <p>");
                            r.b("\n" + n);
                            r.b("      请您在航班起飞的7日内，拨打航空公司客服电话：");
                            r.b(r.v(r.f("phone", e, t, 0)));
                            r.b("索取（服务时间：");
                            r.b(r.v(r.f("time", e, t, 0)));
                            r.b("）行程单报销凭证，或持有效证件至机场航空公司售票柜台打印。");
                            r.b("\n" + n);
                            r.b("    </p>");
                            r.b("\n" + n);
                            r.b("  </div>");
                            r.b("\n")
                        }
                        );
                        e.pop()
                    }
                    if (r.s(r.f("iq", e, t, 1), e, t, 0, 302, 569, "{{ }}")) {
                        r.rs(e, t, function(e, t, r) {
                            r.b('  <div id="airlineComBd"');
                            if (r.s(r.f("itp", e, t, 1), e, t, 0, 335, 353, "{{ }}")) {
                                r.rs(e, t, function(e, t, n) {
                                    n.b(' class="mod_right"')
                                }
                                );
                                e.pop()
                            }
                            r.b(">");
                            r.b("\n" + n);
                            r.b("    <h5>保险发票如何获得？</h5>");
                            r.b("\n" + n);
                            r.b("    <p>");
                            r.b("\n" + n);
                            r.b("      您可按需选择是否购买保险，保险由");
                            r.b(r.v(r.f("name", e, t, 0)));
                            r.b('提供。如您需要保险单，请联系保险公司客服索要保单。详细保险说明：<a href="');
                            r.b(r.v(r.f("nurl", e, t, 0)));
                            r.b('" target="_blank">《保险说明》</a> 、<a href="');
                            r.b(r.v(r.f("url", e, t, 0)));
                            r.b('" target="_blank">《保险条款》 </a>');
                            r.b("\n" + n);
                            r.b("    </p>");
                            r.b("\n" + n);
                            r.b("  </div>");
                            r.b("\n")
                        }
                        );
                        e.pop()
                    }
                    r.b("</div>");
                    r.b("\n")
                }
                );
                e.pop()
            }
            if (!r.s(r.f("ipost", e, t, 1), e, t, 1, 0, 0, "")) {
                r.b('<div class="inner">');
                r.b("\n" + n);
                r.b('  <ul class="rembur_tab">');
                r.b("\n" + n);
                if (!r.s(r.f("showInvoice", e, t, 1), e, t, 1, 0, 0, "")) {
                    r.b("\n" + n);
                    if (!r.s(r.f("isCapitalAir", e, t, 1), e, t, 1, 0, 0, "")) {
                        r.b("      <li");
                        if (r.s(r.f("is9cAndNoXCD", e, t, 1), e, t, 0, 724, 737, "{{ }}")) {
                            r.rs(e, t, function(e, t, n) {
                                n.b(' class="hide"')
                            }
                            );
                            e.pop()
                        }
                        r.b(">");
                        r.b("\n" + n);
                        r.b('          <input type="checkbox" class="checkbox" id="');
                        r.b(r.v(r.f("xingchengdan", e, t, 0)));
                        r.b('">');
                        r.b("\n" + n);
                        r.b('          <label for="');
                        r.b(r.v(r.f("xingchengdan", e, t, 0)));
                        r.b('">');
                        r.b(r.v(r.f("xcdTxt", e, t, 0)));
                        r.b('</label><span class="n grey">(');
                        r.b(r.v(r.f("xcdTips", e, t, 0)));
                        r.b(")</span>");
                        r.b("\n" + n);
                        r.b("      </li>");
                        r.b("\n" + n);
                        if (r.s(r.f("is9cAndNoXCD", e, t, 1), e, t, 0, 964, 1026, "{{ }}")) {
                            r.rs(e, t, function(e, t, n) {
                                n.b("        <li>本产品无法邮寄行程单，如有疑问请在下单前咨询客服电话（");
                                n.b(n.v(n.f("phone", e, t, 0)));
                                n.b("）</li>");
                                n.b("\n")
                            }
                            );
                            e.pop()
                        }
                        r.b("\n")
                    }
                    r.b("      ");
                    r.b("\n" + n);
                    r.b("      <li");
                    if (!r.s(r.f("iq", e, t, 1), e, t, 1, 0, 0, "")) {
                        r.b(' class="hide"')
                    }
                    r.b(">");
                    r.b("\n" + n);
                    r.b('        <input type="checkbox" id="');
                    r.b(r.v(r.f("baoxianfapiao", e, t, 0)));
                    r.b('" class="checkbox">');
                    r.b("\n" + n);
                    r.b('        <label for="');
                    r.b(r.v(r.f("baoxianfapiao", e, t, 0)));
                    r.b('">保险发票</label><span class="n grey">(仅作为通过去哪儿网购买保险的报销凭证)</span>');
                    r.b("\n" + n);
                    r.b("        ");
                    if (r.s(r.f("isCapitalAir", e, t, 1), e, t, 0, 1311, 1379, "{{ }}")) {
                        r.rs(e, t, function(e, t, n) {
                            n.b('<span class="l-s"></span>暂不提供行程单邮寄。如您需要行程单，请在乘机7日内，前往机场柜台或航空公司售票处索取。')
                        }
                        );
                        e.pop()
                    }
                    r.b("\n" + n);
                    r.b("      </li>");
                    r.b("\n")
                }
                if (r.s(r.f("showInvoice", e, t, 1), e, t, 0, 1450, 2652, "{{ }}")) {
                    r.rs(e, t, function(e, t, r) {
                        if (!r.s(r.f("is9C", e, t, 1), e, t, 1, 0, 0, "")) {
                            r.b("      <li>");
                            r.b("\n" + n);
                            r.b('        <input type="checkbox" id="');
                            r.b(r.v(r.f("lvxingfapiao", e, t, 0)));
                            r.b('" class="checkbox">');
                            r.b("\n" + n);
                            r.b('      <label for="');
                            r.b(r.v(r.f("lvxingfapiao", e, t, 0)));
                            r.b('">需要报销凭证');
                            if (!r.s(r.f("showCar", e, t, 1), e, t, 1, 0, 0, "")) {
                                r.b('（含：旅行产品发票、<span id="lxfp">保险发票、</span>快递费发票）')
                            }
                            r.b("\n" + n);
                            r.b("          ");
                            if (r.s(r.f("showCar", e, t, 1), e, t, 0, 1680, 1826, "{{ }}")) {
                                r.rs(e, t, function(e, t, n) {
                                    n.b("（含");
                                    if (n.s(n.f("forceFapiao", e, t, 1), e, t, 0, 1698, 1705, "{{ }}")) {
                                        n.rs(e, t, function(e, t, n) {
                                            n.b("旅行产品发票、")
                                        }
                                        );
                                        e.pop()
                                    }
                                    if (!n.s(n.f("forceFapiao", e, t, 1), e, t, 1, 0, 0, "")) {
                                        n.b('<span class="js-xinchendan">行程单</span>、')
                                    }
                                    n.b('<span id="lxfp">保险发票、</span>快递费发票）')
                                }
                                );
                                e.pop()
                            }
                            r.b(" </label>");
                            r.b("\n" + n);
                            r.b("      </li>");
                            r.b("\n")
                        }
                        if (r.s(r.f("is9C", e, t, 1), e, t, 0, 2043, 2638, "{{ }}")) {
                            r.rs(e, t, function(e, t, r) {
                                r.b("        <li");
                                if (r.s(r.f("is9cAndNoXCD", e, t, 1), e, t, 0, 2072, 2085, "{{ }}")) {
                                    r.rs(e, t, function(e, t, n) {
                                        n.b(' class="hide"')
                                    }
                                    );
                                    e.pop()
                                }
                                r.b(">");
                                r.b("\n" + n);
                                r.b('            <input type="checkbox" class="checkbox" id="');
                                r.b(r.v(r.f("xingchengdan", e, t, 0)));
                                r.b('">');
                                r.b("\n" + n);
                                r.b('            <label for="');
                                r.b(r.v(r.f("xingchengdan", e, t, 0)));
                                r.b('">');
                                r.b(r.v(r.f("xcdTxt", e, t, 0)));
                                r.b('</label><span class="n grey">(');
                                r.b(r.v(r.f("xcdTips", e, t, 0)));
                                r.b(")</span>");
                                r.b("\n" + n);
                                r.b("        </li>");
                                r.b("\n" + n);
                                if (r.s(r.f("is9cAndNoXCD", e, t, 1), e, t, 0, 2320, 2386, "{{ }}")) {
                                    r.rs(e, t, function(e, t, n) {
                                        n.b("          <li>本产品无法邮寄行程单，如有疑问请在下单前咨询客服电话（");
                                        n.b(n.v(n.f("phone", e, t, 0)));
                                        n.b("）</li>");
                                        n.b("\n")
                                    }
                                    );
                                    e.pop()
                                }
                                r.b("        <li");
                                if (!r.s(r.f("iq", e, t, 1), e, t, 1, 0, 0, "")) {
                                    r.b(' class="hide"')
                                }
                                r.b(">");
                                r.b("\n" + n);
                                r.b('          <input type="checkbox" id="');
                                r.b(r.v(r.f("baoxianfapiao", e, t, 0)));
                                r.b('" class="checkbox">');
                                r.b("\n" + n);
                                r.b('          <label for="');
                                r.b(r.v(r.f("baoxianfapiao", e, t, 0)));
                                r.b('">保险发票</label><span class="n grey">(仅作为通过去哪儿网购买保险的报销凭证)</span>');
                                r.b("\n" + n);
                                r.b("        </li>");
                                r.b("\n")
                            }
                            );
                            e.pop()
                        }
                    }
                    );
                    e.pop()
                }
                r.b("  </ul>");
                r.b("\n" + n);
                if (r.s(r.f("xcdMsg", e, t, 1), e, t, 0, 2690, 2887, "{{ }}")) {
                    r.rs(e, t, function(e, t, r) {
                        r.b('  <div class="fix">');
                        r.b("\n" + n);
                        r.b('      <div class="module_tipbg mdl_tip_inline">');
                        r.b("\n" + n);
                        r.b('          <div class="wrinner">');
                        r.b("\n" + n);
                        r.b('              <p class="waring_text fb">');
                        r.b(r.v(r.f("xcdMsg", e, t, 0)));
                        r.b("</p>");
                        r.b("\n" + n);
                        r.b("          </div>");
                        r.b("\n" + n);
                        r.b("      </div>");
                        r.b("\n" + n);
                        r.b("  </div>");
                        r.b("\n")
                    }
                    );
                    e.pop()
                }
                r.b("  ");
                r.b("\n" + n);
                r.b('  <div id="xingchengdan_container" class="rembur_tabct hide">');
                r.b("\n" + n);
                if (r.s(r.f("showInvoice", e, t, 1), e, t, 0, 2984, 3147, "{{ }}")) {
                    r.rs(e, t, function(e, t, r) {
                        r.b('      <div class="module_tipbg module_tipbg_invoice">');
                        r.b("\n" + n);
                        r.b('        <div class="wrinner">');
                        r.b("\n" + n);
                        r.b("            <p>您所选购的产品由旅行社提供，仅提供旅行发票做为报销凭证。</p>");
                        r.b("\n" + n);
                        r.b("        </div>");
                        r.b("\n" + n);
                        r.b("    </div>");
                        r.b("\n")
                    }
                    );
                    e.pop()
                }
                r.b('    <dl class="dl_dlv_tab fix">');
                r.b("\n" + n);
                r.b("        <dt>递送方式：</dt>");
                r.b("\n" + n);
                r.b("        <dd>");
                r.b("\n" + n);
                if (r.s(r.f("delivery", e, t, 1), e, t, 0, 3257, 3597, "{{ }}")) {
                    r.rs(e, t, function(e, t, r) {
                        r.b('            <div class="m_dlvlst">');
                        r.b("\n" + n);
                        r.b('              <input type="radio" name="delivery_type" class="checkbox checkbox2" id="delivery">');
                        r.b("\n" + n);
                        r.b('              <label for="delivery">快递</label>');
                        r.b("\n" + n);
                        r.b('              <span class="grey">');
                        if (r.s(r.f("expressTip", e, t, 1), e, t, 0, 3485, 3543, "{{ }}")) {
                            r.rs(e, t, function(e, t, r) {
                                r.b('（<span class="f_red">');
                                r.b(r.v(r.f("expressTip", e, t, 0)));
                                r.b("\n" + n);
                                r.b("              </span>）")
                            }
                            );
                            e.pop()
                        }
                        r.b("</span>");
                        r.b("\n" + n);
                        r.b("            </div>");
                        r.b("\n")
                    }
                    );
                    e.pop()
                }
                if (r.s(r.f("selftoken", e, t, 1), e, t, 0, 3637, 3932, "{{ }}")) {
                    r.rs(e, t, function(e, t, r) {
                        r.b('            <div class="m_dlvlst">');
                        r.b("\n" + n);
                        r.b('              <input type="radio" name="delivery_type" class="checkbox checkbox2" id="selftoken">');
                        r.b("\n" + n);
                        r.b('              <label for="selftoken">自取</label>');
                        r.b("\n" + n);
                        r.b('              <span class="grey">（您可以在航班起飞后7天内联系代理商自取报销凭证，详情请咨询：');
                        r.b(r.v(r.f("phone", e, t, 0)));
                        r.b("）</span>");
                        r.b("\n" + n);
                        r.b("            </div>");
                        r.b("\n")
                    }
                    );
                    e.pop()
                }
                if (r.s(r.f("expressMail", e, t, 1), e, t, 0, 3975, 4235, "{{ }}")) {
                    r.rs(e, t, function(e, t, r) {
                        r.b('            <div class="m_dlvlst">');
                        r.b("\n" + n);
                        r.b('              <input type="radio" name="delivery_type" class="checkbox checkbox2" id="expressMail">');
                        r.b("\n" + n);
                        r.b('              <label for="expressMail">快递到付</label>');
                        r.b("\n" + n);
                        r.b('              <span class="grey"></span>');
                        r.b("\n" + n);
                        r.b("            </div>");
                        r.b("\n")
                    }
                    );
                    e.pop()
                }
                r.b("        </dd>");
                r.b("\n" + n);
                r.b("    </dl>");
                r.b("\n" + n);
                r.b('    <div class="delivery_main"  id="reim_expressinfo">');
                r.b("\n" + n);
                r.b("      <!--已经登录，并且已经有常用联系人star-->");
                r.b("\n" + n);
                r.b('      <div class="rembur_conact hide" id="rembur_conact"></div>');
                r.b("\n" + n);
                r.b("      <!--已经登录，并且已经有常用联系人end-->");
                r.b("\n" + n);
                r.b('      <ul class="reim_cotacinfo">');
                r.b("\n" + n);
                r.b("          <li>");
                r.b("\n" + n);
                r.b('              <div class="ctre_name">收件人<em class="req"></em></div>');
                r.b("\n" + n);
                r.b('              <input type="hidden" value="" name="express_id"/>');
                r.b("\n" + n);
                r.b('              <div class="ctre_inpt">');
                r.b("\n" + n);
                r.b('                <label style="display:inline-block;">');
                r.b("\n" + n);
                r.b('                  <span class="textbox_b">');
                r.b("\n" + n);
                r.b('                    <input autocomplete="off" data-placeholder="中文/英文" type="text" maxlength="50" data-jvalid-ruler="empty length20" name="receiver" class="input_re1" />');
                r.b("\n" + n);
                r.b("                  </span>");
                r.b("\n" + n);
                r.b("                </label>");
                r.b("\n" + n);
                r.b("\n" + n);
                r.b("\n" + n);
                r.b('                <input type="checkbox" class="checkbox ml20 ');
                if (!r.s(r.f("isLogin", e, t, 1), e, t, 1, 0, 0, "")) {
                    r.b(" hide")
                }
                r.b('" ');
                if (r.s(r.f("isLogin", e, t, 1), e, t, 0, 5239, 5257, "{{ }}")) {
                    r.rs(e, t, function(e, t, n) {
                        n.b(' checked="checked"')
                    }
                    );
                    e.pop()
                }
                r.b(' id="save_express_to_user">');
                r.b("\n" + n);
                r.b("                <label ");
                if (!r.s(r.f("isLogin", e, t, 1), e, t, 1, 0, 0, "")) {
                    r.b('class="hide"')
                }
                r.b(' for="save_express_to_user">保存至常用联系人</label>');
                r.b("\n" + n);
                r.b("              </div>");
                r.b("\n" + n);
                r.b("          </li>");
                r.b("\n" + n);
                r.b("          <li>");
                r.b("\n" + n);
                r.b('              <div class="ctre_name">手<cite>机</cite><em class="req">');
                r.b("</em></div>");
                r.b("\n" + n);
                r.b('              <div class="ctre_inpt">');
                r.b("\n" + n);
                r.b('                <label class="e_label">');
                r.b("\n" + n);
                r.b('                  <span class="textbox_b">');
                r.b("\n" + n);
                r.b('                    <input autocomplete="off" data-placeholder="收件人手机号码" data-jvalid-ruler="empty mobile" type="text" maxlength="11" name="receiver_phone" class="input_re1" />');
                r.b("\n" + n);
                r.b("                  </span>");
                r.b("\n" + n);
                r.b("                </label>");
                r.b("\n" + n);
                r.b("              </div>");
                r.b("\n" + n);
                r.b("          </li>");
                r.b("\n" + n);
                r.b("          <li>");
                r.b("\n" + n);
                r.b('              <div class="ctre_name">地<cite>址</cite><em class="req">');
                r.b("</em></div>");
                r.b("\n" + n);
                r.b('              <div class="ctre_inpt">');
                r.b("\n" + n);
                r.b('                  <div id="existing_addressinfo">');
                r.b("\n" + n);
                r.b("                  </div>");
                r.b("\n" + n);
                r.b('                   <div class="fix">');
                r.b("\n" + n);
                r.b('                      <input type="hidden" name="schedule_id" value="" />');
                r.b("\n" + n);
                r.b('                      <div class="csparest wt_provice mr8">');
                r.b("\n" + n);
                r.b('                          <select class="selectbox idtype hide" name="schedule_province"></select>');
                r.b("\n" + n);
                r.b("                      </div>");
                r.b("\n" + n);
                r.b('                      <div class="csparest wt_provice mr8">');
                r.b("\n" + n);
                r.b('                          <select class="selectbox idtype hide" name="schedule_city"></select>');
                r.b("\n" + n);
                r.b("                      </div>");
                r.b("\n" + n);
                r.b('                      <div class="csparest wt_provice">');
                r.b("\n" + n);
                r.b('                          <select class="selectbox idtype hide" name="schedule_county"></select>');
                r.b("\n" + n);
                r.b("                      </div>");
                r.b("\n" + n);
                r.b('                      <p class="adres_ipt">');
                r.b("\n" + n);
                r.b('                        <label class="e_label">');
                r.b("\n" + n);
                r.b('                          <span class="textbox_b"><input data-jvalid-ruler="empty address_length" autocomplete="off" type="text" data-placeholder="请填写详细地址，不需要重复填写省市区/县" name="receiver_address" maxlength="100" class="input_adres" /></span>');
                r.b("\n" + n);
                r.b("                        </label>");
                r.b("\n" + n);
                r.b("                      </p>");
                r.b("\n" + n);
                r.b("              </div>");
                r.b("\n" + n);
                r.b("          </li>");
                r.b("\n" + n);
                r.b("          <li>");
                r.b("\n" + n);
                if (r.s(r.f("showInvoice", e, t, 1), e, t, 0, 7532, 9140, "{{ }}")) {
                    r.rs(e, t, function(e, t, r) {
                        r.b('              <ul class="reim_cotacinfo reim_cotacinfo_fp hide" id="lxInviocecontainer">');
                        r.b("\n" + n);
                        r.b("                <li>");
                        r.b("\n" + n);
                        r.b('                    <div class="ctre_name">发票类型<em class="req"></em></div>');
                        r.b("\n" + n);
                        r.b('                    <div class="ctre_inpt">');
                        r.b("\n" + n);
                        r.b('                        <div class="csparest wt_lxfp mr8">');
                        r.b("\n" + n);
                        r.b('                            <select name="invoiceType" class="selectbox hide">');
                        r.b("\n" + n);
                        if (r.s(r.f("invoiceName", e, t, 1), e, t, 0, 7948, 8056, "{{ }}")) {
                            r.rs(e, t, function(e, t, n) {
                                n.b('                                <option value="');
                                n.b(n.v(n.f("key", e, t, 0)));
                                n.b('">');
                                n.b(n.v(n.f("value", e, t, 0)));
                                n.b("</option>");
                                n.b("\n")
                            }
                            );
                            e.pop()
                        }
                        r.b("                            </select>");
                        r.b("\n" + n);
                        r.b("                        </div>");
                        r.b("\n" + n);
                        r.b("                    </div>");
                        r.b("\n" + n);
                        r.b("                </li>");
                        r.b("\n" + n);
                        r.b("                <li>");
                        r.b("\n" + n);
                        r.b('                    <div class="ctre_name">发票抬头<em class="req"></em></div>');
                        r.b("\n" + n);
                        r.b('                    <div class="ctre_inpt">');
                        r.b("\n" + n);
                        r.b('                        <div class="csparest wt_lxfp mr8">');
                        r.b("\n" + n);
                        r.b('                            <select name="receiverType" class="selectbox hide">');
                        r.b("\n" + n);
                        if (r.s(r.f("invoiceTitle", e, t, 1), e, t, 0, 8519, 8627, "{{ }}")) {
                            r.rs(e, t, function(e, t, n) {
                                n.b('                                <option value="');
                                n.b(n.v(n.f("key", e, t, 0)));
                                n.b('">');
                                n.b(n.v(n.f("value", e, t, 0)));
                                n.b("</option>");
                                n.b("\n")
                            }
                            );
                            e.pop()
                        }
                        r.b("                            </select>");
                        r.b("\n" + n);
                        r.b("                        </div>");
                        r.b("\n" + n);
                        r.b('                        <label class="e_label" id="js_receiverTitle"> ');
                        r.b("\n" + n);
                        r.b('                        <span class="textbox_b">');
                        r.b("\n" + n);
                        r.b('                        <input type="text" data-jvalid-ruler="empty title_length" autocomplete="off" data-placeholder="请填写单位名称" name="receiverTitle" maxlength="100" class="input_adres">');
                        r.b("\n" + n);
                        r.b("                        </span> </label>");
                        r.b("\n" + n);
                        r.b("                    </div>");
                        r.b("\n" + n);
                        r.b("                </li>");
                        r.b("\n" + n);
                        r.b("            </ul>");
                        r.b("\n")
                    }
                    );
                    e.pop()
                }
                r.b("          </li>");
                r.b("\n" + n);
                r.b("          <li>");
                r.b("\n" + n);
                r.b('              <div class="ctre_name">快递费：</div>');
                r.b("\n" + n);
                r.b('              <div class="ctre_inpt">');
                r.b("\n" + n);
                r.b('                <em id="delivery_price">&yen;</em>');
                r.b("\n" + n);
                if (r.s(r.f("isfree", e, t, 1), e, t, 0, 9352, 9707, "{{ }}")) {
                    r.rs(e, t, function(e, t, r) {
                        r.b('                <a class="v-pr-baoyou hide" id="js_label_baoyou">');
                        r.b("\n" + n);
                        r.b('                  <div class="v-tag-baoyou"><span></span></div>');
                        r.b("\n" + n);
                        r.b("                </a>");
                        r.b("\n" + n);
                        r.b('                <div class="p-tips-baoyou  js_panel_baoyou hide">');
                        r.b("\n" + n);
                        r.b('                  <div class="p-tips-wrap">');
                        r.b("\n" + n);
                        r.b("                    报销凭证免费快递");
                        r.b("\n" + n);
                        r.b("                  </div>");
                        r.b("\n" + n);
                        r.b("                </div>");
                        r.b("\n")
                    }
                    );
                    e.pop()
                }
                r.b("              </div>");
                r.b("\n" + n);
                r.b("          </li>");
                r.b("\n" + n);
                r.b("      </ul>");
                r.b("\n" + n);
                r.b("     </div>");
                r.b("\n" + n);
                r.b("  </div>");
                r.b("\n" + n);
                r.b("</div>");
                r.b("\n")
            }
            return r.fl();
        }
        );
        if (typeof t !== "undefined")
            t.exports = window.QTMPL["BookingExpressItem"]
    }
    (t.exports, t, e);
    e.____MODULES["51e29bbefde42914b2669949ec76d133"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "bb4111fe1ad7242b2f1abc934c7f920b",
        filename: "expressInfoView.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        e.____MODULES["51e29bbefde42914b2669949ec76d133"];
        var i = e.____MODULES["285adc5af3055e36addfeabe5289c690"];
        var s = e.____MODULES["8d5168dbb4341c76a4be945117498c25"];
        var o = e.____MODULES["de4518e1da70f9df1cd8ca708e702414"];
        var u = o.extend();
        u.fn.init = function(e) {
            this.controller = e;
            this.expressInfo = e.data.expressInfo;
            this.expressModel = window.model.dataModel.expressModel;
            this.checheModel = window.model.dataModel.checheModel;
            this._data = e.data;
            this.CONTAINER_ID = this.expressModel.CONTAINER_ID;
            this.XINCHENDAN_ID = this.expressModel.XINCHENDAN_ID;
            this.BAOXIAN_ID = this.expressModel.BAOXIAN_ID;
            this.XINCHENDAN_CONTAINER_ID = this.expressModel.XINCHENDAN_CONTAINER_ID;
            this.KUAIDI_CONTAINER_ID = this.expressModel.KUAIDI_CONTAINER_ID;
            this.SAVE_TO_ID = this.expressModel.SAVE_TO_ID;
            this.NO_XCD_TIP = this.expressModel.NO_XCD_TIP;
            this.LXINVOICE = this.expressModel.LXINVOICE;
            this.LXINVOICE_CONTAINER = this.expressModel.LXINVOICE_CONTAINER;
            this.JCONTAINER = this.expressModel.JCONTAINER;
            return this
        }
        ;
        u.fn.render = function() {
            this.drawStruct();
            if (!this.expressModel.ipost) {
                this._initDOMSelector();
                this._delegateEvents();
                this._initAreaSelect();
                this._addChecker()
            }
        }
        ;
        u.fn.drawStruct = function() {
            var e = QTMPL.BookingExpressItem.render(this.controller.expressModel);
            this.JCONTAINER = $(this.CONTAINER_ID).html(e)
        }
        ;
        u.fn._get = function(e) {
            var t = this;
            return $.trim(t.DOM(e).data("YSELECTOR").val()) ? t.DOM(e).data("YSELECTOR").text() : ""
        }
        ;
        u.fn._addChecker = function() {
            var e = this;
            $.checker.addItem({
                name: "address_length",
                message: "地址总长度不能超过100位",
                check: function(t, n) {
                    var r = $.trim(t);
                    var i = e._get("province") + e._get("city") + e._get("county");
                    r = i + r;
                    if (r.length > 100) {
                        n.result(false)
                    } else {
                        n.result(true)
                    }
                }
            });
            $.checker.addItem({
                name: "title_length",
                message: "单位名称总长度不能超过100位",
                check: function(e, t) {
                    var n = $.trim(e);
                    if (n.length > 100) {
                        t.result(false)
                    } else {
                        t.result(true)
                    }
                }
            })
        }
        ;
        u.fn.DOM = function(e) {
            return this.DOM_HASH_[e]
        }
        ;
        u.fn.getDataById = function(e, t) {
            var n = this.getPassengerDataById(e), r;
            if (n && n.addresses) {
                for (var i = 0, s = n.addresses.length; i < s; i++) {
                    r = n.addresses[i];
                    if (r.addressId === t) {
                        return r
                    }
                }
            }
            return null 
        }
        ;
        u.fn.getPassengerDataById = function(e) {
            if (!e) {
                return null 
            }
            var t = this
              , n = t.contactData;
            for (var r = 0, i = n.length; r < i; r++) {
                if (n[r].id === e) {
                    return n[r]
                }
            }
            return null 
        }
        ;
        u.fn.sync2contact = function() {
            var e = this;
            if (typeof BM_Contactor === "undefined") {
                return e.__synced = true
            }
            var t = BM_Contactor.instance.intro();
            e.DOM("name").val(t.name);
            e.DOM("phone").val(t.mobile === "通知出票状态和航班短信" ? "收件人手机号码" : t.mobile);
            e.__synced = true
        }
        ;
        u.fn.isSynced = function() {
            return this.__synced
        }
        ,
        u.fn._delegateEvents = function() {
            var e = this;
            var t = $(e.XINCHENDAN_CONTAINER_ID);
            var n = "#" + e.XINCHENDAN_ID;
            var r = "#" + e.BAOXIAN_ID;
            var i = "#" + e.LXINVOICE;
            var s = $(e.LXINVOICE_CONTAINER);
            e.showing = false;
            e.JCONTAINER.delegate(n + "," + r + "," + i, "click", function() {
                var o = $(n).is(":checked");
                var u = $(r).is(":checked");
                var a = $(i).is(":checked");
                var f = t.is(":visible");
                var l = e.expressInfo.isLXInvoice;
                if ((o || u || a) && !f) {
                    setTimeout(function() {
                        $("#rembur_conact .J-yh2_radio").eq(0).trigger("click")
                    }
                    , 0)
                }
                if ((o || u) && !f || l && a && !f) {
                    t.removeClass("hide");
                    if (e.checheModel._showCar) {
                        if (e.checheModel.isChecked() || e._data.showFPOriginal) {
                            s.removeClass("hide")
                        }
                    } else {
                        s.removeClass("hide")
                    }
                    e.updatePrice({
                        delivery: e.expressModel.price
                    });
                    if (!e.isSynced()) {
                        e.sync2contact()
                    }
                    $("#delivery,#selftoken,#expressMail").eq(0).click();
                    e.showing = true
                } else if (!o && !u && f || l && !a && f) {
                    t.addClass("hide");
                    s.addClass("hide");
                    e.updatePrice({
                        delivery: 0
                    });
                    e.showing = false
                }
            }
            ).delegate("#selftoken", "click", function() {
                $(e.KUAIDI_CONTAINER_ID).hide();
                e._deliveryPrice("zq");
                e.updatePrice({
                    delivery: 0
                })
            }
            ).delegate("#delivery", "click", function() {
                $(e.KUAIDI_CONTAINER_ID).show();
                e._deliveryPrice("kd", e._provAndCity());
                if (e.showing) {
                    e.updatePrice({
                        delivery: e.expressModel.price
                    })
                }
            }
            ).delegate("#expressMail", "click", function() {
                e._deliveryPrice("kddf");
                e.updatePrice({
                    delivery: 0
                })
            }
            );
            e.DOM("address_list").delegate("input", "click", function() {
                var t = $(this);
                var n = t.data("id");
                var r = t.data("cid");
                var i = e.getDataById(r, n);
                var s = e.DOM("province").data("YSELECTOR")
                  , o = e.DOM("city").data("YSELECTOR")
                  , u = e.DOM("county").data("YSELECTOR")
                  , a = e.DOM("addressid");
                if (i) {
                    a.val(i.addressId);
                    s.val(i.province);
                    o.val(i.city);
                    u.val(i.district);
                    e.DOM("address").val(i.detail).jvalid()
                } else {
                    a.val("");
                    s.val("");
                    o.val("");
                    u.val("");
                    e.DOM("address").val("").jvalidTip("reset")
                }
                e.DOM("address").placeholder();
                e.DOM("name").placeholder();
                e.DOM("phone").placeholder()
            }
            )
        }
        ;
        u.fn.initClickBoard = function(e) {
            function n(e) {
                var n = parseInt($(e).data("id"), 10)
                  , r = t.getPassengerDataById(n);
                window.doNotTriggerAddrSel = true;
                setTimeout(function() {
                    window.doNotTriggerAddrSel = false
                }
                , 500);
                if (r) {
                    t.setValue(r)
                }
            }
            function r(e) {
                t.reset()
            }
            var t = this;
            t._clickBoard = new s({
                type: "single",
                oncheck: n,
                onuncheck: r,
                container: "#rembur_conact",
                data: e,
                title: "常用联系人"
            });
            t.contactData = e;
            $("#save_express_to_user").attr("checked", true).removeClass("hide").next().removeClass("hide")
        }
        ;
        u.fn.setValue = function(e) {
            var t = this;
            var n = e.invoices && e.invoices[0] ? e.invoices[0].company || "" : undefined;
            var r = e.invoices && e.invoices[0] && +e.invoices[0].invoiceType || -1;
            t.DOM("id").val(e.id);
            t.DOM("name").val(e.name).jvalid();
            t.DOM("phone").val(e.mobile).jvalid();
            if (n == "个人") {
                n = ""
            }
            if (this.expressInfo.isLXInvoice) {
                n !== undefined ? t.DOM("receiverTitle").val(n).blur() : t.DOM("receiverTitle").val("").blur();
                n === undefined && t.DOM("receiverType").data("YSELECTOR").val("1", true);
                n === "" && t.DOM("receiverType").data("YSELECTOR").val("2", true);
                r === 5 && t.DOM("invoiceType").data("YSELECTOR").val("2", true);
                r === 4 && t.DOM("invoiceType").data("YSELECTOR").val("1", true);
                r === -1 && t.DOM("invoiceType").data("YSELECTOR").val("2", true)
            }
            var i = (e.addresses || []).slice(0)
              , s = [];
            i.push({
                addressId: "",
                detail: "新地址"
            });
            $.each(i, function(n, r) {
                var i = "existing_address" + r.addressId;
                s.push('<p class="adres_text">');
                s.push('<input style="vertical-align:middle;" id="', i, '" data-cid="', e.id, '" data-id="', r.addressId, '" name="existing_addressinfo" type="radio" class="checkbox checkbox2" />');
                s.push('<label for="', i, '">', t._toName(r.province), t._toName(r.city), t._toName(r.district), r.detail, "</label></p>")
            }
            );
            t.DOM("address_list").html(s.join(""));
            t.DOM("address_list").find("input:first").click()
        }
        ;
        u.fn.reset = function() {
            var e = this;
            e.DOM("id").val("");
            e.DOM("name").val("").jvalidTip("reset");
            e.DOM("phone").val("").jvalidTip("reset");
            e.DOM("address_list").html("");
            e.DOM("addressid").val("");
            e.DOM("province").data("YSELECTOR").val("");
            e.DOM("city").data("YSELECTOR").val("");
            e.DOM("county").data("YSELECTOR").val("");
            e.DOM("address").val("").jvalidTip("reset");
            e.DOM("address").placeholder();
            e.DOM("name").placeholder();
            e.DOM("phone").placeholder()
        }
        ;
        u.fn.formatData = function(e) {
            var t = {};
            t["1"] = {
                name: "root",
                code: "1",
                children: []
            };
            for (var n in e) {
                if (isNaN(parseInt(n, 10))) {
                    continue
                }
                var r = e[n]
                  , i = r[1] || "1"
                  , s = t[i];
                t[n] = {
                    name: r[0],
                    code: n,
                    parent: r[1]
                };
                if (s) {
                    if (!s.children) {
                        s.children = []
                    }
                    s.children.push(n)
                }
            }
            return t
        }
        ;
        u.fn._initDOMSelector = function() {
            var e = this;
            e.DOM_HASH_ = {
                id: $("[name=express_id]", e.JCONTAINER),
                name: $("[name=receiver]", e.JCONTAINER),
                phone: $("[name=receiver_phone]", e.JCONTAINER),
                addressid: $("[name=schedule_id]", e.JCONTAINER),
                province: $("[name=schedule_province]", e.JCONTAINER),
                city: $("[name=schedule_city]", e.JCONTAINER),
                county: $("[name=schedule_county]", e.JCONTAINER),
                address: $("[name=receiver_address]", e.JCONTAINER),
                delivery: $("#delivery_price"),
                address_list: $("#existing_addressinfo"),
                receiverTitleWrapper: $("#js_receiverTitle"),
                receiverTitle: $("[name=receiverTitle]", e.JCONTAINER),
                invoiceType: $("[name=invoiceType]", e.JCONTAINER),
                receiverType: $("[name=receiverType]", e.JCONTAINER)
            }
        }
        ;
        u.fn._deliveryPrice = function(e, t) {
            var n = this
              , r = n.expressInfo[e]
              , i = {};
            if (r) {
                if (t != null ) {
                    i = r[t]
                } else {
                    i = r
                }
                if (!i) {
                    i = r["全国"]
                }
            }
            if (n._data.expressInfo.isFree) {
                $(".v-pr-baoyou").removeClass("hide");
                $("#js_label_baoyou").mouseenter(function() {
                    $(".js_panel_baoyou").removeClass("hide")
                }
                );
                $("#js_label_baoyou").mouseleave(function() {
                    $(".js_panel_baoyou").addClass("hide")
                }
                );
                i = r["包邮"]
            } else if (n._data.expressInfo.isLXInvoice) {
                i = r["旅行发票"]
            }
            n.expressModel.priceId = i && i.id || "";
            n.expressModel.price = i && i.price || 0;
            n.DOM("delivery").html("&yen;" + n.expressModel.price)
        }
        ;
        u.fn._provAndCity = function() {
            var e = this;
            var t = e.DOM("province").data("YSELECTOR");
            var n = e.DOM("city").data("YSELECTOR");
            return [t.text(), n.text()].join("|")
        }
        ;
        u.fn._toName = function() {}
        ;
        u.fn._initAreaSelect = function() {
            function e(e) {
                return r[e] ? r[e].name : ""
            }
            function t(t, n) {
                var r = [];
                if (n) {
                    r.push(n)
                }
                $.each(t, function(t, n) {
                    r.push({
                        value: n,
                        text: e(n)
                    })
                }
                );
                return r
            }
            u.fn._toName = e;
            var n = this;
            var r = n.formatData(AreaData);
            var i = r["1"].children;
            var s = n.DOM("province")[0].options;
            s.add(new Option("选择省"," "));
            $.each(i, function(t, n) {
                s.add(new Option(e(n),n))
            }
            );
            var o = n.DOM("county");
            o.yselector({
                emptyHidden: true
            });
            var a = n.DOM("city");
            a.yselector({
                onchange: function(e) {
                    var i = e.value
                      , s = r[i]
                      , u = s && s.children ? s.children : [];
                    if (f) {
                        var l = n._provAndCity();
                        n._deliveryPrice("kd", l);
                        if (n.showing) {
                            n.updatePrice({
                                delivery: n.expressModel.price
                            })
                        }
                    }
                    o.data("YSELECTOR").setOptions(t(u, u.length ? null  : {
                        value: " ",
                        text: "选择区/县"
                    }));
                    a.val(e.value).change();
                    !window.doNotTriggerAddrSel && ~function() {
                        setTimeout(function() {
                            if (o.find("option").size() > 1 && !a.parent().find(".yselector_suggest").is(":visible")) {
                                if (o.parent().find(".yselector_suggest").is(":visible")) {
                                    o.parent().find(".yselector_input").click();
                                    e.value !== " " && o.parent().find(".yselector_input").click();
                                    return
                                }
                                e.value !== " " && o.parent().find(".yselector_input").click()
                            } else {
                                if (o.parent().find(".yselector_suggest").is(":visible")) {
                                    o.parent().find(".yselector_input").click();
                                    return
                                }
                            }
                        }
                        , 200)
                    }
                    ()
                }
            });
            var f = n.DOM("province");
            f.yselector({
                onchange: function(e) {
                    var n = e.value;
                    var i = r[n];
                    var s = i && i.children ? i.children : [];
                    a.data("YSELECTOR").setOptions(t(s, s.length ? null  : {
                        value: " ",
                        text: "选择市"
                    }));
                    f.val(e.value).change();
                    !window.doNotTriggerAddrSel && ~function() {
                        setTimeout(function() {
                            if (a.find("option").size() > 1) {
                                if (a.parent().find(".yselector_suggest").is(":visible")) {
                                    a.parent().find(".yselector_input").click().click();
                                    return
                                }
                                a.parent().find(".yselector_input").click()
                            } else {
                                if (a.parent().find(".yselector_suggest").is(":visible")) {
                                    a.parent().find(".yselector_input").click();
                                    return
                                }
                            }
                        }
                        , 100)
                    }
                    ()
                }
            });
            var l = n.DOM("invoiceType");
            var c = n.DOM("receiverType");
            l.yselector({
                emptyHidden: true
            });
            c.yselector({
                onchange: function(e) {
                    if (e.text === "单位") {
                        n.DOM("receiverTitleWrapper").show()
                    } else {
                        n.DOM("receiverTitleWrapper").hide()
                    }
                }
            });
            n.DOM("address").placeholder();
            n.DOM("receiverTitle").placeholder();
            n.DOM("name").placeholder();
            n.DOM("phone").placeholder()
        }
        ;
        u.fn.updatePrice = function(e) {
            i.trigger("update.priceinfo", [e])
        }
        ;
        u.fn.disableInsure = function(e, t) {
            var n = $("#" + self.BAOXIAN_ID);
            var r = $("#" + self.XINCHENDAN_ID);
            var i = $(self.XINCHENDAN_CONTAINER_ID);
            var s = $("#" + self.LXINVOICE);
            if (!e && !t) {
                n.attr("disabled", "disabled").removeAttr("checked");
                if (!r.is(":checked") && !s.is(":checked")) {
                    i.addClass("hide");
                    this.updatePrice({
                        delivery: 0
                    })
                }
            } else {
                if (r.is(":checked") || s.is(":checked")) {
                    i.removeClass("hide")
                }
                n.removeAttr("disabled")
            }
        }
        ;
        n.exports = u
    }
    (t.exports, t, e);
    e.____MODULES["bb4111fe1ad7242b2f1abc934c7f920b"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "52e9a4a07db8f8820524b836b25c354a",
        filename: "ExpressInfo.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        var i = e.____MODULES["285adc5af3055e36addfeabe5289c690"];
        var s = e.____MODULES["312540359c661f626d6031b9f938e9a2"];
        var o = e.____MODULES["bb4111fe1ad7242b2f1abc934c7f920b"];
        var u = s.create();
        u.fn.initialize = function(e) {
            if (!$(e.expressModel.CONTAINER_ID).length) {
                return
            }
            this.data = e.originData;
            this.expressModel = e.expressModel;
            this.showSpecialRuleMsg();
            this.view = new o;
            this.view.init(this);
            this.view.render();
            this._channelBind()
        }
        ;
        u.fn._channelBind = function() {
            var e = this;
            var t = e.view;
            i.on("disableinsure.expressinfo", function(e, n, r) {
                t.disableInsure(n, r)
            }
            );
            i.on("contactdataready.expressinfo", function(e, n) {
                t.initClickBoard(n)
            }
            )
        }
        ;
        u.fn.showSpecialRuleMsg = function() {
            i.trigger("showSpecialRuleMsg.flightInfo", this.expressModel.xcdMsg)
        }
        ;
        n.exports = u
    }
    (t.exports, t, e);
    e.____MODULES["52e9a4a07db8f8820524b836b25c354a"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "1a3055ad7c0e1c58869a31c25ec0f1f9",
        filename: "index.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        e.____MODULES["b65f2b9c54818a017af4d43ef5e08565"];
        var i = e.____MODULES["52e9a4a07db8f8820524b836b25c354a"];
        n.exports = i
    }
    (t.exports, t, e);
    e.____MODULES["1a3055ad7c0e1c58869a31c25ec0f1f9"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "5c6670eb228ab2ffec365a352c359d27",
        filename: "Behavior.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(e, t, n) {
        var r = function(e, t, n) {
            function s(t) {
                e.extend(i, {
                    _: (new Date).getTime(),
                    s: "flight_tts",
                    p: "booking"
                }, t || {});
                (new Image).src = r + "?" + e.param(i);
                i = {}
            }
            function o(e) {
                this.data = e;
                this.autoRun()
            }
            var r = "http://log.flight.qunar.com/l.gif";
            var i = {};
            e.extend(o.prototype, {
                monitor: function(e, t) {
                    if (!e)
                        return;
                    try {
                        i.r = e;
                        this[e](t)
                    } catch (n) {}
                },
                autoRun: function() {
                    this.monitor("onlyChineseID");
                    this._userStatusBanner()
                },
                bookingrefactor: function(n) {
                    var r = n.passenger
                      , i = r.getQuantity();
                    var o = {
                        duration: new Date - t.PAGESTARTTIME,
                        passengerNum: r.getAllPassenger().length,
                        isexpress: e("#xingchengdan_container").is(":visible"),
                        child: i.isChild ? true : false,
                        infant: i.isInfant ? true : false,
                        login: UserStatus.isLogin() ? true : false
                    };
                    e.extend(o, r.getBookingRefactorLog());
                    e.extend(o, r.getBookingRefactorErrorTimeLog());
                    s(o)
                },
                reSearch: function() {
                    s()
                },
                pageReady: function(e) {
                    s(e)
                },
                changCabinTips: function() {
                    s()
                },
                priceChangeTips: function() {
                    s()
                },
                cheche: function(e) {
                    s(e)
                },
                onlyChineseID: function() {
                    var e = this.data.policyInfo;
                    if (e && e.cardType === 1) {
                        s()
                    }
                },
                login: function(e) {
                    s(e)
                },
                bannerClick: function(e) {
                    s(e)
                },
                ywinsure: function(e) {
                    s(e)
                },
                _userStatusBanner: function() {
                    var t = this;
                    e("#login_status").delegate("a", "click", function(n) {
                        var r = e(this).data("type");
                        if (r === "login") {
                            t.monitor("login", {
                                from: "banner"
                            })
                        }
                        t.monitor("bannerClick", {
                            type: r
                        })
                    }
                    )
                }
            });
            return o
        }
        (jQuery, window);
        t.exports = r
    }
    (t.exports, t, e);
    e.____MODULES["5c6670eb228ab2ffec365a352c359d27"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "3758945b7eaa3d3aa1f7915de8a5fef2",
        filename: "index.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        var i = e.____MODULES["285adc5af3055e36addfeabe5289c690"];
        var s = e.____MODULES["5c6670eb228ab2ffec365a352c359d27"];
        var o = new s;
        i.on("monitor.behavior", function(e, t, n) {
            o.monitor(t, n)
        }
        )
    }
    (t.exports, t, e);
    e.____MODULES["3758945b7eaa3d3aa1f7915de8a5fef2"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "74170b052b808487bbddd2f987b7c6b7",
        filename: "init_hover.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(e, t, n) {
        var r = function(e) {
            function n(e, t) {
                var n = "";
                if (e.hasClass("xth"))
                    n = "xth";
                if (e.hasClass("xfx"))
                    n = "xfx";
                if (e.hasClass("lfx"))
                    n = "lfx";
                if (e.hasClass("vgt"))
                    n = "vgt";
                if (e.hasClass("lcf"))
                    n = "lcf";
                if (e.hasClass("delayInrPromotionSum"))
                    n = "delayInrPromotionSum";
                if (t)
                    n = t;
                return n
            }
            function r(t, n) {
                var r = "";
                switch (t) {
                case "delayInrPromotionSum":
                    var i = e(".delayInrPromotionSum").attr("data-cut");
                    r = ['<div class="tips_contair j-tipElement" style="display:none;">', '<i class="bot"></i>', '<i class="top"></i>', '<div class="tips_content" style="width:270px;">', '<p class="title">购延误险享优惠：</p>', '<p>1. 待支付金额已为您自动扣除优惠金额<span class="rmb" style="color:#535353">&yen;' + i + "</span>；</p>", "<p>2. 若订单申请退款或改签，优惠金额将全部收回。</p>", "</div>", "</div>"].join("");
                    break;
                case "lfx":
                    r = ['<div class="tips_contair j-tipElement" style="display:none">', '<i class="bot"></i>', '<i class="top"></i>', '<div class="tips_content">', '<p class="title">返现说明：</p>', "<p>1. 航班起飞后24小时内，返现自动打入原支付账户，预计3到15个工作日到账；</p>", "<p>2. 购买后，一旦提出退票/改签等服务要求，将收回返现；</p>", "<p>3. 儿童票不参与返现。</p>", "</div>", "</div>"].join("");
                    break;
                case "xfx":
                    r = ['<div class="tips_contair j-tipElement" style="display:none">', '<i class="bot"></i>', '<i class="top"></i>', '<div class="tips_content">', '<p class="title">返现活动说明：</p>', "<p>1. 起飞后24小时内即返现到原支付账户；</p>", "<p>2. 此产品参与返现促销活动，退票或改签适用返现促销退改签规则；</p>", "<p>3. 如提出退票/改签等服务要求，将收回返现优惠；</p>", "<p>4. 儿童票不参与返现促销活动。</p>", "</div>", "</div>"].join("");
                    break;
                case "xth":
                    var i = n.data("cut")
                      , s = i && parseInt(i) ? '(<span style="font-family:Arial, Helvetica, sans-serif;">&yen;</span>' + parseInt(i) + "/人)" : "";
                    r = ['<div class="tips_contair j-tipElement" style="display:none">', '<i class="bot"></i>', '<i class="top"></i>', '<div class="tips_content">', '<p class="title">低价特惠活动说明：</p>', "<p>1. 此产品参与低价特惠促销活动，退票或改签适用低价特惠促销退改签规则；</p>", "<p>2. 如低价特惠促销退改签规则不能满足您的需求，请选购非低价特惠产品或放弃低价特惠促销优惠", s, "；</p>", "<p>3. 儿童票不参与低价特惠促销活动。</p>", "</div>", "</div>"].join("");
                    break;
                case "vgt":
                    var o = e(".vgt").attr("data-price");
                    var u = e(".vgt").attr("data-num");
                    var a = e(".vgt").attr("data-vtype");
                    var f = e(".vgt").attr("data-stype");
                    var l = e(".vgt").attr("data-vname");
                    var c = o * u;
                    r = ['<div class="tips_contair j-tipElement tips_contair_giftpack" style="display:none;">', '<i class="bot"></i>', '<i class="top"></i>', '<div class="tips_content" style="width:290px;">', "<h3>买保险赠超值礼包</h3>", '<p>礼包含<span class="rmb">&yen;' + o + "</span>" + l + "</p>", '<p class="txt-right"><a href="http://flight.qunar.com/site/zhuanti/voucher_gift.htm?voucherType=' + a + "&voucherPrice=" + o + "&saleType=" + f + "&voucherName=" + l + '" target="_blank">查看详情</a></p>', "</div>", "</div>"].join("");
                    break;
                case "lcf":
                    r = ['<div class="tips_contair j-tipElement" style="display:none">', '<i class="bot"></i>', '<i class="top"></i>', '<div class="tips_content">', '<p class="title">非常贷活动说明：</p>', "<p>1. 此产品参加非常贷促销活动，如申请退票或改签，按照订单原票价结算退还手续费，去哪儿网提供的非常贷需在支付成功后六个月内返还。</p>", "<p>2. 儿童票、婴儿票不参与非常贷促销活动。</p>", "</div>", "</div>"].join("");
                    break
                }
                return r
            }
            var t = function() {}
            ;
            e.extend(t.prototype, {
                live: function(t) {
                    var i = e(".j-hoverElement");
                    var s = "";
                    var o;
                    var u = [];
                    if (i.length) {
                        for (var a = 0; a < i.length; a++) {
                            s = n(e(i[a]), t);
                            var o = e(i[a]).find(".j-tipElement");
                            if (!o.length) {
                                u = e("#J_AfterSaleUFeiInfo").html() || r(s, e(i[a]));
                                e(i[a]).append(u)
                            }
                        }
                        i.bind("mouseover", function() {
                            e(this).find(".j-tipElement").css("display", "block")
                        }
                        );
                        i.bind("mouseout", function() {
                            e(this).find(".j-tipElement").css("display", "none")
                        }
                        )
                    } else {
                        return false
                    }
                }
            });
            return t
        }
        (jQuery);
        t.exports = window.INIT_hover = r;
        $(function() {
            var e = new r;
            e.live()
        }
        )
    }
    (t.exports, t, e);
    e.____MODULES["74170b052b808487bbddd2f987b7c6b7"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "58f41993b55d2fa26451b18043097dd7",
        filename: "index.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        var i = window.PAGESTARTTIME = +(new Date);
        var s = e.____MODULES["285adc5af3055e36addfeabe5289c690"];
        e.____MODULES["a22f37bb1b28023d69e4ac11871e89f1"];
        s.trigger("LOG4J.info", "js开始执行！GO----------》");
        s.trigger("LOG4J.info", ["用户信息：", navigator.userAgent]);
        var o = e.____MODULES["cb61dad8a0292fc704d2812c59067e2a"];
        e.____MODULES["6fced91ae0f26ad2328764bd973046f7"];
        e.____MODULES["56651e552f7af646f30e83853e831698"];
        e.____MODULES["8c66c344f7c4c50b5de0d128d5abff77"];
        e.____MODULES["817c9ea8e3e8856a5b8ebdf933f97238"];
        e.____MODULES["ec564127d68765f47596a307f28f0a90"];
        var u = e.____MODULES["6a3dab0cb951b473e4628f2f71eb875a"];
        var a = e.____MODULES["adfadb2be855dffad11464ff93cc2119"];
        var f = e.____MODULES["b81526ff831f68e589f9b05d7ca82ebe"];
        var l = e.____MODULES["3578550f71897dcf6279362af4a4992c"];
        var c = e.____MODULES["5e81da89e129ae12b13783a31f469173"];
        var h = e.____MODULES["05878ba784827f60182f01a29d9c2d40"];
        var p = e.____MODULES["14ec9688ebbf8542a34e7ca7b2c280ed"];
        var d = e.____MODULES["32fb017c1b235daa5f8fbcfa867a9e2f"];
        var v = e.____MODULES["6cfaa2812d34505984b4a57643074349"];
        var m = e.____MODULES["d6feb296fd4e8fc9174297ffbe54f407"];
        var g = e.____MODULES["c2fb5ec17525a1d0e16dfa6cad37d58e"];
        var y = e.____MODULES["9b9f7559f023970a13fe0f801ca6b69f"];
        var b = e.____MODULES["cbca373e8d3464aa1bcc0d27ff9e4df4"];
        var w = e.____MODULES["a79d8298509685891e2e50bd5f4f0192"];
        var E = e.____MODULES["0c828e7548ccc142cfd74816836e342c"];
        var S = e.____MODULES["4a9d43464cbcc1df6abb94f1b9c2e3bd"];
        var x = e.____MODULES["f51a8ef6e7fe1912267410cabee51825"];
        var T = e.____MODULES["1a3055ad7c0e1c58869a31c25ec0f1f9"];
        e.____MODULES["3758945b7eaa3d3aa1f7915de8a5fef2"];
        e.____MODULES["74170b052b808487bbddd2f987b7c6b7"];
        s.trigger("LOG4J.info", "各个模块require完毕");
        s.on("dataready.datamodel", function(e, t) {
            new u(t);
            new g(t);
            new S(t);
            new E(t);
            new h(t);
            new c(t);
            new x(t);
            new v(t);
            new p(t);
            new d(t);
            new T(t);
            new l(t);
            if (t.originData.qdhInfo) {
                new y(t);
                new b(t)
            }
            new w(t);
            s.trigger("dataready.page", [t])
        }
        );
        o.done(function(e) {
            s.trigger("LOG4J.info", ["data.done() ++>", +(new Date) - i, "ms"]);
            var t = window.model;
            var n = t.autoRun;
            var r = t.dataModel;
            for (var o = 0, u = n.length; o < u; o++) {
                n[o](e)
            }
            r.originData = e;
            s.trigger("dataready.datamodel", [r]);
            s.trigger("LOG4J.info", ["total time:", +(new Date) - i, "ms"])
        }
        );
        o.fail(function(e) {
            new a(e)
        }
        )
    }
    (t.exports, t, e);
    e.____MODULES["58f41993b55d2fa26451b18043097dd7"] = t.exports
}
)(this);
(function(e) {
    var t = {
        id: "3d39fe9060ecacda1f098e8b88937c05",
        filename: "booking.js",
        exports: {}
    };
    if (!e.____MODULES) {
        e.____MODULES = {}
    }
    var n = function(t, n, r) {
        e.____MODULES["0dd3c075f303fe34bafc6a52f4ed7aa8"];
        e.____MODULES["58f41993b55d2fa26451b18043097dd7"]
    }
    (t.exports, t, e);
    e.____MODULES["3d39fe9060ecacda1f098e8b88937c05"] = t.exports
}
)(this)

